{
  "use_case_name": "Manage Match Scheduling",
  "unique_id": "UC-004",
  "area": "Match Scheduling Management",
  "context_of_use": "The use case manages the end-to-end digital scheduling of matches, including defining scheduling rules, creating and adjusting schedules, and submitting them for review and approval to avoid bias and misunderstandings across leagues and teams.",
  "scope": "IFA Web Application Scheduling Module",
  "level": "User-goal",
  "primary_actors": [
    "ifa administrator",
    "ifa representative",
    "league",
    "team"
  ],
  "supporting_actors": [
    "ifa administrator",
    "ifa representative",
    "league",
    "team"
  ],
  "stakeholders_and_interests": [
    "ifa administrator: Wants to handle scheduling digitally, define unbiased scheduling rules, adjust schedules to leagues’ time zones, and provide suggested schedules to all stakeholders efficiently.",
    "ifa representative: Wants to check, approve, and confirm schedules and all schedule changes, with explicit reasons, to ensure fairness and avoid bias.",
    "league: Wants to make changes to the schedule so that it can be adjusted to teams and referees while remaining aligned with approved rules.",
    "team: Wants matches to be scheduled at least four days apart so that the team has enough time to prepare.",
    "CIO: Wants the scheduling capabilities to be integrated as part of a unified system that improves communication and transparency among stakeholders."
  ],
  "description": "This use case describes how match schedules are digitally created, governed by defined rules, adjusted by leagues and teams, and reviewed and approved by IFA representatives to ensure fair, unbiased, and clear scheduling for all stakeholders.",
  "triggering_event": "An ifa administrator initiates the creation or update of a digital match schedule for a league using the scheduling platform.",
  "trigger_type": "External",
  "preconditions": [
    "The IFA Web Application Scheduling Module is operational and accessible to authorized users.",
    "The ifa administrator is authenticated and authorized to manage match scheduling.",
    "League and team entities, including their match and referee data, exist in the system.",
    "User interfaces for ifa administrator, ifa representative, league, and team are available in the unified system."
  ],
  "postconditions": [
    "A match schedule that complies with defined scheduling rules, including minimum rest periods and time zone alignment, is stored in the system.",
    "All approved schedules and approved schedule changes are recorded with explicit reasons where changes were requested.",
    "The latest version of the schedule is marked as approved by an ifa representative.",
    "All stakeholders have access to the approved schedule through the system according to their roles."
  ],
  "assumptions": [
    "The ifa administrator has previously configured league, team, and referee master data required for creating schedules.",
    "The system already supports user authentication and role-based authorization for ifa administrator, ifa representative, league, and team.",
    "Time zone information for each league is available in the system to allow the ifa administrator to adjust schedules accordingly.",
    "The four-day minimum interval between matches for a team is treated as a scheduling rule that the system can validate but that can still be reviewed and approved by an ifa representative if exceptions arise.",
    "Leagues and teams interact with the scheduling module via their dedicated user interfaces as requested by the CIO but do not gain any scheduling capabilities beyond those specified in the requirement text.",
    "The scheduling platform is part of a broader unified system that merges existing systems, but this use case only covers scheduling-related behavior."
  ],
  "requirements_met": [
    "The system shall provide a digital scheduling platform that allows an ifa administrator to create and manage match schedules so that schedules can be suggested to all stakeholders.",
    "The system shall support handling scheduling activities digitally to improve the efficiency of the scheduling process.",
    "The system shall allow an ifa administrator to define rules for scheduling games, including rules intended to avoid bias.",
    "The system shall allow an ifa administrator to adjust each schedule to the corresponding league’s time zone to avoid misunderstandings.",
    "The system shall allow a league to request changes to the existing schedule so that it can be adjusted to teams and referees.",
    "The system shall allow a team’s match schedule to be validated against the rule that each match is scheduled at least four days apart to ensure preparation time.",
    "The system shall allow an ifa representative to check and approve initial schedules before they become effective.",
    "The system shall require that a league or other permitted stakeholder provide explicit reasons for each requested schedule change.",
    "The system shall present explicit reasons for schedule changes to an ifa representative for review to support bias avoidance.",
    "The system shall require that an ifa representative confirm every approved change in the schedule before the change is applied.",
    "The system shall maintain a record of schedule versions and approved changes for transparency among stakeholders."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The policy for handling conflicts between the four-day separation rule for team matches and other scheduling constraints is not defined.",
    "It is not specified which roles, besides leagues, may initiate schedule change requests (e.g., teams or referees) within this use case.",
    "The escalation process for schedule change requests that are repeatedly rejected by the ifa representative is not defined.",
    "Criteria for what constitutes acceptable reasons for schedule changes to avoid bias have not been formally described.",
    "It is unclear whether automatic notifications to stakeholders upon schedule approval or change are required as part of this use case or handled elsewhere in the system."
  ],
  "main_flow": [
    "1. ifa administrator initiates scheduling → System displays the scheduling platform with options to define or update match schedules.",
    "2. ifa administrator defines scheduling rules (including bias-avoidance rules and minimum rest periods) → System records and stores the scheduling rules for subsequent validation of schedules.",
    "3. ifa administrator selects a league and season to schedule → System retrieves and displays existing matches, teams, and referees associated with the selected league and season.",
    "4. ifa administrator proposes match dates, times, and venues → System creates a draft schedule and applies the defined scheduling rules, including checking that each team’s matches are at least four days apart.",
    "5. ifa administrator adjusts schedule to league time zone → System converts and presents all scheduled match times in the league’s time zone and updates the draft schedule accordingly.",
    "6. team reviews its proposed match dates → System displays the team’s draft match schedule including date intervals between matches.",
    "7. team confirms that the draft schedule respects its preparation needs → System records the team’s confirmation as part of the draft schedule metadata.",
    "8. league reviews the draft schedule for its competitions → System displays the draft schedule to the league, including matches, times, venues, and assigned referees.",
    "9. league submits the reviewed draft schedule for approval → System marks the schedule as pending approval and notifies the ifa representative within the system context.",
    "10. ifa representative accesses the pending schedule → System displays the schedule along with applied rules and any recorded confirmations from teams and leagues.",
    "11. ifa representative checks schedule for compliance with defined scheduling rules and bias-avoidance objectives → System highlights any rule violations or potential bias indicators for review.",
    "12. ifa representative approves the schedule → System marks the schedule as approved, stores the approved version, and makes it available to all authorized stakeholders.",
    "13. league identifies a need for schedule adjustment after approval → System displays the currently approved schedule for modification requests.",
    "14. league proposes specific schedule changes and provides explicit reasons for each change → System records the requested changes together with the explicit reasons and marks them as pending confirmation.",
    "15. ifa representative reviews the proposed schedule changes and their reasons → System presents the requested changes, associated reasons, and any impacts on scheduling rules for evaluation.",
    "16. ifa representative confirms the schedule changes → System applies the confirmed changes to the schedule, updates the approved version, and records the confirmation and reasons in the schedule history."
  ],
  "alternative_flows": [
    "AF-1 (from Step 4): If the ifa administrator imports or reuses a previously stored draft schedule instead of creating all match dates manually, the system shall load the existing draft schedule, apply the current scheduling rules, highlight any new violations, and then proceed to Step 5.",
    "AF-2 (from Step 6): If the team chooses not to provide explicit confirmation of its preparation needs at this time, the system shall record that no team confirmation was provided and the flow shall continue directly to Step 8 for league review.",
    "AF-3 (from Step 9): If the league wishes to submit the draft schedule to additional internal reviewers before sending it for ifa representative approval, the system shall keep the schedule in draft status for league-internal review and, once the league submits it for approval, the flow continues at Step 10.",
    "AF-4 (from Step 15): If the ifa representative decides that additional justification is required for certain schedule change requests, the system shall mark those changes as requiring further clarification and return the change request to the league for updated reasons; once updated reasons are submitted, the flow resumes at Step 15 for re-evaluation."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): If the ifa administrator attempts to define scheduling rules that conflict with existing mandatory organizational policies, the system shall reject the conflicting rules, display an error message describing the conflict, and retain the last valid set of rules, after which the use case ends without updating the rules.",
    "EF-2 (from Step 4): If the proposed match dates cannot produce a schedule that satisfies the four-day separation rule for one or more teams, the system shall flag the conflicts, prevent the draft schedule from being finalized, and request the ifa administrator to revise the proposed dates before proceeding, thereby halting progression beyond Step 4 until corrected.",
    "EF-3 (from Step 10): If the ifa representative cannot access the pending schedule due to missing or corrupted schedule data, the system shall log the error, notify the ifa administrator of data inconsistency, and prevent approval actions until the data issue is resolved, after which the current execution of this use case is terminated.",
    "EF-4 (from Step 16): If applying confirmed schedule changes fails due to a system error, the system shall roll back any partial changes, maintain the previously approved schedule version as active, log the error for technical review, and notify the ifa administrator and ifa representative that the change could not be applied, ending the current instance of the use case."
  ],
  "information_for_steps": [
    "1. League identifier, season identifier, user session data for ifa administrator.",
    "2. Scheduling rule set, bias-avoidance rules, minimum rest period rule (e.g., four days between matches), validation parameters.",
    "3. League identifier, season identifier, list of matches, teams, referees, existing schedule data (if any).",
    "4. Match identifiers, proposed dates and times, venue identifiers, applied scheduling rules, rule validation results per match and per team.",
    "5. League time zone information, converted match times, updated schedule entries.",
    "6. Team identifier, team-specific subset of schedule, date intervals between the team’s consecutive matches.",
    "7. Team confirmation status, timestamp of confirmation, reference to the relevant draft schedule version.",
    "8. League identifier, full draft schedule view, competition identifiers, match details (date, time, venue, referees).",
    "9. Schedule version identifier, submission metadata, league review status, approval request status.",
    "10. Schedule version identifier, pending approval flag, rule compliance summary, stakeholder confirmations.",
    "11. Defined scheduling rules, detected rule violations, bias indicators, review notes of ifa representative.",
    "12. Approval decision, approval timestamp, approver identifier, approved schedule version identifier.",
    "13. Current approved schedule version, league identifier, matches eligible for change.",
    "14. Proposed schedule changes (old and new values), explicit reasons for each change, change request identifier.",
    "15. Change request identifier, reasons for changes, rule impact analysis, decision options for ifa representative.",
    "16. Confirmed schedule changes, updated approved schedule version, change confirmation metadata, schedule history records."
  ]
}