{
  "use_case_name": "View Operational Analytics Data",
  "unique_id": "UC-007",
  "area": "Analytics",
  "context_of_use": "The systems analyst views operational analytics data to perform hospital capacity and staffing analysis.",
  "scope": "Hospital Management System",
  "level": "User-goal",
  "primary_actors": [
    "systems analyst"
  ],
  "supporting_actors": [],
  "stakeholders_and_interests": [
    "systems analyst: needs access to operational data for analysis"
  ],
  "description": "This use case allows the systems analyst to view bed occupancy, room scheduling, and employee scheduling information for analytical purposes.",
  "triggering_event": "The systems analyst initiates a request to view operational analytics data.",
  "trigger_type": "External",
  "preconditions": [
    "The systems analyst is logged into the hospital management system.",
    "The operational analytics data is available in the system."
  ],
  "postconditions": [
    "The systems analyst successfully views bed occupancy, room scheduling, and employee scheduling data."
  ],
  "assumptions": [
    "The system has the capability to display operational analytics data.",
    "The data is up-to-date and accurate."
  ],
  "requirements_met": [
    "The system shall allow the systems analyst to view bed occupancy data.",
    "The system shall allow the systems analyst to view room scheduling data.",
    "The system shall allow the systems analyst to view employee schedules."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "Clarification on data refresh rates for operational analytics."
  ],
  "main_flow": [
    "1. systems analyst → The system displays the operational analytics dashboard.",
    "2. systems analyst → The system retrieves and displays bed occupancy data.",
    "3. systems analyst → The system retrieves and displays room scheduling data.",
    "4. systems analyst → The system retrieves and displays employee scheduling data."
  ],
  "alternative_flows": [
    "AF-1 (from Step 1): If the systems analyst selects a specific report, then the system displays the detailed report for that data."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): If the bed occupancy data is unavailable, then the system displays an error message indicating data retrieval failure."
  ],
  "information_for_steps": [
    "1. Operational analytics dashboard",
    "2. Bed occupancy data",
    "3. Room scheduling data",
    "4. Employee scheduling data"
  ]
}