{
  "use_case_name": "Use Mobile Hospital System",
  "unique_id": "UC-015",
  "area": "Mobile Access Management",
  "context_of_use": "This use case provides doctors with mobile access to hospital management functionalities and electronic medical record integration for mobile-collected data.",
  "scope": "Hospital Management System",
  "level": "User-goal",
  "primary_actors": [
    "doctor"
  ],
  "supporting_actors": [],
  "stakeholders_and_interests": [
    "doctor: Access to hospital management functionalities on mobile devices."
  ],
  "description": "This use case allows doctors to integrate mobile devices with electronic medical records and use the hospital management system on mobile devices.",
  "triggering_event": "Doctor initiates the use of the mobile hospital system.",
  "trigger_type": "External",
  "preconditions": [
    "Doctor has a mobile device.",
    "Doctor is authenticated in the hospital management system."
  ],
  "postconditions": [
    "Doctor can access hospital management functionalities on the mobile device.",
    "Data collected on mobile devices is stored centrally."
  ],
  "assumptions": [
    "The hospital management system supports mobile access.",
    "The mobile device is compatible with the hospital management system."
  ],
  "requirements_met": [
    "The system shall allow doctors to integrate mobile devices with electronic medical records.",
    "The system shall provide mobile access to hospital management functionalities."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "Clarification on the specific functionalities available on mobile devices."
  ],
  "main_flow": [
    "1. Doctor integrates mobile devices with electronic medical records → System stores data collected on mobile devices centrally.",
    "2. Doctor uses the hospital management system on a mobile device → System provides access to hospital management functionalities.",
    "3. Doctor accesses hospital management functionalities → System displays the same functionalities as on a personal computer."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): If the doctor needs to schedule appointments, the system allows access to the schedule appointments functionality.",
    "AF-2 (from Step 3): If the doctor needs to record clinical encounter data, the system allows access to the record clinical encounter data functionality.",
    "AF-3 (from Step 3): If the doctor needs to manage prescriptions, the system allows access to the manage prescriptions functionality."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): If the integration fails, the system notifies the doctor of the failure and suggests troubleshooting steps."
  ],
  "information_for_steps": [
    "1. Mobile device information",
    "2. Authentication credentials",
    "3. Access permissions"
  ]
}