{
  "use_case_name": "Manage Notifications",
  "unique_id": "UC-004",
  "area": "Notifications and Communications",
  "context_of_use": "The use case allows authenticated stakeholders to send and receive system-managed notifications and live updates about games, cancellations, and rescheduling in order to keep all parties informed in real time.",
  "scope": "IFA League Management System",
  "level": "User-goal",
  "primary_actors": [
    "ifa",
    "referee",
    "fan"
  ],
  "supporting_actors": [
    "notification delivery service",
    "match scheduling component",
    "game event recording component"
  ],
  "stakeholders_and_interests": [
    "ifa: Requires all stakeholders to be informed simultaneously about game cancellations, rescheduling, and other critical updates to support fair planning and transparency.",
    "referee: Requires timely notifications about game cancellations and rescheduling to adjust personal schedules and avoid double bookings.",
    "fan: Requires timely notifications about rescheduling and live game events in order to stay accurately informed about games they follow.",
    "teams: Require that their fans, players, and staff receive accurate and timely notifications about games and schedule changes to maintain engagement and avoid confusion.",
    "system operator: Requires reliable, scalable notification behavior to support high concurrent user volumes without system failure."
  ],
  "description": "This use case describes how authenticated IFA users initiate notifications regarding game cancellations and related announcements, and how referees and fans receive notifications and live game event updates about games, cancellations, and rescheduling through the system.",
  "triggering_event": "An authenticated stakeholder initiates a notification-related action, such as creating a game cancellation announcement or subscribing to receive game-related notifications.",
  "trigger_type": "External",
  "preconditions": [
    "The IFA League Management System is operational and reachable by stakeholders.",
    "The primary actor has successfully authenticated with the system prior to managing notifications.",
    "Relevant game, schedule, and stakeholder data required to determine notification recipients already exist in the system.",
    "Stakeholders intended to receive notifications have valid contact endpoints registered in the system, such as in-app notification channels."
  ],
  "postconditions": [
    "Created notifications about games, cancellations, rescheduling, or live game events are stored in the system with their associated metadata.",
    "Intended recipients have notification records associated with their accounts that can be retrieved and viewed through the system.",
    "For live game events, fans who follow the relevant teams or players have corresponding real-time update entries recorded and available in the system.",
    "The system maintains a traceable history of notification dispatch attempts linked to the underlying game or schedule events."
  ],
  "assumptions": [
    "It is assumed that the \"authenticate\" use case, referenced by the include relationship, is completed successfully before any notification management actions are performed in this use case.",
    "It is assumed that the system provides an in-app notification mechanism capable of presenting notifications and live updates to referees and fans without requiring external communication tools.",
    "It is assumed that fans have the ability, outside the scope of this use case, to follow specific teams or players, and that the system uses this follow information to determine which fans receive game-related notifications.",
    "It is assumed that referees and other stakeholders have their roles and game assignments already registered in the system so that recipient groups for cancellation and rescheduling notifications can be determined.",
    "It is assumed that live game event data is entered into the system in real time by referees using a separate game event recording capability, and that this use case focuses on distributing corresponding notifications to subscribed stakeholders.",
    "It is assumed that multiple stakeholder types, including but not limited to IFA, referees, fans, and teams, use the same underlying IFA League Management System as described in the requirement text.",
    "It is assumed that when the IFA communicates about game cancellations through the system, this communication is realized as notifications and related updates that are pushed to all relevant stakeholders simultaneously.",
    "It is assumed that notification content is generated in a language and format appropriate for the recipient, but detailed localization rules are handled by lower-level mechanisms outside this use case.",
    "It is assumed that the notification delivery service and related infrastructure are part of the overall system environment and are available when this use case executes."
  ],
  "requirements_met": [
    "The system shall allow the IFA to communicate notifications through the system to all relevant stakeholders about game cancellations so that everyone is informed simultaneously.",
    "The system shall send notifications to fans when games they are interested in are rescheduled so that they know if something has changed.",
    "The system shall send notifications to referees about game cancellations and rescheduling so that they can adjust their plans accordingly.",
    "The system shall deliver live game event updates, based on real-time game event data, to fans who follow the relevant teams or players so that they know exactly what is happening during games.",
    "The system shall ensure that notifications related to games, cancellations, and rescheduling are distributed to all targeted stakeholders without requiring external communication methods.",
    "The system shall allow only authenticated stakeholders to initiate notification-related actions in order to preserve integrity and accountability of sent notifications."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The specific notification channels to be used (e.g., push notifications, email, SMS, in-app only) are not defined and require clarification.",
    "Policies for notification frequency, throttling, and aggregation of multiple updates into a single notification are not specified.",
    "Rules for determining exactly which stakeholders receive which categories of notifications, beyond basic following relationships and role-based relevance, need to be formally defined.",
    "Requirements for notification localization with respect to user language and regional settings, including fallback behavior, remain to be specified in detail.",
    "Retention period and auditing requirements for stored notification history, including compliance-related constraints, have not been determined."
  ],
  "main_flow": [
    "1. Actor (ifa, referee, or fan) initiates access to the notification features of the system → System presents an authentication interface and verifies the actor's identity according to the included \"authenticate\" use case.",
    "2. Actor (ifa, referee, or fan) accesses the notifications area or service after successful authentication → System displays the actor-specific notification dashboard, including available actions for sending or viewing notifications.",
    "3. Actor (ifa) creates a new game-related notification, such as a game cancellation or rescheduling announcement, and confirms the action → System records the notification content, links it to the relevant game or schedule entry, determines the affected stakeholder groups, and prepares the notification for dispatch.",
    "4. Actor (ifa) submits the created notification for distribution → System dispatches the notification to all determined stakeholders, including referees and fans associated with the affected games, and records the dispatch metadata.",
    "5. Actor (referee) views received notifications about game cancellations or rescheduling in the system → System retrieves all notifications addressed to the referee and presents them in chronological order with their associated game and schedule details.",
    "6. Actor (fan) views received notifications about game cancellations or rescheduling for followed teams or players → System retrieves notifications relevant to the fan's followed entities and displays them with clear indications of the type of change.",
    "7. Actor (fan) requests to view live game updates for an ongoing game involving followed teams or players → System retrieves the latest recorded game event data, transforms relevant events into live updates, and presents them as an ordered timeline to the fan.",
    "8. Actor (ifa, referee, or fan) optionally acknowledges or marks notifications as read after reviewing them → System updates the read status of the corresponding notifications for the actor's account while keeping the notification history available.",
    "9. Actor (ifa, referee, or fan) ends interaction with the notification features → System maintains all created notifications, read states, and dispatch records for future access and traceability."
  ],
  "alternative_flows": [
    "AF-1 (from Step 3): IFA sends a general informational update instead of a cancellation or rescheduling notice. Condition: The IFA chooses to communicate a non-scheduling-related message, such as a general announcement, using the same notification mechanism. The IFA enters the general informational content and confirms the notification. The system records the general notification, determines the relevant recipients based on predefined recipient groups or roles, and prepares it for dispatch. Flow then continues at Step 4, where the system dispatches the notification to all determined stakeholders.",
    "AF-2 (from Step 7): Fan subscribes specifically to live updates for a single game session. Condition: The fan chooses to follow live updates only for one selected ongoing game instead of all games involving followed teams or players. The fan selects the specific game and confirms the subscription for that game. The system filters live game event updates so that only events for the selected game are retrieved and displayed to the fan as an ordered timeline. The flow then continues within Step 7 behavior for subsequent event updates and later proceeds to Step 8 when the fan acknowledges or marks notifications as read."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): Authentication fails. Condition: The actor provides invalid or incomplete authentication credentials. The system rejects the authentication attempt, does not grant access to notification features, and displays an error message indicating that access is denied. The use case terminates without creating, sending, or viewing any notifications.",
    "EF-2 (from Step 3): Required game or schedule data for the planned notification is unavailable. Condition: The IFA attempts to create a notification for a game or schedule entry that the system cannot locate or that has inconsistent data. The system informs the IFA that the selected game or schedule cannot be used for notification, logs the issue, and prevents submission of the notification. The flow returns to Step 3, where the IFA may select a different game or cancel the action.",
    "EF-3 (from Step 4): Notification dispatch to some recipients fails. Condition: During dispatch, the system detects failures when sending notifications to one or more recipients, for example due to unreachable endpoints. The system records the failed dispatch attempts, flags the affected notifications, and informs the IFA that some recipients may not have received the notification. The system completes dispatch for all other reachable recipients and the use case continues to Step 5 for recipients who successfully received notifications.",
    "EF-4 (from Step 7): Live game updates cannot be retrieved. Condition: The system cannot access current game event data for the selected ongoing game, for example due to missing real-time input. The system informs the fan that live updates are temporarily unavailable and displays the most recent known information, if any. The fan may retry accessing live updates later or exit the live updates view, after which the flow continues to Step 8 if any notifications are acknowledged, or the use case terminates."
  ],
  "information_for_steps": [
    "1. Authentication credentials, actor identifier, session token.",
    "2. Actor role information, notification dashboard configuration data, list of available notification-related actions.",
    "3. Notification content, notification type (e.g., cancellation, rescheduling, general announcement), related game identifier, related schedule identifier, targeted stakeholder groups.",
    "4. Recipient lists resolved from stakeholder groups, notification dispatch timestamps, delivery status indicators, dispatch logs.",
    "5. Referee identifier, list of received notifications, game identifiers, schedule change details, read status flags.",
    "6. Fan identifier, list of relevant received notifications, followed team identifiers, followed player identifiers, rescheduling and cancellation details, read status flags.",
    "7. Game identifier for ongoing game, sequence of recorded game event data, timestamps for game events, mapping from events to live update messages, fan subscriptions for live updates.",
    "8. Notification identifiers, read and acknowledgment status, actor identifier, timestamp of acknowledgment actions.",
    "9. Complete notification history records, actor session information, persistent storage of notifications, read statuses, and dispatch logs."
  ]
}