{
  "use_case_name": "Report Measure Impacts",
  "unique_id": "UC-006",
  "area": "Urban Mobility Planning and Impact Analysis",
  "context_of_use": "The use case is used by an urban mobility planner to generate formal reports on the impacts of a specific traffic measure in terms of pollution, fairness, cost, and congestion, based on previously estimated measure impacts.",
  "scope": "Urban Mobility Planning Decision Support System",
  "level": "User-goal",
  "primary_actors": [
    "urban mobility planner"
  ],
  "supporting_actors": [
    "Impact Estimation Subsystem"
  ],
  "stakeholders_and_interests": [
    "Urban mobility planner: Wants to obtain accurate, comprehensive and explainable impact reports on a measure for validation of proposals.",
    "City administration (including the mayor): Wants reliable reports to understand consequences of proposed measures for decision making.",
    "Affected neighborhoods: Want fair treatment and transparency regarding whether a measure disadvantages their area.",
    "Environmental agencies: Want pollution and emission related information to be accurately represented in reports.",
    "Financial oversight bodies: Want cost-related impacts of measures to be correctly reported for budgeting and justification.",
    "Traffic management authorities: Want congestion-related impacts to be clearly described to support operational planning."
  ],
  "description": "This use case allows the urban mobility planner to generate and obtain a report that describes the impacts of a selected traffic measure on pollution, fairness, cost, and congestion, using previously estimated measure impacts provided by the system.",
  "triggering_event": "The urban mobility planner decides to create a report on the impacts of a specific traffic measure.",
  "trigger_type": "External",
  "preconditions": [
    "The urban mobility planner is authenticated and authorized to access measure impact information within the system.",
    "The traffic measure to be reported on has been defined and stored in the system.",
    "Estimated impacts for the selected measure (including at least pollution, fairness, cost, and congestion indicators) are available in the system from the included impact estimation functionality."
  ],
  "postconditions": [
    "A measure impact report containing pollution, fairness, cost, and congestion effects for the selected measure is generated by the system.",
    "The generated measure impact report is presented to the urban mobility planner for review.",
    "The generated measure impact report is stored by the system in an accessible form for later retrieval by the urban mobility planner."
  ],
  "assumptions": [
    "It is assumed that the Urban Mobility Planning Decision Support System already provides an \"estimate measure impacts\" capability, as referenced by the include relationship, and that this capability is invoked before or during report generation without requiring new functionality beyond what is mentioned.",
    "It is assumed that each traffic measure has a unique identifier and associated metadata that allow the system to retrieve the corresponding impact estimations.",
    "It is assumed that pollution effects, fairness, cost, and congestion impacts are already quantified or categorized by the system prior to report generation and do not need additional computation logic beyond the referenced estimation functionality.",
    "It is assumed that the urban mobility planner can select one measure at a time for the purpose of generating a specific impact report within this use case.",
    "It is assumed that the format and layout of the generated report are predefined by system configuration and do not require the planner to design a custom template within this use case.",
    "It is assumed that the term \"report\" in the user stories refers to the generation of a structured, persistent document or view summarizing measure impacts, but no new export format capabilities are introduced beyond system-standard output.",
    "It is assumed that the \"Impact Estimation Subsystem\" represents the internal system functionality corresponding to the target use case \"estimate measure impacts\" and is treated as a supporting actor for clarity, without adding new external systems."
  ],
  "requirements_met": [
    "The system shall allow the urban mobility planner to generate a report on the pollution effects of a selected traffic measure in order to support validation of the proposal.",
    "The system shall allow the urban mobility planner to generate a report on the fairness of a selected traffic measure in order to support validation of the proposal.",
    "The system shall allow the urban mobility planner to generate a report on the cost of a selected traffic measure in order to support validation of the proposal.",
    "The system shall allow the urban mobility planner to generate a report on the congestion effects of a selected traffic measure in order to support validation of the proposal.",
    "The system shall, when generating a measure impact report, retrieve the latest available estimated impacts for pollution, fairness, cost, and congestion associated with the selected measure.",
    "The system shall present the generated measure impact report to the urban mobility planner in a consolidated view covering pollution, fairness, cost, and congestion impacts for the selected measure.",
    "The system shall store the generated measure impact report so that the urban mobility planner can access it later for further validation or communication."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The required level of detail and exact structure for pollution, fairness, cost, and congestion sections in the report has not been specified.",
    "The required persistence duration and retention policy for stored measure impact reports has not been defined.",
    "The acceptable freshness and versioning rules for underlying impact estimations used in reports have not been clarified.",
    "The need for different report variants (e.g., executive summary vs. detailed analysis) within this specific use case has not been formally distinguished from other reporting-related use cases.",
    "Access control rules for sharing or viewing generated reports by stakeholders other than the initiating urban mobility planner have not been defined."
  ],
  "main_flow": [
    "1. Urban mobility planner selects the option to generate a measure impact report → System displays a list or selection mechanism for available traffic measures.",
    "2. Urban mobility planner selects the specific traffic measure for which impacts should be reported → System records the selected measure and confirms the selection context.",
    "3. Impact Estimation Subsystem (included \"estimate measure impacts\") provides the latest available impact estimations for pollution, fairness, cost, and congestion for the selected measure → System retrieves and consolidates these impact estimations for reporting purposes.",
    "4. Urban mobility planner confirms the intention to generate the report using the retrieved impact estimations → System validates that all required impact categories (pollution, fairness, cost, and congestion) are available for the selected measure.",
    "5. Urban mobility planner optionally selects which of the available impact categories (pollution, fairness, cost, congestion) to include in the report, within the limits of the available estimations → System records the selected impact categories for inclusion in the report.",
    "6. Urban mobility planner submits the report generation request → System composes a measure impact report including the selected impact categories (pollution, fairness, cost, congestion) with their corresponding values and explanatory context based on the retrieved estimations.",
    "7. System stores the generated measure impact report in the system’s repository associated with the selected measure and the initiating urban mobility planner → System confirms successful storage and associates metadata such as generation timestamp and measure identifier.",
    "8. System presents the generated measure impact report to the urban mobility planner for review in a readable format → Urban mobility planner reviews the displayed report and can use it for proposal validation purposes."
  ],
  "alternative_flows": [
    "AF-1 (from Step 5): Urban mobility planner chooses to include all available impact categories without making individual selections. Condition: The planner prefers a comprehensive report. System behavior: System automatically sets pollution, fairness, cost, and congestion to be included in the report and proceeds directly to Step 6 while informing the planner that all available categories will be reported.",
    "AF-2 (from Step 2): Urban mobility planner changes the selected measure before confirming report generation. Condition: The planner realizes that another measure should be reported. System behavior: System allows the planner to select a different measure, updates the selection context, and then the flow continues from Step 3 with the newly selected measure.",
    "AF-3 (from Step 8): Urban mobility planner requests to regenerate the report after reviewing it, based on updated impact estimations that are already available. Condition: New estimations have been computed outside this use case. System behavior: System returns the flow to Step 3, retrieves the latest impact estimations, and proceeds through Steps 4 to 8 to generate an updated report."
  ],
  "exception_flows": [
    "EF-1 (from Step 3): Impact estimations for one or more required categories (pollution, fairness, cost, congestion) are unavailable for the selected measure. System behavior: System notifies the urban mobility planner that the report cannot be generated due to missing impact estimations for specified categories, logs the condition, and terminates the use case without generating or storing a report.",
    "EF-2 (from Step 4): Validation detects that the retrieved impact data is inconsistent or corrupted. System behavior: System informs the urban mobility planner that an internal data inconsistency prevents secure report generation, aborts the report creation process, and advises the planner to retry after data has been corrected; the use case ends without generating or storing a report.",
    "EF-3 (from Step 7): System fails to store the generated measure impact report due to a storage or persistence error. System behavior: System notifies the urban mobility planner that report storage has failed, discards the partially stored report, and does not present it as successfully generated; the use case ends with no persistent report available.",
    "EF-4 (from Step 1): The urban mobility planner loses authorization or session expires before completing the report generation. System behavior: System requires re-authentication and cancels the current report generation process, ensuring that no incomplete report is stored; the use case ends after the cancellation."
  ],
  "information_for_steps": [
    "1. Available traffic measures list, measure identifiers, measure names.",
    "2. Selected measure identifier, selected measure metadata (e.g., name, description).",
    "3. Impact estimations for the selected measure: pollution impact indicators, fairness impact indicators, cost estimates, congestion impact indicators.",
    "4. Availability status of required impact categories, validation flags, completeness indicators for pollution, fairness, cost, and congestion data.",
    "5. Planner’s selection of impact categories to include in the report (pollution, fairness, cost, congestion).",
    "6. Composed report content including selected impact categories, descriptive text, numerical or categorical impact values, measure reference data.",
    "7. Report storage metadata including report identifier, associated measure identifier, planner identifier, generation timestamp, storage location.",
    "8. Rendered report view data including structured sections for pollution, fairness, cost, and congestion impacts, and any summary information for planner review."
  ]
}