{
  "use_case_name": "Monitor System Usage",
  "unique_id": "UC-010",
  "area": "System Monitoring and Scalability Management",
  "context_of_use": "The IFA uses the system to monitor stakeholder resource usage and verify that the system can handle the required number of concurrent users to maintain transparency and stability during normal and peak operating conditions.",
  "scope": "IFA Stakeholder Management System",
  "level": "User-goal",
  "primary_actors": [
    "ifa"
  ],
  "supporting_actors": [
    "System Monitoring Service",
    "Capacity Management Service"
  ],
  "stakeholders_and_interests": [
    "IFA: Requires continuous transparency over stakeholder resource usage and assurance that the system can accommodate current and future user loads.",
    "Stakeholders (teams, referees, fans, other registered users): Require that their access and operations are not degraded or interrupted due to capacity or resource issues.",
    "System Operations and Infrastructure Owners: Require clear monitoring outputs to plan infrastructure and scaling decisions based on observed usage and concurrency levels."
  ],
  "description": "This use case describes how the IFA monitors the use of different resources by stakeholders and checks that the system can scale to support a large number of concurrent users, thereby ensuring transparency and preventing system crashes during peak times.",
  "triggering_event": "The IFA initiates a monitoring session to review stakeholder resource usage and current system capacity indicators.",
  "trigger_type": "External",
  "preconditions": [
    "The IFA has a valid user account registered in the IFA Stakeholder Management System.",
    "The IFA is successfully authenticated in the system.",
    "The system is operational and collecting usage and capacity metrics from its components.",
    "Stakeholders are using system resources in a way that can be measured by the monitoring functions."
  ],
  "postconditions": [
    "The IFA has viewed up-to-date information about stakeholder resource usage.",
    "The IFA has viewed up-to-date information about current user concurrency and capacity-related indicators.",
    "The IFA has sufficient monitoring information to assess transparency of resource usage and the system’s ability to support the targeted number of concurrent users at the time of monitoring.",
    "The system has recorded that a monitoring session was performed by the IFA."
  ],
  "assumptions": [
    "It is assumed that \"resources\" refer to measurable system resources such as application features, data access, storage usage, and processing load attributable to stakeholders, without defining any new resource types beyond what the system already supports.",
    "It is assumed that the system provides real-time or near real-time monitoring data that is sufficiently current to support the transparency objective implied in the requirement text.",
    "It is assumed that supporting at least 50,000 concurrent users is interpreted as a capacity objective that is assessed via observable indicators (e.g., active sessions count and performance metrics) without introducing any new scaling mechanisms beyond what already exists in the system.",
    "It is assumed that the \"System Monitoring Service\" and \"Capacity Management Service\" are internal subsystems of the IFA Stakeholder Management System and not separate external actors, and they are listed only as supporting components to clarify responsibilities.",
    "It is assumed that the included \"authenticate\" use case performs user credential verification and session establishment before the IFA can access any monitoring functions.",
    "It is assumed that the IFA accesses monitoring information through a secure user interface within the system and does not directly access underlying infrastructure tools.",
    "It is assumed that the system continuously collects baseline usage and concurrency metrics so that IFA-initiated monitoring sessions do not need to trigger additional data collection mechanisms."
  ],
  "requirements_met": [
    "The system shall allow the IFA to monitor the use of different system resources by stakeholders in a manner that supports constant transparency.",
    "The system shall present the IFA with real-time or near real-time indicators of stakeholder resource usage during a monitoring session.",
    "The system shall allow the IFA to view information related to system capacity for new users to support decisions about expanding user capacity.",
    "The system shall provide the IFA with information about the current and recent number of concurrent users.",
    "The system shall support at least 50,000 concurrent users without system crash under defined peak operating conditions.",
    "The system shall require the IFA to be authenticated before accessing any system usage or capacity monitoring information.",
    "The system shall record that an IFA monitoring session has occurred, including timestamp and the fact that resource usage and capacity views were accessed."
  ],
  "priority": "High",
  "risk": "High",
  "outstanding_issues": [
    "The precise definition and granularity of \"resources\" to be monitored for each stakeholder type have not been specified and require clarification.",
    "The exact performance criteria and thresholds for supporting at least 50,000 concurrent users (e.g., maximum response times, acceptable error rates) are not defined and require specification.",
    "The retention period and level of historical detail for monitored usage and capacity data have not been determined.",
    "Access control policies for which specific monitoring views the IFA may see (e.g., aggregated vs. stakeholder-level data) require refinement to address privacy and governance constraints.",
    "The specific frequency and data freshness requirements for \"real-time\" or near real-time monitoring are not formally specified and need to be agreed."
  ],
  "main_flow": [
    "1. IFA initiates a login to the system → System executes the included \"authenticate\" use case to verify IFA credentials and establish an authenticated session.",
    "2. IFA selects the system usage monitoring function from the available menu → System displays the system usage monitoring dashboard entry point to the IFA.",
    "3. IFA requests to view current stakeholder resource usage information → System retrieves and presents aggregated and stakeholder-attributable resource usage metrics for the current period.",
    "4. IFA reviews stakeholder resource usage information on the monitoring dashboard → System continuously refreshes and maintains the displayed resource usage metrics for the duration of the session according to the system’s monitoring update policy.",
    "5. IFA requests to view current concurrent user and capacity-related indicators → System retrieves and displays current concurrent user counts and associated capacity indicators relevant to assessing support for the target number of concurrent users.",
    "6. IFA examines the concurrent user and capacity indicators to assess whether the system is operating within acceptable limits → System highlights any capacity-related status indicators according to predefined system thresholds without altering configuration.",
    "7. IFA optionally navigates between resource usage views and capacity views during the same monitoring session → System updates the displayed information accordingly while maintaining the authenticated session context.",
    "8. IFA ends the monitoring session by logging out or closing the monitoring interface → System records the completion of the monitoring session and terminates or times out the IFA session in accordance with security policies."
  ],
  "alternative_flows": [
    "AF-1 (from Step 4): If the IFA chooses to filter stakeholder resource usage information by stakeholder type, league, or time range, the IFA adjusts the available filter controls on the monitoring dashboard → System applies the selected filters to the existing resource usage metrics and redisplays the filtered usage information, after which the flow continues with Step 4 as the IFA may further review the updated data.",
    "AF-2 (from Step 7): If the IFA decides to export a snapshot of the currently viewed usage and capacity information for offline analysis or reporting, the IFA activates the dashboard export function → System generates an export of the currently displayed monitoring metrics in a predefined format and makes it available for download within the interface, after which the flow resumes at Step 7 with the IFA continuing to navigate or proceeds to Step 8 to end the session."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): If authentication of the IFA fails due to invalid credentials, the system denies access to monitoring functions, displays an authentication error message to the IFA, and logs the failed authentication attempt; the use case terminates without establishing a session.",
    "EF-2 (from Step 3): If current stakeholder resource usage metrics are temporarily unavailable due to a monitoring subsystem failure, the system displays an error notification indicating that usage data cannot be retrieved at this time, logs the monitoring retrieval failure, and offers the IFA the option to retry the request; if the IFA chooses not to retry or repeated attempts fail, the use case continues directly to Step 5 if capacity indicators are available, or otherwise terminates.",
    "EF-3 (from Step 5): If current concurrent user and capacity indicators cannot be retrieved due to data source unavailability, the system displays an appropriate error message to the IFA, logs the capacity indicator retrieval failure, and allows the IFA either to continue viewing any available resource usage information per Step 4 or to end the monitoring session per Step 8.",
    "EF-4 (from Step 8): If the IFA session is unexpectedly terminated due to session timeout or connection loss before the IFA explicitly ends the monitoring session, the system automatically records the session termination event and invalidates the session token; any unsaved monitoring views are discarded and the use case ends."
  ],
  "information_for_steps": [
    "1. IFA identifier, authentication credentials, authentication result, session token.",
    "2. IFA role and permissions, list of available functions, monitoring dashboard configuration.",
    "3. Stakeholder identifiers, stakeholder types, resource usage metrics, time period parameters.",
    "4. Real-time or near real-time usage metric values, dashboard refresh interval settings.",
    "5. Current concurrent user count, capacity utilization indicators, target concurrent user threshold (e.g., 50,000 users).",
    "6. Capacity status indicators, threshold comparison results, highlighting state for indicators.",
    "7. Navigation state, selected views (resource usage or capacity), applied filters and dashboard layout settings.",
    "8. Session identifier, session start and end timestamps, monitoring activity log entries."
  ]
}