{
  "use_case_name": "Generate Measure Reports",
  "unique_id": "UC-003",
  "area": "Urban Mobility Planning and Reporting",
  "context_of_use": "The urban mobility planner uses the system to generate qualitative and quantitative reports on an evaluated mobility measure or solution, summarizing its pollution, fairness, cost, and congestion impacts for different audiences.",
  "scope": "Urban Mobility Planning Decision-Support System",
  "level": "User-goal",
  "primary_actors": [
    "urban mobility planner"
  ],
  "supporting_actors": [
    "Urban Mobility Data Repository",
    "Impact Estimation Engine"
  ],
  "stakeholders_and_interests": [
    "Urban mobility planner: Requires accurate and comprehensive reports to validate mobility proposals and communicate their consequences.",
    "Mayor: Requires concise executive summaries of proposed solutions to support policy and investment decisions.",
    "Consultancy company: Requires extensive technical reports to analyze and justify proposed mobility measures.",
    "City residents: Expect that proposed measures are evaluated fairly regarding congestion, pollution, noise, and neighborhood impact.",
    "Environmental agencies: Require visibility into pollution-related impacts of proposed measures.",
    "Municipal finance department: Requires transparency about estimated costs of proposed measures."
  ],
  "description": "This use case describes how the urban mobility planner generates reports on a selected measure or solution, including its pollution effects, fairness implications, cost, congestion impacts, and solution summaries, for use in validating proposals and informing different stakeholders.",
  "triggering_event": "The urban mobility planner decides to produce a report for a specific mobility measure or solution under evaluation.",
  "trigger_type": "External",
  "preconditions": [
    "The urban mobility planner is authenticated and authorized to access reporting functions of the Urban Mobility Planning Decision-Support System.",
    "At least one mobility measure or solution scenario exists in the system and is available for evaluation.",
    "Required input data for estimating measure impacts is stored in the Urban Mobility Data Repository.",
    "The Impact Estimation Engine is operational and accessible to the reporting function."
  ],
  "postconditions": [
    "A report about the selected measure or solution is generated by the system in the selected report type or types.",
    "The generated report contains measure impact estimations on at least pollution, fairness, cost, and congestion, consistent with the underlying estimations produced by the Impact Estimation Engine.",
    "The report is available for the urban mobility planner to view and export within the system.",
    "The system retains a record of the report generation configuration for later retrieval or regeneration."
  ],
  "assumptions": [
    "It is assumed that a separate use case \"estimate measure impacts\" exists and provides up-to-date estimations for pollution, fairness, cost, and congestion related to the selected measure or solution.",
    "It is assumed that the system maintains a consistent data model that links measures or solutions to their associated impact estimations.",
    "It is assumed that the underlying estimations are already computed or can be computed on demand by the Impact Estimation Engine without requiring manual intervention from the urban mobility planner during report generation.",
    "It is assumed that the system can generate at least two report formats: an executive summary aimed at political leadership and an extensive report aimed at technical stakeholders such as consultancy companies.",
    "It is assumed that report generation does not modify the underlying measure, solution, or impact data; it only reads and formats existing or freshly computed information.",
    "It is assumed that the Urban Mobility Data Repository and Impact Estimation Engine are internal subsystems rather than external third-party actors, and they are therefore modeled as supporting actors.",
    "It is assumed that fairness in this context refers to the relative distribution of benefits and disadvantages across neighborhoods as already defined in the impact estimation logic.",
    "It is assumed that congestion effects in the report align with previously modeled and simulated traffic conditions for the selected measure."
  ],
  "requirements_met": [
    "The system shall allow the urban mobility planner to generate a report on the pollution effects of a selected measure in order to support validation of a proposal.",
    "The system shall allow the urban mobility planner to generate a report on the fairness implications of a selected measure in order to support validation of a proposal.",
    "The system shall allow the urban mobility planner to generate a report on the cost of a selected measure in order to support validation of a proposal.",
    "The system shall allow the urban mobility planner to generate a report on the congestion effects of a selected measure in order to support validation of a proposal.",
    "The system shall allow the urban mobility planner to generate an executive summary report of a selected solution to inform the mayor about the consequences of a proposal.",
    "The system shall allow the urban mobility planner to generate an extensive report of a selected solution to inform a consultancy company about the consequences of a proposal.",
    "The system shall include the results of the \"estimate measure impacts\" functionality when generating measure reports so that reports are based on consistent impact estimations."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The required output formats for the executive summary report (for example, PDF, web view, or presentation format) have not been specified.",
    "The required output formats for the extensive report (for example, PDF, spreadsheet, or interactive dashboard) have not been specified.",
    "The level of detail and structure for pollution, fairness, cost, and congestion sections within each report type has not been defined.",
    "It is unclear whether the urban mobility planner must be able to customize which impact categories are included in a specific instance of a report.",
    "Retention policies for storing generated reports and their configurations have not been defined.",
    "It is not defined whether versioning of reports is required when underlying impact estimations are updated."
  ],
  "main_flow": [
    "1. Urban mobility planner selects the reporting function for measures or solutions → System displays the reporting interface with available measures or solutions.",
    "2. Urban mobility planner selects a specific measure or solution for which a report is to be generated → System confirms the selected measure or solution and displays its identification details.",
    "3. Urban mobility planner initiates impact estimation for the selected measure or solution → System executes the included \"estimate measure impacts\" use case via the Impact Estimation Engine and retrieves pollution, fairness, cost, and congestion impact estimations.",
    "4. Urban mobility planner selects the desired report type or types (for example, executive summary, extensive report) → System records the selected report type configuration for the current report generation.",
    "5. Urban mobility planner confirms the report generation request → System compiles the report content using the previously obtained impact estimations and measure or solution metadata.",
    "6. Urban mobility planner waits for the report generation to complete → System generates the report in the selected type or types, including sections on pollution effects, fairness implications, cost, and congestion effects, and stores the generated report and its configuration.",
    "7. Urban mobility planner views or accesses the generated report within the system → System presents the generated report to the urban mobility planner for review and provides options to export or download the report."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): If multiple related measures or solutions must be reported together, the urban mobility planner selects a set of measures or solutions instead of a single one → System confirms the selected set and applies Steps 3 to 7 to the entire set, generating a combined report that includes sections for each selected measure or solution.",
    "AF-2 (from Step 4): If the urban mobility planner requires both an executive summary and an extensive report for the same measure or solution, the planner selects multiple report types simultaneously → System generates each selected report type using the same underlying impact estimations and, upon completion, returns to Step 7 with multiple accessible report instances.",
    "AF-3 (from Step 7): If the urban mobility planner chooses to export the generated report after viewing it, the planner selects an available export option in the interface → System produces an exported copy of the report in the chosen export format and confirms successful export while keeping the original report available for further access."
  ],
  "exception_flows": [
    "EF-1 (from Step 3): If the Impact Estimation Engine fails to return valid impact estimations for the selected measure or solution, the system logs the failure and informs the urban mobility planner that impact estimations are unavailable for reporting → The system cancels the current report generation request and returns to Step 2 to allow the urban mobility planner to select a different measure or solution or to retry later.",
    "EF-2 (from Step 5): If report generation cannot proceed because required underlying data for one or more impact categories is missing or inconsistent, the system displays an error message indicating which categories are affected and does not start the report compilation → The system returns the urban mobility planner to Step 4 so that the planner may adjust report type selections or cancel the operation.",
    "EF-3 (from Step 6): If an internal error occurs during report generation, the system stops the generation process, records diagnostic information, and notifies the urban mobility planner that the report could not be generated → The system does not produce a report instance and returns to Step 5 to allow the urban mobility planner to attempt generation again after the issue is addressed."
  ],
  "information_for_steps": [
    "1. Available measures or solutions list, measure identifiers, solution names.",
    "2. Selected measure or solution identifier, descriptive attributes of the measure or solution.",
    "3. Input parameters for impact estimation, pollution impact data, fairness impact data, cost estimation data, congestion impact data.",
    "4. Selected report type or types configuration, mapping of report types to required impact categories.",
    "5. Report generation request parameters, selected measure or solution identifier, selected report type or types, timestamp of request.",
    "6. Compiled report content, structured sections for pollution, fairness, cost, and congestion, generated report files or artifacts, report metadata including creation time and creator.",
    "7. Rendered report view data, export options, export file metadata when export is requested."
  ]
}