{
  "use_case_name": "Query and Import Archive Holdings",
  "unique_id": "UC-015",
  "area": "Research Data Archive Management and Reporting",
  "context_of_use": "This use case enables designated staff and external funders to query the Bath Data Archive and obtain or include records for internally and externally held research data so that a complete and reportable view of research data holdings and funded outputs is maintained.",
  "scope": "Bath Data Archive system",
  "level": "User-goal",
  "primary_actors": [
    "bath data archive administrator",
    "research information manager",
    "fundingbody"
  ],
  "supporting_actors": [
    "existing external data centres holding Bath data",
    "institutional research information systems",
    "metadata harvesting services used by funding bodies"
  ],
  "stakeholders_and_interests": [
    "Bath Data Archive administrator: Needs to query the entire archive and import Bath data from external data centres to maintain continuity and completeness of Bath archive holdings.",
    "Research Information manager: Needs to include records for externally held data so that the university's record of data holdings is complete.",
    "Fundingbody: Needs to harvest metadata on outputs from funded research to analyse effectiveness of funding strategy and encourage cross fertilisation of research outputs.",
    "University management: Requires a complete and accurate record of research data holdings for compliance, reporting, and strategic planning.",
    "Researchers: Depend on accurate archive holdings to evidence impact and to demonstrate that their data is preserved and discoverable.",
    "External data centres holding Bath data: Need their holdings to be represented correctly when imported or referenced, without altering their local content.",
    "IT services: Require that querying and import operations do not compromise performance, integrity, or security of archive infrastructure."
  ],
  "description": "The use case describes how the bath data archive administrator, research information manager, and fundingbody interact with the Bath Data Archive system to query archive holdings, import Bath data from external data centres, and include records for externally held data, enabling reporting and metadata harvesting that together maintain a complete institutional view of research data outputs.",
  "triggering_event": "A bath data archive administrator, research information manager, or fundingbody initiates an interaction to obtain information about archive holdings or to maintain or consume a complete record of Bath research data.",
  "trigger_type": "External",
  "preconditions": [
    "The Bath Data Archive system is operational and reachable via its user or machine interface.",
    "The initiating actor is authenticated and authorised to perform archive querying, import, record inclusion, or metadata harvesting, according to institutional policies.",
    "Connectivity is available between the Bath Data Archive system and any configured external data centres or services from which data or metadata will be obtained.",
    "Relevant external data centres or metadata sources expose interfaces or data feeds that can be accessed by the Bath Data Archive system under agreed conditions.",
    "Existing archive holdings and associated metadata are stored in a structured and queryable form within the Bath Data Archive system."
  ],
  "postconditions": [
    "Requested queries over archive holdings have been executed and the results have been presented or made available to the initiating actor.",
    "When the flow involves importing from an external data centre, selected Bath data holdings from that centre have been ingested or registered into the Bath Data Archive system in accordance with the actor’s request.",
    "When the flow involves including records for externally held data, new or updated records representing those external holdings have been created or refreshed in the Bath Data Archive system so that the institutional view of data holdings is more complete.",
    "When the flow involves a fundingbody, requested metadata on outputs from funded research has been harvested or exposed so that the fundingbody can use it for analysis and cross fertilisation of research outputs.",
    "The Bath Data Archive’s representation of overall archive holdings is at least as complete and accurate as before the use case execution."
  ],
  "assumptions": [
    "It is assumed that user authentication and authorisation are handled by existing university identity and access management systems and are outside the detailed scope of this use case.",
    "It is assumed that at least one external data centre contains Bath data that can be accessed for wholesale import under prior agreement.",
    "It is assumed that externally held data to be included as records in the Bath Data Archive remains physically stored outside the Bath Data Archive and that only descriptive metadata and links are managed by this use case.",
    "It is assumed that the fundingbody interacts with the Bath Data Archive system through a machine-to-machine interface or web-based mechanism capable of harvesting metadata, without changing the underlying archive content.",
    "It is assumed that all querying, import, record inclusion, and metadata harvesting operations are read-only with respect to original external data sources, and do not modify external systems.",
    "It is assumed that detailed query construction, scheduling, and report formatting are defined by institutional reporting practices and are not extended by this use case beyond executing queries and returning their results.",
    "It is assumed that error handling for connectivity failures, malformed responses from external systems, or internal system faults will be managed as part of general system robustness and are captured here only at the level of exception flows.",
    "It is assumed that this use case extends an existing higher-level capability to manage research datasets and therefore operates only on datasets and metadata already within that broader management scope."
  ],
  "requirements_met": [
    "The system shall allow a bath data archive administrator to query the entire archive so that particular aspects of the archive holdings can be reported.",
    "The system shall allow a bath data archive administrator to import Bath data from an external data centre wholesale so that Bath data holdings in external archives are preserved within the institutional archive if those external archives close down.",
    "The system shall allow a research information manager to include records for externally held data so that the university's record of data holdings is complete.",
    "The system shall provide a means for a fundingbody to harvest metadata on outputs from research it funds so that the fundingbody can analyse the effectiveness of its funding strategy.",
    "The system shall enable harvested or exposed metadata to be used by a fundingbody to encourage cross fertilisation of research outputs.",
    "The system shall maintain archive queries, imports, and record inclusions in a manner that preserves data integrity and does not reduce the completeness or consistency of existing archive holdings."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The specific query languages, filters, and aggregation capabilities required by different institutional stakeholders are not fully defined and require further specification.",
    "The criteria and policies governing which external data centres are eligible for wholesale import and how conflicts or duplicates are resolved remain to be agreed.",
    "Technical and legal arrangements for accessing and reusing metadata from external data centres and for exposing metadata to funding bodies, including licensing and data protection constraints, need to be clarified.",
    "Service-level expectations for response times, data freshness, and availability of query, import, and metadata harvesting functions have not been formally established.",
    "The frequency and mechanisms for synchronising or updating records for externally held data, including how changes and deletions are handled, are not yet defined."
  ],
  "main_flow": [
    "1. bath data archive administrator, research information manager, or fundingbody initiates a session with the Bath Data Archive system via the configured user interface or machine interface → Bath Data Archive system authenticates the actor and confirms access rights for querying, importing, record inclusion, or metadata harvesting.",
    "2. Actor specifies the objective of the interaction, choosing between querying archive holdings, importing Bath data from an external data centre, including records for externally held data, or harvesting metadata on outputs from funded research → System presents appropriate options and input fields for the selected objective.",
    "3. Actor defines query or selection parameters such as data centre source, dataset scope, temporal range, funding references, or other available filters relevant to the chosen objective → System validates the provided parameters for completeness and syntactic correctness and confirms the intended operation.",
    "4. Actor confirms execution of the requested operation based on the configured parameters → System executes the requested operation by querying internal holdings and, where relevant, connecting to configured external data centres or metadata sources.",
    "5. System processes returned internal and, if applicable, external metadata or dataset information according to the actor’s objective → System compiles a consolidated set of results or candidate records ready for presentation or ingestion.",
    "6. System presents query results, proposed import candidates, externally held data records, or harvestable metadata summaries to the actor or consuming fundingbody service in a structured form → Actor reviews the returned results or summaries and, where applicable, selects which external holdings to import or include as records.",
    "7. Actor confirms final selection of records to import or include, or confirms acceptance of the query results or harvested metadata as returned → System performs any confirmed import or record creation or updates internal metadata representations to reflect the actor’s confirmed choices.",
    "8. System updates its internal representation of archive holdings and records of externally held data to incorporate any new or modified records resulting from the operation → System generates a completion indication or machine-readable response confirming that the requested query, import, record inclusion, or metadata harvesting action has completed successfully."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): If the actor is a research information manager and selects an objective focused solely on including records for externally held data, the system may restrict available options to those necessary for discovering and representing external holdings, bypassing any options related to wholesale import of content. After the system presents the tailored options, the flow continues at Step 3.",
    "AF-2 (from Step 2): If the actor is a fundingbody and initiates the interaction specifically to harvest metadata on outputs from funded research, the system may automatically preselect harvesting mode and present configuration fields for selecting funding identifiers, output types, and metadata formats without exposing internal administrative options. After the system presents these harvesting-specific options, the flow continues at Step 3.",
    "AF-3 (from Step 4): For large-scale or scheduled metadata harvesting by a fundingbody, the actor may request that the system prepare a reusable metadata endpoint or batch export rather than immediate interactive results. The system establishes or confirms the endpoint or batch configuration and indicates how the fundingbody can retrieve the metadata, after which the use case ends successfully without executing Steps 6 and 7 interactively.",
    "AF-4 (from Step 6): If the actor’s query objective is purely analytical reporting and does not require subsequent import or record inclusion, the actor may accept the presented query results without performing any additional selection. The system records that the query has completed and the use case ends successfully without executing Step 7 and Step 8 modifications to holdings.",
    "AF-5 (from Step 3): If the actor is operating under the extended higher-level manage research datasets capability and selects parameters that focus only on a subset of managed research datasets, the system limits the operation to that subset while following the same subsequent processing. The flow then proceeds to Step 4 under this narrower scope."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): If authentication fails or the actor does not have sufficient authorisation for any of the available operations, the system denies access, displays or returns an appropriate access error message, logs the event according to security policy, and the use case terminates without further processing.",
    "EF-2 (from Step 4): If the system cannot reach an external data centre or metadata source required for the requested operation due to connectivity or service failure, the system reports the connectivity problem to the actor, marks any affected external sources as unavailable for the current operation, and either allows the actor to retry with available sources or cancels the operation and ends the use case without modifying archive holdings.",
    "EF-3 (from Step 5): If the external data centre or metadata source returns invalid, incomplete, or incompatible responses that cannot be processed, the system discards the problematic responses, notifies the actor of the issue including which sources were affected, logs the error details for later analysis, and continues processing any remaining valid responses. If no valid responses remain, the system informs the actor that the operation could not be completed and the use case ends without changes to archive holdings.",
    "EF-4 (from Step 7): If the system encounters an internal error while performing import or record inclusion operations, the system rolls back any partial changes related to the current operation, preserves the previous consistent state of archive holdings, notifies the actor of the failure, logs diagnostic information, and the use case ends without successful completion.",
    "EF-5 (from Step 3): If the actor provides parameters that are semantically invalid, such as referencing non-existent funding identifiers or unsupported filters, the system rejects the invalid parameters, displays or returns detailed validation feedback, and prompts the actor to correct the parameters. If the actor chooses not to correct them, the use case ends without executing the requested operation."
  ],
  "information_for_steps": [
    "1. Actor identifier, role, authentication credentials, authorisation profile, connection channel.",
    "2. Selected operation type (query archive, import from external data centre, include records for externally held data, harvest metadata for fundingbody).",
    "3. Query and selection parameters such as dataset identifiers, project identifiers, funding references, external data centre identifiers, temporal ranges, and other applicable filters.",
    "4. Operation confirmation flag, execution options such as scope limits or scheduling preferences.",
    "5. Retrieved internal metadata records, retrieved external metadata or dataset descriptors from external data centres or metadata harvesting sources, processing status indicators.",
    "6. Consolidated result set including query results, candidate import lists, externally held data record candidates, or harvested metadata summaries presented in a structured format.",
    "7. Actor’s final selection of records to import or include, confirmation of acceptance of query results or harvested metadata, and any annotations or labels associated with the selection.",
    "8. Updated archive holdings metadata, newly created or updated records for externally held data, operation completion status, logs and audit entries for the executed query, import, inclusion, or harvesting action."
  ]
}