{
  "use_case_name": "Access System in Native Language",
  "unique_id": "UC-018",
  "area": "Research Data Archive – User Interface Localisation",
  "context_of_use": "A data reuser interacts with the research data archive’s web interface in their preferred language in order to reduce language-related barriers to discovering and reusing datasets.",
  "scope": "Bath Research Data Archive Web Application",
  "level": "User-goal",
  "primary_actors": [
    "data reuser"
  ],
  "supporting_actors": [
    "Archive Localisation Service"
  ],
  "stakeholders_and_interests": [
    "data reuser: Wants to access and reuse University of Bath research data without being hindered by language barriers.",
    "Bath Data Archive administrator: Wants the interface to be accessible to a broad user base to maximise data reuse while maintaining consistent presentation of archive content.",
    "Research Information manager: Wants increased reuse and impact of datasets by making the archive easy to use internationally.",
    "UnivITservice: Wants localisation implemented in a maintainable, standards-based way that is compatible with existing infrastructure.",
    "fundingbody: Wants research outputs to be widely accessible so that the impact and value of funded research can be demonstrated."
  ],
  "description": "This use case enables a data reuser to access and operate the Bath Research Data Archive interface in their native language, so that language barriers do not discourage them from reusing University of Bath data.",
  "triggering_event": "The data reuser opens the research data archive web interface with the intention of reusing data and requires the interface to be presented in their native language.",
  "trigger_type": "External",
  "preconditions": [
    "The Bath Research Data Archive web application is operational and reachable via the network.",
    "The data reuser has access to a web browser capable of displaying the archive interface.",
    "At least one supported interface language, including the system’s default language, is available in the archive localisation service."
  ],
  "postconditions": [
    "The archive interface is displayed to the data reuser in a language that the data reuser has explicitly selected or that the system has selected according to defined language selection rules.",
    "Subsequent navigation and interaction within the archive during the session use the selected interface language consistently."
  ],
  "assumptions": [
    "It is assumed that the Bath Research Data Archive is primarily accessed through a web browser and that the user interface text can be localised without altering underlying functionality.",
    "It is assumed that the system supports a finite set of predefined interface languages and does not perform on-the-fly machine translation.",
    "It is assumed that language selection can be based on user preference when explicitly provided or on browser or system locale settings when no explicit preference is given.",
    "It is assumed that dataset content (such as titles, abstracts, and files) may remain in the language in which it was deposited and is not translated as part of this use case.",
    "It is assumed that the generic \"access archive interfaces\" use case, which this use case extends, covers basic access, authentication if required, and non-localisation aspects of interacting with the archive."
  ],
  "requirements_met": [
    "The system shall allow a data reuser to access the archive interface in the data reuser’s native language when that language is supported by the system.",
    "The system shall provide a mechanism for the data reuser to select a preferred interface language from the set of supported languages.",
    "The system shall persist the selected interface language for the duration of the current session so that all subsequent interface interactions use the selected language.",
    "The system should automatically propose an initial interface language based on available user or browser language information when no explicit language has yet been selected by the data reuser.",
    "The system shall ensure that, when the data reuser’s native language is not supported, the interface is presented in a defined fallback language while allowing the data reuser to view the list of supported languages."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The set of supported interface languages and the policy for adding or deprecating languages must be defined.",
    "The precedence rules between explicit user selection, stored user preferences, and automatic browser locale detection must be specified.",
    "The expected persistence of language preferences across sessions and devices (for example, via cookies or user profiles) must be clarified.",
    "Accessibility and usability requirements for language selection controls (such as location, visibility, and keyboard accessibility) must be determined.",
    "Error handling and messaging behaviour when localisation resources are incomplete or unavailable for a selected language must be defined."
  ],
  "main_flow": [
    "1. data reuser accesses the archive web interface using a browser → System establishes a new or existing session and presents the initial interface using either the default language or an automatically determined language based on available locale information.",
    "2. data reuser reviews the visible language setting and decides to confirm or change the interface language → System displays the current interface language and provides access to a list or control for selecting among supported interface languages.",
    "3. data reuser selects a preferred interface language from the list of supported interface languages → System validates that the selected language is supported and records the selected language as the preferred interface language for the current session.",
    "4. data reuser submits or confirms the selected interface language → System reloads or updates the interface so that navigation elements, labels, and instructional text are presented in the selected language.",
    "5. data reuser continues to navigate archive pages and perform search and viewing actions → System consistently presents all subsequent interface pages and controls in the selected language for the remainder of the session.",
    "6. data reuser finishes the interaction with the archive and closes the session or browser window → System ends the session and retains or discards the selected language according to configured preference persistence rules."
  ],
  "alternative_flows": [
    "AF-1 (from Step 1): The system detects that the data reuser’s browser locale or an existing stored preference matches a supported interface language. The system immediately presents the interface in that language and indicates the selected language in the interface. The flow then continues at Step 2 of the main flow.",
    "AF-2 (from Step 3): The data reuser decides to keep the currently displayed interface language without making a new selection. The data reuser does not change the language selection control and proceeds to use the archive. The system continues to present the interface in the previously determined language. The flow then continues at Step 5 of the main flow."
  ],
  "exception_flows": [
    "EF-1 (from Step 3): The data reuser attempts to select an interface language that is not currently supported due to configuration changes or incomplete localisation resources. The system rejects the selection, displays an error message in the currently active language explaining that the chosen language is unavailable, and presents the list of still-supported languages. The data reuser may then select a different supported language (return to Step 3 of the main flow) or continue with the currently active language (continue at Step 5 of the main flow).",
    "EF-2 (from Step 4): A technical error occurs while loading localisation resources for the selected language. The system logs the error, falls back to a defined fallback language, and displays a notification in the fallback language indicating that the preferred language could not be fully loaded. The data reuser may either continue using the interface in the fallback language (continue at Step 5 of the main flow) or attempt to select another language (return to Step 3 of the main flow)."
  ],
  "information_for_steps": [
    "1. Browser locale information, session identifier, default interface language configuration.",
    "2. Current interface language indicator, list of supported interface languages, language selection control metadata.",
    "3. Selected language code, validation rules for supported interface languages.",
    "4. Localisation resource bundles for the selected language, interface text strings, session language preference value.",
    "5. Localised navigation labels, localised form labels, localised messages and help text associated with archive functions.",
    "6. Session termination timestamp, rules for persisting or discarding language preferences, stored preference record if persistence is enabled."
  ]
}