{
  "use_case_name": "Manage Personal Information",
  "unique_id": "UC-008",
  "area": "Patient Information Management",
  "context_of_use": "The use case enables a patient to manage and update their own personal information via an online interface so that their stored information remains current for subsequent healthcare processes.",
  "scope": "Hospital Management System",
  "level": "User-goal",
  "primary_actors": [
    "patient"
  ],
  "supporting_actors": [
    "Hospital Management System User Authentication Component",
    "Central Patient Database"
  ],
  "stakeholders_and_interests": [
    "Patient: Wants personal information to be accurate and up to date for correct identification and communication.",
    "Healthcare Providers: Require accurate patient personal information to correctly identify and treat patients.",
    "Receptionist: Requires current patient personal information for contact and appointment-related communication.",
    "System Administrator: Requires consistent and accurate data storage to reduce discrepancies between departments.",
    "Hospital Management: Requires reliable patient information to support efficient administrative and clinical processes."
  ],
  "description": "This use case describes how a patient accesses the hospital management system online to view, edit, and submit updates to their personal information so that the information stored in the central system remains up to date.",
  "triggering_event": "The patient decides to update their personal information using the online hospital management system.",
  "trigger_type": "External",
  "preconditions": [
    "The patient has an active patient account in the Hospital Management System.",
    "The patient has valid access credentials for their personal account.",
    "The Hospital Management System and central patient database are operational and reachable.",
    "The patient has network access to the online interface of the Hospital Management System."
  ],
  "postconditions": [
    "The patient’s updated personal information is stored in the central patient database.",
    "Subsequent views of the patient’s personal information by authorized users reflect the latest submitted data.",
    "An audit trail entry of the personal information update, including time and initiating patient account, is recorded in the system."
  ],
  "assumptions": [
    "It is assumed that personal information includes data such as name, address, phone number, email address, and other contact and demographic details that do not constitute clinical data.",
    "It is assumed that patients are only permitted to edit their own personal information and not that of other patients.",
    "It is assumed that data entered by the patient is validated for format and mandatory fields before being stored.",
    "It is assumed that the patient must be authenticated in the system before accessing the personal information management functionality.",
    "It is assumed that any access control and GDPR-related constraints configured by the system administrator apply to the storage and handling of patient personal information, but they do not alter the basic ability of a patient to update their own personal information.",
    "It is assumed that the same personal information management functionality is accessible from both personal computers and mobile devices, but this use case focuses on the logical behavior rather than specific device interfaces.",
    "It is assumed that the central patient database is the authoritative source for patient personal information and that all departments read from this database to reduce discrepancies."
  ],
  "requirements_met": [
    "The system shall allow an authenticated patient to access their personal information via an online interface.",
    "The system shall display the current personal information of the authenticated patient for review.",
    "The system shall allow the authenticated patient to modify permitted personal information fields.",
    "The system shall validate patient-entered personal information according to configured data validation rules before saving.",
    "The system shall store updated patient personal information in the central patient database upon successful submission.",
    "The system shall ensure that subsequent retrieval of the patient’s personal information returns the updated values.",
    "The system shall record an audit log entry each time a patient updates their personal information, including timestamp and patient identifier.",
    "The system shall restrict patients to updating only their own personal information based on their authenticated identity.",
    "The system shall enforce configured access control rules so that patients cannot view or modify data that is not intended for them.",
    "The system shall be accessible only to authorized users who have logged in to their personal accounts before managing personal information."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The specific set of personal information fields that patients are allowed to edit has not been defined and requires policy decisions.",
    "The required strength and format of data validation rules for each personal information field (e.g., address format, phone number format) are not specified.",
    "The retention and detail level of audit trail records for personal information changes need to be defined by compliance and security policies.",
    "The timing and frequency of data synchronization between the central patient database and any external or legacy systems after personal information updates are not specified.",
    "The exact timeout and session management rules while a patient is editing personal information have not been determined."
  ],
  "main_flow": [
    "1. Patient initiates access to the online Hospital Management System to manage personal information → System presents the login interface for patient authentication.",
    "2. Patient enters their login credentials and submits the authentication request → System verifies the credentials and establishes an authenticated patient session.",
    "3. Patient selects the personal information management option from the available patient functions → System retrieves the patient’s current personal information from the central patient database and displays it in an editable form.",
    "4. Patient reviews the displayed personal information and edits one or more permitted fields as needed → System updates the in-session representation of the patient’s personal information and shows the modified values on the screen.",
    "5. Patient confirms the changes by submitting the updated personal information → System validates the submitted personal information according to configured data validation rules.",
    "6. Patient waits while the system processes the submission → System saves the validated updated personal information in the central patient database and records an audit trail entry for the change.",
    "7. Patient views confirmation of the successful update → System displays a confirmation message and the newly stored personal information reflecting the applied changes, then maintains the authenticated session for further allowed actions."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): If the patient is already authenticated when initiating the use case (for example, from another patient-specific function), the system bypasses the login interface and directly presents the patient with the available functions. The flow then continues at Step 3.",
    "AF-2 (from Step 4): If the patient decides not to change any data after reviewing the currently displayed personal information, the patient submits the form without modifications and the system verifies that the submitted data matches the stored data, confirms that no changes have been applied, and displays a message indicating that personal information remains unchanged. The use case then ends successfully.",
    "AF-3 (from Step 7): After viewing the confirmation and updated personal information, the patient chooses to continue using other patient self-service functions within the same authenticated session. The system navigates to the selected function’s interface while retaining the updated personal information in the central database."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): If the entered login credentials are invalid, the system rejects the authentication attempt, displays an error message indicating that the credentials are incorrect, logs the failed login attempt, and prompts the patient to retry or cancel. If the patient cancels, the use case ends without any change to personal information.",
    "EF-2 (from Step 5): If the submitted personal information fails validation (e.g., mandatory fields are missing or formats are invalid), the system does not save any of the submitted data, highlights the invalid fields, displays descriptive validation error messages, and allows the patient to correct the information and resubmit starting again from Step 4.",
    "EF-3 (from Step 6): If a technical failure occurs while saving the updated personal information to the central patient database (e.g., database unavailable), the system logs the error, does not commit any partial update, informs the patient that the update could not be completed due to a system error, and instructs the patient to try again later. The use case ends without changing the stored personal information.",
    "EF-4 (from Step 1): If the Hospital Management System is unavailable when the patient attempts to initiate the use case, the system does not present the login interface and instead displays a service-unavailable message, preventing any further actions. The use case ends without any change to personal information.",
    "EF-5 (from Step 3): If the system cannot retrieve the patient’s current personal information from the central patient database due to a data access error, the system logs the error, displays an error message to the patient indicating that personal information cannot be displayed at this time, and prevents editing. The use case ends without any change to personal information."
  ],
  "information_for_steps": [
    "1. Patient account identifier, system URL, session initiation data.",
    "2. Login credentials (username, password, and possibly second-factor token), authentication status, session token.",
    "3. Patient identifier, current personal information record from central patient database (e.g., name, address, phone number, email), access control profile.",
    "4. Updated personal information values entered by the patient, client-side input representation, editable form fields.",
    "5. Submitted personal information payload, validation rules for each field, validation error indicators.",
    "6. Persisted personal information record, database transaction details, audit log entry (patient identifier, timestamp, change summary).",
    "7. Confirmation message content, updated personal information record as stored in the central patient database, session context for subsequent actions."
  ]
}