{
  "use_case_name": "Manage Research Datasets",
  "unique_id": "UC-004",
  "area": "Research Data Management",
  "context_of_use": "The use case describes how a depositor or research facility manager interacts with the Bath Data Archive via a simple, familiar web interface and connected tools to deposit, maintain, and version research datasets and associated files throughout their lifecycle.",
  "scope": "Bath Data Archive System",
  "level": "User-goal",
  "primary_actors": [
    "depositor",
    "research facility manager"
  ],
  "supporting_actors": [
    "researcher"
  ],
  "stakeholders_and_interests": [
    "depositor: Wants to deposit, maintain, and manage live and versioned research datasets and files efficiently through familiar interfaces without installing additional software.",
    "research facility manager: Wants to deposit data from research facilities directly into the archive on behalf of researchers so that a separate facility archive is not required and researchers can access their own data as needed.",
    "researcher: Wants facility-generated data deposited on their behalf to remain accessible to them as needed for research activities.",
    "Bath Data Archive owner: Wants research data to be deposited and maintained in a controlled, traceable way to support long-term preservation and reuse.",
    "University of Bath: Wants research data holdings to be centrally managed to support compliance, impact demonstration, and institutional reporting."
  ],
  "description": "This use case specifies how a depositor or research facility manager deposits datasets and associated files into the Bath Data Archive, maintains and updates them over time, and manages multiple versions so that datasets remain accessible and their evolution is transparent throughout the research lifecycle.",
  "triggering_event": "The depositor or research facility manager decides to deposit a new research dataset or update an existing dataset in the Bath Data Archive.",
  "trigger_type": "External",
  "preconditions": [
    "The depositor or research facility manager has a valid user account with permission to deposit datasets into the Bath Data Archive System.",
    "The depositor or research facility manager has access to a simple web interface, Pure, a Virtual Research Environment, or another connected workflow tool that can interact with the Bath Data Archive System for dataset deposit and maintenance.",
    "The dataset files to be deposited, or the live research data to be managed, are available to the depositor or research facility manager in at least one acceptable form for upload or registration.",
    "The Bath Data Archive System is online and able to accept deposit and update requests."
  ],
  "postconditions": [
    "The research dataset and its associated files have been deposited or updated in the Bath Data Archive System with a persistent record.",
    "The current version of the dataset is clearly identified and linked to any previous versions so that the version history is transparent.",
    "The depositor or research facility manager can subsequently access and manage the deposited dataset and its versions through the same or equivalent interfaces used for deposit.",
    "Researchers for whom the research facility manager deposited data can access their corresponding deposited datasets according to their access rights."
  ],
  "assumptions": [
    "It is assumed that the Bath Data Archive System exposes a simple web interface and can be integrated with Pure, Virtual Research Environments, and other workflow tools, but the detailed integration mechanisms are outside the scope of this use case.",
    "It is assumed that a depositor and a research facility manager authenticate through existing institutional mechanisms before interacting with the Bath Data Archive System, even though authentication steps are not described in this use case.",
    "It is assumed that a research facility manager is authorized to act on behalf of specific researchers for facility-generated data deposit, and that any mapping between facility data and the corresponding researchers exists prior to starting this use case.",
    "It is assumed that live research data to be managed is exposed to the Bath Data Archive System in a way that allows it to be deposited, referenced, or updated through the described interfaces.",
    "It is assumed that acceptable dataset file formats and size limits, including support for large files, are governed by existing technical and policy constraints not detailed in this use case.",
    "It is assumed that the management of detailed embargoes, licensing, disposal policies, citation tracking, and access control are handled by separate use cases, and here the focus is limited to deposit, maintenance, and version management.",
    "It is assumed that error handling for connectivity problems, storage failures, or integration failures with external tools is covered by system-level non-functional requirements and is only summarized in the exception flows of this use case."
  ],
  "requirements_met": [
    "The system shall allow a depositor to deposit and maintain datasets through a simple web interface so that additional software installation is not required.",
    "The system shall allow a depositor to deposit and maintain datasets through Pure so that the depositor can manage research outputs in a single location.",
    "The system shall allow a depositor to deposit and maintain datasets through Virtual Research Environments and other workflow tools so that the depositor can continue to work within familiar tools.",
    "The system shall allow a depositor to deposit the files that they currently have for a dataset without requiring them to convert files to a different format as part of the deposit process.",
    "The system shall allow a depositor to deposit arbitrarily large files within the technical limits of the Bath Data Archive System so that the depositor is not constrained by file size when depositing datasets.",
    "The system shall allow a depositor to manage and share live research data as part of the dataset lifecycle so that project workflow remains linked together.",
    "The system shall allow a depositor to manage multiple versions of the same dataset so that changes to the dataset are transparent and research integrity is not compromised.",
    "The system shall allow a research facility manager to deposit data from a research facility directly into the archive on behalf of researchers so that the facility manager is not required to maintain a separate facility archive and researchers can access their own facility data as needed.",
    "The system shall maintain a persistent record for each deposited dataset and its versions so that datasets can be identified and referenced over time.",
    "The system shall allow an authorized depositor or research facility manager to update existing datasets by adding new versions while preserving previously deposited versions for traceability."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The policy and technical limits for what constitutes 'arbitrarily large' files have not been defined and must be clarified to set realistic maximum file sizes for deposit.",
    "The specific integration mechanisms and responsibilities between the Bath Data Archive System and Pure, Virtual Research Environments, and other workflow tools are not described and require architectural decisions.",
    "The detailed rules governing when and how a research facility manager is authorized to deposit data on behalf of particular researchers have not been specified and require institutional policy definition.",
    "The exact representation and handling of live research data within the archive, including synchronization versus snapshot behavior, remain unspecified and must be clarified.",
    "The process for mapping facility-deposited data to the correct researcher accounts and access rights is not defined and needs design and governance decisions."
  ],
  "main_flow": [
    "1. Depositor or research facility manager initiates dataset management from a simple web interface, Pure, a Virtual Research Environment, or another connected workflow tool → System displays the dataset management home screen with options to create a new dataset record or select an existing dataset to update.",
    "2. Depositor or research facility manager chooses to create a new dataset record → System presents a dataset creation form including fields for basic dataset information and options to add files or references to live research data.",
    "3. Depositor or research facility manager enters the required basic dataset information for the new dataset record → System validates the entered dataset information for completeness and acceptable values and indicates any fields that require correction.",
    "4. Depositor or research facility manager selects one or more dataset files or live data sources to include in the dataset → System accepts the file or live data selections and prepares them for upload, registration, or association with the dataset record.",
    "5. Depositor or research facility manager confirms the deposit of the dataset with the selected files or live data sources → System uploads or registers the selected files or live data sources, creates the initial version of the dataset record, and stores the association between the dataset metadata and the deposited content.",
    "6. Depositor or research facility manager reviews the summary of the newly created dataset version → System displays a confirmation page showing the dataset identifier, current version number, associated files or live data references, and access information for authorized users such as the owning researcher.",
    "7. At a later time, depositor or research facility manager chooses to manage or update an existing dataset record from the dataset management home screen → System retrieves and displays the existing dataset record along with its version history and currently associated files or live data references.",
    "8. Depositor or research facility manager selects the option to create a new version of the existing dataset and specifies any changes such as adding, replacing, or removing files or updating associations to live data sources → System records the proposed changes and prepares a new dataset version while preserving the previous versions unchanged.",
    "9. Depositor or research facility manager confirms the creation of the new dataset version with the specified changes → System applies the changes, finalizes the new dataset version, updates the version history to indicate the new current version, and maintains links to prior versions for transparency.",
    "10. Depositor or research facility manager views the updated dataset record and version history → System presents the complete dataset view showing the current version, all prior versions, associated files or live data references, and confirmation that the dataset is available to authorized users such as the corresponding researchers."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): Depositor or research facility manager chooses to update an existing dataset instead of creating a new dataset record. Condition: The actor intends to modify an existing dataset rather than deposit a completely new one. Flow: At the dataset management home screen, the actor searches for or selects an existing dataset. The system retrieves and displays the selected dataset record with its details and version history. The flow then continues from Step 8 where the actor creates a new version for the existing dataset.",
    "AF-2 (from Step 4): Research facility manager deposits data on behalf of a researcher. Condition: The actor is a research facility manager depositing facility-generated data that belongs to one or more researchers. Flow: The research facility manager selects one or more researchers on whose behalf the facility data is being deposited when selecting the dataset files or live data sources. The system associates the dataset and its content with the identified researchers for subsequent access. The flow then continues from Step 5 where the facility data is deposited as part of the dataset.",
    "AF-3 (from Step 7): Depositor manages and shares live research data without adding new files. Condition: The actor wants to manage or share live research data already connected to the dataset rather than upload additional files. Flow: From the existing dataset record, the actor chooses options to adjust which live data sources are linked to the dataset and confirms the changes without modifying uploaded file content. The system records a new dataset version that updates only the live data associations and preserves previous versions. The flow then continues from Step 9 where the new version is finalized."
  ],
  "exception_flows": [
    "EF-1 (from Step 3): Dataset information validation fails. Condition: Required basic dataset information is missing or contains invalid values. Flow: The system identifies invalid or missing fields and displays error messages indicating what must be corrected. The actor reviews and corrects the dataset information and resubmits it. If corrections are successfully made, the flow returns to Step 3 validation; if the actor cancels, the use case terminates without creating or updating a dataset.",
    "EF-2 (from Step 4): File upload or live data registration fails. Condition: One or more selected files or live data sources cannot be uploaded or registered due to technical issues such as connectivity problems, storage limitations, or incompatible input. Flow: The system reports which files or live data sources failed to be accepted and provides the reason where available. The actor may retry the selection or remove problematic items and proceed with the remaining content. If the actor proceeds with corrected selections, the flow resumes at Step 4; if the actor cancels, the use case terminates without depositing or updating the dataset.",
    "EF-3 (from Step 5): Dataset creation or initial version storage fails. Condition: After confirmation, the system cannot complete the creation of the dataset record and its initial version, for example due to a system error or storage failure. Flow: The system displays an error message indicating that the dataset could not be created and rolls back any partial changes so that no inconsistent dataset record remains. The actor may choose to attempt the deposit process again later, in which case a new instance of the use case is started, or may exit, in which case this instance of the use case ends without success.",
    "EF-4 (from Step 9): New dataset version cannot be finalized. Condition: The system encounters an error while applying changes to create a new dataset version. Flow: The system reports that the new dataset version could not be finalized and keeps the previous current version unchanged and available. The actor may choose to retry the update, beginning again from Step 7, or abandon the attempted changes, ending this instance of the use case without creating a new version."
  ],
  "information_for_steps": [
    "1. Actor identity, interface type (simple web interface, Pure, Virtual Research Environment, or other workflow tool), list of existing datasets visible to the actor.",
    "2. Dataset creation request, dataset creation option selection, initial dataset state as new record.",
    "3. Basic dataset information fields such as dataset title, description, responsible depositor or facility manager, and any mandatory classification or project identifiers required for creation.",
    "4. Dataset content selections including uploaded files, references to live research data sources, and for research facility managers, the mapping between facility data and associated researchers.",
    "5. Confirmed deposit instruction, uploaded dataset files or registered live data references, generated dataset identifier, initial dataset version number, storage location references.",
    "6. Dataset confirmation details including dataset identifier, current version metadata, list of associated files and live data references, and access summary for authorized users such as researchers.",
    "7. Existing dataset identifier, dataset metadata, complete version history, list of files and live data references associated with each version.",
    "8. Proposed changes for the new dataset version including added files, replaced files, removed files, and updated live data associations, together with a draft new version number.",
    "9. Finalized new version metadata, applied changes to files and live data references, updated version history markers indicating the current version and links to prior versions.",
    "10. Updated dataset record view containing current version details, chronological list of all versions with their identifiers, and confirmation of dataset accessibility for the depositor, research facility manager, and associated researchers."
  ]
}