{
  "use_case_name": "Report Match Events",
  "unique_id": "UC-012",
  "area": "Match Event Reporting",
  "context_of_use": "The use case allows a referee to use the system during assigned matches to digitally report match events from a small mobile device using a predefined list of possible match events, so that match information is transmitted quickly and automatic match data reports are generated continuously.",
  "scope": "IFA Web and Mobile Match Management System",
  "level": "User-goal",
  "primary_actors": [
    "referee"
  ],
  "supporting_actors": [
    "Match Data Processing Service"
  ],
  "stakeholders_and_interests": [
    "Referee: Wants to access assigned games and quickly report match events using a small mobile device so that information is instantly provided to the system and data transmission is faster.",
    "Fans: Want match information and statistics to be updated continuously and efficiently based on referees’ live updates.",
    "IFA administrator: Wants to generate statistics from referees’ live updates so that fans are informed efficiently and the system can provide updates from each game.",
    "Teams: Want accurate and timely recording of match events for fair competition and later analysis.",
    "Leagues: Want complete and reliable event histories for all games in the league for oversight and transparency.",
    "CIO: Wants the match event reporting process to be integrated into the unified system to improve communication and transparency among stakeholders."
  ],
  "description": "This use case describes how a referee accesses the list of possible match events for assigned games, reports match events digitally via a small mobile device during a match, and receives automatic match data reports when events occur so that match information is updated continuously in the system.",
  "triggering_event": "The referee initiates match event reporting for an assigned game using the mobile device at or before match start.",
  "trigger_type": "External",
  "preconditions": [
    "The referee has valid system access credentials and is authenticated in the system.",
    "The referee is assigned to at least one game in the system.",
    "The scheduled match exists in the system with a defined start time.",
    "The referee’s small mobile device is operational and connected to the system.",
    "The list of possible match events is configured and available in the system."
  ],
  "postconditions": [
    "All reported match events for the selected game are stored digitally in the system.",
    "The system has generated and updated automatic match data reports based on the reported events for the selected game.",
    "The referee can view the latest automatic match data report for the selected game.",
    "The match event history for the selected game is available in the system for subsequent statistics and analytics."
  ],
  "assumptions": [
    "It is assumed that user authentication and authorization mechanisms for referees already exist in the system and are handled outside this use case, even though they are not described in the Requirement Text.",
    "It is assumed that an assigned game list for a referee is already maintained by the system based on separate scheduling and assignment processes, because the Requirement Text states that referees access the games they are assigned to through the system.",
    "It is assumed that the \"small mobile device\" mentioned in the Requirement Text is a supported mobile client of the IFA Web and Mobile Match Management System and can communicate with the central system in real time.",
    "It is assumed that the list of possible match events is predefined and maintained by IFA administrators or equivalent stakeholders outside this use case, since the Requirement Text only states that referees have an application containing this list.",
    "It is assumed that automatic match data reports are generated by a backend service of the system whenever new events are stored, because the Requirement Text states that referees receive automatic match data reports when events occur.",
    "It is assumed that the referee reports events only for matches to which the referee is currently assigned, in line with the Requirement Text about accessing assigned games.",
    "It is assumed that network connectivity is generally available to allow near real-time data transmission from the referee’s device to the system, given the need for continuous updates.",
    "It is assumed that the system time and match time are synchronized sufficiently to order events correctly, although such synchronization is not explicitly mentioned in the Requirement Text."
  ],
  "requirements_met": [
    "The system shall provide referees with an application interface containing a list of possible match events so that referees can instantly provide information to the system.",
    "The system shall allow referees to use a small mobile device to report match events so that the system can provide updates from each game.",
    "The system shall allow referees to provide match information digitally so that data transmission is faster.",
    "The system shall automatically generate and deliver match data reports to the referee when reported events are stored so that information is updated continuously.",
    "The system shall allow referees to access the games they are assigned to through the system so that they can easily follow information about their matches.",
    "The system shall update stored match information immediately after each reported event so that downstream statistics and fan information can be based on current data."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The specific structure and content of automatic match data reports (e.g., level of detail, aggregation, formatting) are not defined and require clarification.",
    "The acceptable maximum latency between an event being reported and its appearance in automatic match data reports is not specified and needs a non-functional requirement.",
    "Error-handling behavior when the referee’s mobile device loses connectivity or power during a match is not specified and must be defined.",
    "Rules governing corrections or deletions of mistakenly reported events by referees are not described and must be established.",
    "Security and privacy policies for storing and accessing match event data by different stakeholders are not fully defined.",
    "The exact mapping between predefined possible match events and competition rules (e.g., league-specific event types) is not specified."
  ],
  "main_flow": [
    "1. Referee selects the match event reporting function on the small mobile device → System authenticates the referee session and confirms access to match event reporting features.",
    "2. Referee requests to view the list of games to which they are assigned → System retrieves and displays the list of games currently assigned to the referee.",
    "3. Referee selects an assigned game from the displayed list → System opens the selected game context and displays basic match information for that game.",
    "4. Referee requests to view possible match events for the selected game → System retrieves and displays the predefined list of possible match events for the selected game.",
    "5. Referee chooses a match event type from the list and, if applicable, enters required event details (such as time in match or involved participants) → System validates the selected event type and provided details.",
    "6. Referee submits the match event for the selected game → System records the submitted match event digitally for the selected game and confirms successful storage to the referee.",
    "7. Referee continues reporting additional match events by repeating selection and submission actions as the match progresses → System records each additional reported event digitally and maintains an ordered event history for the selected game.",
    "8. Referee requests the current automatic match data report for the selected game → System generates or updates the automatic match data report based on all recorded events for the selected game and makes it available to the referee.",
    "9. Referee views the automatic match data report on the small mobile device → System displays the latest automatic match data report for the selected game, reflecting all recorded events.",
    "10. Referee ends the match event reporting session for the selected game → System closes the active reporting session while retaining all stored events and the latest automatic match data report for the selected game."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): If the referee is assigned to multiple concurrent or upcoming games for the same time period, the referee filters or sorts the list of assigned games by date, time, or competition before selecting a game → System applies the filter or sort criteria, updates the displayed list accordingly, and the flow resumes at Step 3.",
    "AF-2 (from Step 4): If certain event types are context-dependent (for example, available only during active match time), the referee requests to refresh the list of possible match events when match context changes (such as half-time or extra time) → System refreshes the list of possible match events according to the new match context and the flow continues at Step 5.",
    "AF-3 (from Step 7): If the referee needs to pause event reporting temporarily during the match (for example, due to a break in play), the referee minimizes or temporarily suspends the reporting screen → System maintains the current game context and recorded events without ending the session, and when the referee resumes, the flow continues at Step 5.",
    "AF-4 (from Step 8): Instead of actively requesting a report, the referee enables automatic refresh of the match data report during the session → System periodically updates and refreshes the displayed automatic match data report when new events are recorded, and the flow continues at Step 9 whenever the referee views the report."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): If the referee cannot be authenticated (for example, due to invalid credentials or expired session), the system denies access to match event reporting features, displays an authentication error message to the referee, and terminates the use case without recording any events.",
    "EF-2 (from Step 2): If the system cannot retrieve the list of assigned games due to a system error, it informs the referee that assigned games cannot be loaded at this time, logs the error for administrative review, and the use case ends without allowing event reporting.",
    "EF-3 (from Step 3): If the selected game is no longer valid for reporting (for example, cancelled or already finalized in the system), the system notifies the referee that the game cannot accept new events, prevents further event reporting for that game, and prompts the referee to select another game or end the session.",
    "EF-4 (from Step 5): If the referee provides incomplete or invalid event details, the system rejects the event submission, highlights the fields with validation errors, and prompts the referee to correct the data before allowing progression to Step 6.",
    "EF-5 (from Step 6): If the system fails to store the submitted match event due to a technical error, the system informs the referee that the event was not saved, logs the failure, and allows the referee to attempt to resubmit the event or end the session; if the referee ends the session, the use case terminates with the failed event not recorded.",
    "EF-6 (from Steps 6 or 7): If network connectivity between the referee’s mobile device and the system is lost while reporting events, the system notifies the referee of the connectivity issue and queues locally captured events if possible; events are transmitted when connectivity is restored, or if connectivity is not restored before the referee ends the session, the system instructs the referee that queued events could not be synchronized and the use case ends with some events potentially missing from the central system.",
    "EF-7 (from Step 8): If the system cannot generate or update the automatic match data report due to a processing error, the system informs the referee that the report is currently unavailable, logs the error, and maintains previously stored events; the use case may continue with additional event reporting but completes without providing an updated report."
  ],
  "information_for_steps": [
    "1. Referee identifier, authentication token, device identifier.",
    "2. Referee identifier, list of assigned games (game identifiers, dates, times, league identifiers).",
    "3. Selected game identifier, game metadata (teams, venue, start time, status).",
    "4. Selected game identifier, list of possible match events (event identifiers, descriptions, categories).",
    "5. Selected event identifier, event timestamp, match minute or time, optional attributes such as involved team or player identifiers.",
    "6. Event record (game identifier, referee identifier, event identifier, event timestamp, event details), storage confirmation status.",
    "7. Sequence of event records associated with the selected game, ordered event history.",
    "8. Game identifier, collected event records, parameters for generating automatic match data report.",
    "9. Automatic match data report content for the selected game (summaries, ordered events, key metrics).",
    "10. Session identifier, game identifier, final event history snapshot, latest automatic match data report reference."
  ]
}