{
  "use_case_name": "Deposit Datasets via API",
  "unique_id": "UC-021",
  "area": "Research Data Archiving",
  "context_of_use": "A developer uses a programmatic interface to deposit and maintain research datasets in the Bath Data Archive so that external services can interact with the archive without using the web user interface.",
  "scope": "Bath Data Archive System",
  "level": "User-goal",
  "primary_actors": [
    "developer"
  ],
  "supporting_actors": [
    "External Service Consuming the API"
  ],
  "stakeholders_and_interests": [
    "Developer: Wants to deposit and maintain datasets via an API so that their service can interact with the archive programmatically.",
    "Bath Data Archive administrator: Wants programmatic deposits to be consistent with archive policies and quality expectations.",
    "Research Information manager: Wants dataset records created via the API to support analysis of research outputs and impact.",
    "UnivITservice: Wants the API-based interactions to operate reliably on existing infrastructure.",
    "Fundingbody: Wants datasets deposited through APIs to contribute to robust archival plans for funded research data."
  ],
  "description": "This use case describes how a developer deposits and maintains datasets in the Bath Data Archive via an API such as SWORD2, enabling external services to interact with the archive without using the web interface.",
  "triggering_event": "A developer initiates a programmatic request through the API to deposit or update a dataset in the Bath Data Archive.",
  "trigger_type": "External",
  "preconditions": [
    "The Bath Data Archive system is operational and reachable through the API endpoint.",
    "The developer has valid network connectivity to the Bath Data Archive API.",
    "The developer possesses valid credentials and authorization to access the dataset deposit API.",
    "The external service controlled by the developer has prepared dataset files and associated metadata in a format acceptable to the Bath Data Archive API."
  ],
  "postconditions": [
    "The dataset and its submitted metadata are stored in the Bath Data Archive in accordance with the API request.",
    "A stable identifier or location for the deposited or updated dataset is available to the calling external service.",
    "The external service can subsequently interact with the deposited dataset through the Bath Data Archive using the established API mechanisms."
  ],
  "assumptions": [
    "It is assumed that the Bath Data Archive exposes a standards-based deposit API such as SWORD2 that supports creation and maintenance of dataset records.",
    "It is assumed that authentication and authorization for the API are handled by existing university identity and access management mechanisms, even though they are not explicitly described in the requirement text.",
    "It is assumed that the term \"maintain datasets\" via the API refers to updating metadata and files of already deposited datasets, without introducing additional lifecycle capabilities beyond those implied by dataset management in the archive.",
    "It is assumed that the external service that interacts with the archive on behalf of the developer is logically distinct from the Bath Data Archive system and relies solely on published API operations.",
    "It is assumed that error handling for invalid requests, failed authentication, or system unavailability is required, even though the requirement text only states the high-level goal.",
    "It is assumed that this use case extends a broader dataset management capability described as \"manage research datasets\", and therefore depends on the underlying dataset management rules of the archive."
  ],
  "requirements_met": [
    "The system shall provide an API such as SWORD2 that allows a developer to deposit new datasets into the Bath Data Archive.",
    "The system shall allow a developer, via the API, to update existing deposited datasets to support ongoing maintenance.",
    "The system shall allow external services controlled by developers to interact with deposited datasets through the archive using the same API mechanisms.",
    "The system shall return a confirmation response and a stable identifier or endpoint for each successfully deposited or updated dataset invoked via the API."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The specific authentication and authorization mechanisms for the deposit API have not been defined and require agreement with university identity management policies.",
    "The maximum allowable size and number of files per dataset deposited via the API have not been specified and require technical and policy decisions.",
    "Validation rules and minimum metadata requirements for API-based deposits, and how they align with administrator quality checks, remain to be defined.",
    "The acceptable API protocol versions and backward compatibility expectations for external services consuming the deposit API have not been established."
  ],
  "main_flow": [
    "1. Developer initiates a dataset deposit or update call via the API from an external service → System receives the API request and validates its structure.",
    "2. Developer supplies authentication information as part of the API call → System authenticates the developer and verifies authorization to perform dataset deposit or maintenance.",
    "3. Developer submits dataset metadata and file payloads in the API request → System parses the submitted metadata and files and prepares them for processing.",
    "4. Developer indicates through the API whether the operation is a new dataset deposit or an update to an existing dataset → System determines whether to create a new dataset record or modify an existing one based on the request parameters.",
    "5. Developer confirms the dataset content and associated request parameters in the API call → System stores the dataset files and metadata in the Bath Data Archive in accordance with the requested operation.",
    "6. Developer awaits confirmation from the API → System generates a success response containing a stable identifier or location reference for the deposited or updated dataset and returns it to the external service.",
    "7. Developer’s external service records the returned dataset identifier for future interactions → System maintains the dataset in a state that allows subsequent access and further maintenance via the API as supported by the archive."
  ],
  "alternative_flows": [
    "AF-1 (from Step 4): If the developer specifies in the API request that an existing dataset should be updated rather than a new one created, the system locates the referenced existing dataset record, applies the submitted changes to its metadata and files, and then continues at Step 6 to return a success response with the existing dataset’s stable identifier.",
    "AF-2 (from Step 7): If the developer does not require ongoing maintenance of the dataset via the API after the initial deposit, the external service may simply store the returned identifier for reference, and the use case ends after Step 6 with the dataset remaining available in the archive without further API interactions."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): If authentication fails or the developer is not authorized to use the dataset deposit API, the system rejects the request, returns an error response describing the authorization failure, and does not create or modify any dataset records; the use case then terminates.",
    "EF-2 (from Step 3): If the submitted metadata or file payloads are incomplete, malformed, or violate defined validation rules, the system rejects the request, returns an error response indicating the validation issues, and leaves existing dataset records unchanged; the developer may correct the request and re-initiate the use case.",
    "EF-3 (from Step 5): If the system encounters a storage or internal processing error while attempting to store dataset files or metadata, the system aborts the operation, rolls back any partial changes where feasible, and returns an error response to the external service; the use case ends without a new or updated dataset being available."
  ],
  "information_for_steps": [
    "1. API endpoint URL, HTTP method, request payload structure.",
    "2. Authentication token or credentials, authorization scopes or roles.",
    "3. Dataset metadata fields, dataset file payloads, content types, checksums if provided.",
    "4. Operation type indicator (create vs update), existing dataset identifier when updating.",
    "5. Finalized dataset metadata set, selected files for storage, internal dataset record reference.",
    "6. Success status code, stable dataset identifier or persistent URL, confirmation message.",
    "7. Stored dataset identifier in the external service, reference for subsequent API calls."
  ]
}