{
  "use_case_name": "Examine Deposited Files",
  "unique_id": "UC-012",
  "area": "Research Data Reuse",
  "context_of_use": "A data reuser has already located a relevant dataset within the archive and uses the web-based archive interface to examine and identify deposited files and available dataset versions in order to assess their usefulness before deciding whether to download them.",
  "scope": "Bath Research Data Archive System",
  "level": "User-goal",
  "primary_actors": [
    "data reuser"
  ],
  "supporting_actors": [
    "Bath Research Data Archive web interface"
  ],
  "stakeholders_and_interests": [
    "data reuser: Wants to examine and identify deposited files and dataset versions quickly in order to assess usefulness without downloading the entire dataset.",
    "depositors: Want their datasets and versions presented clearly so that reusers can correctly interpret and cite the data.",
    "Bath Data Archive administrator: Wants consistent and accurate file and version information displayed so that archive holdings are understood and used appropriately.",
    "Research Information manager: Wants clear visibility of dataset versions being reused to support impact analysis and reporting.",
    "UnivITservice: Wants the system to present file and version information efficiently without excessive load on storage or infrastructure."
  ],
  "description": "This use case enables a data reuser to inspect the list of files and the available versions of a deposited dataset through the archive’s web interface, view key identifying information about those files and versions, and make a preliminary judgment about which file(s) and which dataset version is most relevant, without downloading the entire dataset.",
  "triggering_event": "The data reuser selects a specific dataset record from the archive’s search or browsing results in order to examine its deposited files and versions.",
  "trigger_type": "External",
  "preconditions": [
    "The Bath Research Data Archive System is operational and accessible via the web interface.",
    "The data reuser has successfully accessed the archive user interface.",
    "At least one dataset with deposited files exists in the archive.",
    "The data reuser has navigated to or opened a specific dataset record within the archive.",
    "The dataset record selected by the data reuser includes at least one deposited file or at least one registered dataset version."
  ],
  "postconditions": [
    "The data reuser has been presented with a list of deposited files associated with the selected dataset.",
    "The data reuser has been presented with an overview of available versions of the selected dataset.",
    "The data reuser is able to identify which files and which dataset version are likely to be useful for their purposes, based on the information displayed.",
    "No changes are made to the dataset, its files, or its versions as a result of this use case."
  ],
  "assumptions": [
    "It is assumed that the data reuser interacts with the system exclusively through a web-based user interface provided by the Bath Research Data Archive System.",
    "It is assumed that dataset records in the archive contain sufficient file-level metadata (such as file name, size, and basic descriptive attributes) to allow preliminary identification of files without downloading.",
    "It is assumed that the system maintains internal representations of dataset versions and can present these versions in a way that allows the data reuser to distinguish between them at a glance.",
    "It is assumed that the prior searching or browsing of the archive (the \"search archive\" use case referenced by the extend relationship) has already been completed successfully before this use case begins.",
    "It is assumed that access control and licensing conditions for files and dataset versions are already enforced by other use cases and components and do not change during execution of this use case.",
    "It is assumed that any large or complex datasets have their file and version metadata pre-indexed so that listing and display operations can be performed without requiring the data reuser to wait for extensive background processing."
  ],
  "requirements_met": [
    "The system shall allow a data reuser to view a list of deposited files associated with a selected dataset via the web interface.",
    "The system shall display identifying information for each deposited file, such as file name and other descriptive attributes, to support preliminary assessment of usefulness without downloading the entire dataset.",
    "The system shall allow a data reuser to see, at a glance, the different versions of a selected dataset that are available in the archive.",
    "The system shall present each dataset version with distinguishing information (for example, version identifier or version date) to enable the data reuser to identify the appropriate version for use.",
    "The system shall present file and version information in a read-only manner that does not modify the underlying dataset, files, or versions.",
    "The system shall make the functionality to examine deposited files and dataset versions available as an extension to the archive search process when a data reuser views a specific dataset record."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The specific file-level metadata fields to be displayed for each deposited file (e.g., size, format, checksum, last modified date) have not been defined and require stakeholder agreement.",
    "The exact rules for ordering and presenting multiple dataset versions (e.g., newest first, semantic versioning) are not specified and must be determined.",
    "The visual design and layout for presenting file lists and version overviews at a glance are not specified and must be clarified with UX stakeholders.",
    "Performance constraints and limits on the number of files or versions displayed in a single view have not been defined and may affect implementation.",
    "The behavior when some files or dataset versions are restricted or embargoed (e.g., masking file names or metadata) is not explicitly defined and requires policy clarification."
  ],
  "main_flow": [
    "1. Data reuser selects a dataset record from the archive interface to examine its contents → System opens the dataset detail view for the selected dataset.",
    "2. Data reuser requests to view the list of deposited files associated with the dataset (implicitly by viewing the dataset detail view) → System retrieves the metadata for all deposited files linked to the selected dataset.",
    "3. Data reuser waits while the interface loads file information → System displays a list of deposited files for the dataset, including key identifying information for each file such as file name and other descriptive attributes that assist identification.",
    "4. Data reuser inspects the displayed list of files to understand the available contents → System maintains the file list display and allows the data reuser to scroll or navigate through the list as needed without initiating any downloads.",
    "5. Data reuser requests to view information about available versions of the selected dataset (implicitly within the same dataset detail view) → System retrieves information about all versions of the selected dataset that are available to the data reuser.",
    "6. Data reuser reviews the version information presented → System displays an overview of the different dataset versions at a glance, including distinguishing information (such as version labels or dates) for each version.",
    "7. Data reuser compares the file list and version overview to assess which file(s) and which version are most relevant to their needs → System keeps the combined file and version information visible so that the data reuser can complete a preliminary assessment of usefulness without downloading the entire dataset.",
    "8. Data reuser decides whether any of the available files or dataset versions are likely to be useful for further reuse → System concludes the use case with the dataset detail, file list, and version overview still available for subsequent actions such as download in other use cases."
  ],
  "alternative_flows": [
    "AF-1 (from Step 1): Data reuser navigates to the dataset record as an extension of a prior search. Condition: The data reuser has just completed the \"search archive\" use case and selects a dataset from the search results. The system opens the selected dataset detail view and then proceeds with Step 2 of the main flow.",
    "AF-2 (from Step 3): Dataset has a large number of files. Condition: The dataset contains more files than can be displayed conveniently on a single screen. The system paginates or segments the file list and allows the data reuser to navigate between pages or segments while still providing identifying information for each displayed file; after the data reuser navigates as desired, the flow continues with Step 4 where the data reuser inspects the available file information.",
    "AF-3 (from Step 6): Dataset has many versions. Condition: The dataset has numerous versions, making a full list difficult to present at a glance. The system summarizes the version history (for example, showing the most recent versions with an option to expand to see earlier ones) while ensuring that each shown version has sufficient distinguishing information; the flow then continues with Step 7 where the data reuser compares the summarised version information."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): Selected dataset record cannot be loaded. Condition: The system cannot retrieve the dataset record due to an internal error or missing record. The system displays an error message indicating that the dataset details are currently unavailable and does not proceed to file or version retrieval. The use case terminates without displaying file or version information.",
    "EF-2 (from Step 2): File metadata retrieval fails. Condition: The system encounters an error while retrieving metadata for the deposited files of the selected dataset. The system notifies the data reuser that file information cannot be displayed at this time and retains the basic dataset record view if available. The use case ends without the data reuser being able to examine individual files.",
    "EF-3 (from Step 5): Version information retrieval fails. Condition: The system is unable to retrieve dataset version information for the selected dataset. The system displays a message indicating that version details are unavailable while keeping the file list (if already loaded) visible. The use case proceeds to end after informing the data reuser that version comparison cannot be completed.",
    "EF-4 (from Step 3): Data reuser session or access expires before files are displayed. Condition: The data reuser’s session expires or access is revoked while the system is retrieving or displaying file information. The system redirects the data reuser to an appropriate access or sign-in screen and stops further display of file and version information for the dataset. The use case terminates without completing the assessment of file or version usefulness."
  ],
  "information_for_steps": [
    "1. Dataset identifier; dataset metadata summary; user session identifier.",
    "2. Dataset identifier; list of associated file identifiers; file metadata records.",
    "3. File names; file metadata attributes such as size or descriptive labels; presentation layout information.",
    "4. File list view state; user interface navigation state (such as scroll position or current segment).",
    "5. Dataset identifier; version identifiers; version metadata records.",
    "6. Version labels or identifiers; version dates or sequence information; version overview layout data.",
    "7. Combined view of selected dataset’s file metadata and version metadata; user’s implicit selection focus.",
    "8. User decision outcome regarding perceived usefulness of specific files and dataset versions; persistent availability of dataset, file, and version metadata for subsequent use cases."
  ]
}