{
  "use_case_name": "Review Deposited Datasets",
  "unique_id": "UC-013",
  "area": "Research Data Archiving and Administration",
  "context_of_use": "This use case describes how the Bath Data Archive administrator reviews newly deposited datasets to ensure that they meet minimum metadata, licensing, and policy compliance requirements before those datasets are made publicly available in the archive.",
  "scope": "Bath Data Archive system",
  "level": "User-goal",
  "primary_actors": [
    "bath data archive administrator"
  ],
  "supporting_actors": [
    "manage research datasets"
  ],
  "stakeholders_and_interests": [
    "bath data archive administrator: Wants to ensure that deposited datasets meet minimum metadata requirements, comply with institutional policies, and have appropriate licensing before being made public.",
    "Depositors: Want their datasets to be made public in a timely manner while complying with metadata, licensing, and policy requirements.",
    "Research Information manager: Wants consistent and reliable metadata to support analysis of research outputs and impact.",
    "fundingbody: Wants assurance that datasets are archived in a compliant manner with appropriate metadata and licensing to fulfil funder requirements.",
    "UnivITservice: Wants the archive to operate reliably with consistent and maintainable data holdings that meet agreed quality criteria.",
    "data reuser: Wants datasets to be accompanied by sufficient and consistent metadata and clear licensing information to assess suitability and reuse conditions."
  ],
  "description": "The Bath Data Archive administrator reviews deposited datasets to verify minimum required metadata, policy compliance, and licensing details prior to confirming their public availability in the archive.",
  "triggering_event": "The bath data archive administrator decides to review one or more newly deposited datasets that are pending public release.",
  "trigger_type": "External",
  "preconditions": [
    "The Bath Data Archive system is operational and accessible to the bath data archive administrator.",
    "The bath data archive administrator is authenticated and authorized to review deposited datasets.",
    "At least one dataset has been deposited into the Bath Data Archive and is in a state pending administrative review.",
    "The system has stored metadata and licensing information associated with the deposited dataset."
  ],
  "postconditions": [
    "For each reviewed dataset, its review status is recorded by the system.",
    "Datasets that satisfy minimum metadata, licensing, and policy compliance requirements are marked by the system as approved for being made public.",
    "Datasets that do not satisfy minimum metadata, licensing, or policy compliance requirements are identified by the system as not approved for public release until issues are resolved."
  ],
  "assumptions": [
    "It is assumed that the process of depositing datasets, including initial metadata and licensing entry, is handled by a separate use case such as \"manage research datasets\" and is completed before this review use case begins.",
    "It is assumed that the Bath Data Archive system can present to the bath data archive administrator all metadata and licensing information that depositors have supplied for a given dataset.",
    "It is assumed that the criteria for minimum metadata, policy compliance, and acceptable licensing are defined outside this use case and are available to the bath data archive administrator in a consistent form.",
    "It is assumed that the action of actually making an approved dataset publicly visible in user-facing discovery interfaces is performed by the overall archive workflow, and this use case is limited to recording approval or non-approval.",
    "It is assumed that the relationship \"extend manage research datasets\" means that the review of deposited datasets is an optional extension that can be invoked from the broader process of managing research datasets, without adding new capabilities beyond review and approval decisions.",
    "It is assumed that the system maintains states such as \"pending review\", \"approved\", and \"not approved\" or equivalent to represent administrative decisions about a dataset.",
    "It is assumed that only the bath data archive administrator can change the review status of a dataset through this use case."
  ],
  "requirements_met": [
    "The system shall allow the bath data archive administrator to make checks on deposited datasets before they are made public, so that consistent quality of metadata is maintained, compliance with policies can be checked, and details of licensing can be checked.",
    "The system shall allow the bath data archive administrator to verify that a minimum set of metadata is present for each deposited dataset before it is made public.",
    "The system shall allow the bath data archive administrator to confirm that licensing information has been provided for each deposited dataset before it is made public.",
    "The system shall record the administrative decision indicating whether a deposited dataset is approved or not approved for public release based on review.",
    "The system shall prevent datasets that have not been approved by the bath data archive administrator from being treated as ready for public availability."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The exact list of fields constituting the minimum required metadata has not been specified and needs to be defined.",
    "The detailed institutional and funder policy rules that must be checked during review have not been specified and need to be clarified.",
    "The specific licensing schemes or license types that are considered acceptable for deposited datasets have not been defined.",
    "The workflow for notifying depositors about non-approved datasets and required corrections is not described and needs policy and process clarification.",
    "The time targets or service-level expectations for how quickly administrators should review newly deposited datasets are not defined."
  ],
  "main_flow": [
    "1. bath data archive administrator selects a deposited dataset pending review in the Bath Data Archive system → System displays the dataset record, including deposited files, associated metadata, licensing details, and current review status.",
    "2. bath data archive administrator reviews the displayed metadata for completeness against the minimum required metadata set → System highlights or otherwise indicates which required metadata elements are present for the dataset.",
    "3. bath data archive administrator compares the dataset information against relevant policies (such as access, embargo, and retention policies) → System presents the stored policy-related attributes of the dataset, such as access level, embargo settings, and disposal schedule, to support compliance checking.",
    "4. bath data archive administrator inspects the licensing details associated with the dataset to confirm that they are appropriate and clearly specified → System displays the licensing information and any selected license options that have been recorded for the dataset.",
    "5. bath data archive administrator decides that the dataset satisfies minimum metadata, licensing, and policy compliance requirements and records an approval decision → System updates the dataset review status to approved for public availability and stores the administrator identifier and timestamp for the review decision.",
    "6. bath data archive administrator confirms completion of the review for the current dataset → System confirms that the dataset is marked as approved and ready to proceed in the overall publication workflow."
  ],
  "alternative_flows": [
    "AF-1 (from Step 1): If the bath data archive administrator chooses to review multiple datasets in sequence instead of a single dataset, the administrator selects a list or queue of pending datasets to review, and the system displays the first selected dataset record. After completing Steps 2 through 6 for the current dataset, the system automatically presents the next dataset in the selected set for review until the list is exhausted, at which point the use case ends successfully.",
    "AF-2 (from Step 5): If the bath data archive administrator determines that the dataset is acceptable but should only be made public after a specified condition such as an embargo end date, the administrator records an approval that is constrained by the embargo information already stored with the dataset. The system updates the dataset review status to approved with embargo, retains the embargo attributes associated with the dataset, and then proceeds to Step 6 where completion of review is confirmed."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): If the bath data archive administrator finds that the minimum required metadata has not been provided, the administrator records that the dataset does not meet minimum metadata requirements. The system updates the dataset review status to not approved due to insufficient metadata and records the reason. The use case ends for that dataset without marking it as approved.",
    "EF-2 (from Step 3): If the bath data archive administrator finds that the dataset does not comply with applicable policies based on the information displayed, the administrator records that the dataset is not policy compliant. The system updates the dataset review status to not approved due to policy non-compliance and records the reason. The use case ends for that dataset without marking it as approved.",
    "EF-3 (from Step 4): If the bath data archive administrator finds that licensing information is missing or inappropriate, the administrator records that the dataset has unacceptable or incomplete licensing. The system updates the dataset review status to not approved due to licensing issues and records the reason. The use case ends for that dataset without marking it as approved.",
    "EF-4 (from Step 1): If the system cannot retrieve the dataset record due to a system error or data access problem, the system informs the bath data archive administrator that the dataset cannot be loaded for review and logs the error. The use case is terminated for that attempted dataset without any review decision being recorded."
  ],
  "information_for_steps": [
    "1. Dataset identifier, depositor identifier, dataset title, current review status, list of deposited files, existing metadata fields, licensing information summary.",
    "2. Minimum metadata requirements definition, dataset metadata fields such as title, creator, description, keywords, dates, funder information, and any discipline-specific fields.",
    "3. Policy-related attributes such as access level, embargo start and end dates, disposal or retention schedule, and any flags related to confidentiality or collaboration agreements.",
    "4. Licensing information such as selected license type, license text or reference, rights statements, and any restrictions or conditions on reuse.",
    "5. Review decision value (approved or not approved), reasons for decision if applicable, administrator identifier, timestamp of decision, and updated review status field.",
    "6. Confirmation of updated review status, linkage of dataset to subsequent publication workflow steps, and audit trail entry for completion of the review action."
  ]
}