{
  "use_case_name": "Generate Solution Reports",
  "unique_id": "UC-003",
  "area": "Urban Mobility Planning – Reporting",
  "context_of_use": "The use case describes how an urban mobility planner generates executive and extensive reports that summarize the consequences of a proposed mobility solution, after the solution’s impacts have been estimated and consolidated within the system.",
  "scope": "Urban Mobility Planning Decision Support System",
  "level": "User-goal",
  "primary_actors": [
    "urban mobility planner"
  ],
  "supporting_actors": [
    "Internal Impact Estimation Module",
    "Internal Reporting Module"
  ],
  "stakeholders_and_interests": [
    "Urban mobility planner: Wants to efficiently generate accurate and comprehensible reports describing the consequences of proposed mobility solutions.",
    "Mayor: Wants concise executive summaries to understand high-level consequences of proposals for decision making.",
    "Consultancy company: Wants extensive, detailed reports to analyze the consequences of mobility proposals.",
    "City administration: Wants documented justification of proposals, including their effects on congestion, environment, fairness, and cost.",
    "Citizens and neighborhoods: Want mobility measures to be evaluated transparently with regard to congestion, fairness, and environmental impacts."
  ],
  "description": "This use case enables an urban mobility planner to generate both executive summaries and extensive reports that describe the consequences of a selected mobility solution, based on previously estimated and reported measure impacts managed by the system.",
  "triggering_event": "The urban mobility planner decides to create a report for a specific mobility solution in order to inform stakeholders about its consequences.",
  "trigger_type": "External",
  "preconditions": [
    "The urban mobility planner is authenticated and authorized to access reporting functions of the system.",
    "At least one mobility solution has been defined and stored in the system.",
    "Impact estimations for the selected mobility solution have been completed and are available within the system, including congestion, environmental, fairness, and cost-related data.",
    "The system has access to previously generated measure impact reports associated with the selected mobility solution."
  ],
  "postconditions": [
    "A solution report has been generated by the system in the selected report type (executive summary or extensive report).",
    "The generated report includes consolidated information based on existing impact estimations and measure impact reports for the selected solution.",
    "The generated report is available to the urban mobility planner for viewing, saving, or exporting within the system."
  ],
  "assumptions": [
    "It is assumed that the Urban Mobility Planning Decision Support System already contains estimated impacts for measures and solutions (such as congestion, emissions, noise, fairness, and cost) before this use case starts, in alignment with the include relationship to \"estimate measure impacts\".",
    "It is assumed that the system can internally aggregate and structure existing impact estimations and measure impact reports into solution-level reports without requiring additional user-defined calculations.",
    "It is assumed that the include relationship to \"report measure impacts\" refers to existing functionality that prepares and organizes measure-level impact information used as input for the solution report.",
    "It is assumed that both the executive summary and the extensive report reference the same underlying solution data, differing primarily in level of detail and presentation.",
    "It is assumed that the urban mobility planner selects from only two report types relevant to this use case: executive summary and extensive report.",
    "It is assumed that any storage or export of the generated report (such as file formats or distribution channels) is handled by existing system capabilities and does not introduce additional behavior beyond making the report available to the planner.",
    "It is assumed that the system’s Internal Impact Estimation Module and Internal Reporting Module are internal subsystems, not external actors, and therefore do not expand the functional scope beyond what is implied by the relationships."
  ],
  "requirements_met": [
    "The system shall allow the urban mobility planner to generate an executive summary report for a selected mobility solution that describes the consequences of the proposal.",
    "The system shall allow the urban mobility planner to generate an extensive, detailed report for a selected mobility solution that describes the consequences of the proposal.",
    "The system shall use existing estimated measure impacts when generating a solution report, in accordance with the include relationship to \"estimate measure impacts\".",
    "The system shall use existing measure impact reporting information when generating a solution report, in accordance with the include relationship to \"report measure impacts\".",
    "The system shall allow the urban mobility planner to select which mobility solution is the subject of the generated report.",
    "The system shall present the generated report to the urban mobility planner for review upon completion of the report generation process."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The specific output formats for generated reports (e.g., PDF, HTML, dashboard views) are not defined and must be agreed upon.",
    "The required level of detail and structure of the extensive report versus the executive summary (e.g., which sections and which impact dimensions must be included) is not specified.",
    "The expected language options and localization requirements for generated reports are not specified.",
    "The policies regarding storage duration, versioning, and archival of generated solution reports are not defined.",
    "The required performance constraints for report generation time (e.g., maximum acceptable response time) are not defined."
  ],
  "main_flow": [
    "1. Urban mobility planner selects the option to generate a solution report → System displays a list of available mobility solutions for reporting.",
    "2. Urban mobility planner selects a specific mobility solution from the list → System confirms the selected solution and retrieves associated solution data.",
    "3. Urban mobility planner selects the desired report type (executive summary or extensive report) → System confirms the chosen report type for the selected solution.",
    "4. Urban mobility planner confirms proceeding with report generation → System invokes the included \"estimate measure impacts\" functionality to ensure the latest impact estimations for the selected solution are available.",
    "5. Urban mobility planner waits while processing occurs → System applies the included \"estimate measure impacts\" results and consolidates updated impact estimations for all measures within the selected solution.",
    "6. Urban mobility planner observes system progress → System invokes the included \"report measure impacts\" functionality to collect and structure existing measure-level impact report data associated with the selected solution.",
    "7. Urban mobility planner remains in the reporting interface → System aggregates impact estimation data and measure impact report information into a solution-level report structure aligned with the selected report type.",
    "8. Urban mobility planner waits for report completion → System generates the final solution report content (executive summary or extensive report) based on the consolidated data.",
    "9. Urban mobility planner views the outcome of report generation → System presents the generated solution report to the urban mobility planner for review within the system interface."
  ],
  "alternative_flows": [
    "AF-1 (from Step 3): Urban mobility planner changes the selected report type before confirmation. Condition: The planner decides that a different report granularity is needed after initially choosing a report type. The planner modifies the report type selection (e.g., from executive summary to extensive report). The system updates the confirmed report type for the selected solution and returns to Step 4.",
    "AF-2 (from Step 2): Urban mobility planner changes the selected solution before report generation. Condition: After reviewing the initially selected solution, the planner determines that a different solution should be reported. The planner selects another solution from the list. The system updates the selected solution context and remains at Step 2 until the planner confirms the final solution selection, then continues with Step 3."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): No mobility solutions are available for reporting. Condition: The system detects that there are no stored mobility solutions when the planner attempts to select one. The system informs the urban mobility planner that no solutions are available for reporting and does not proceed with report generation. The use case terminates without generating a report.",
    "EF-2 (from Step 4): Required impact estimations are missing or cannot be obtained. Condition: While invoking the included \"estimate measure impacts\" functionality, the system cannot obtain required impact estimations for the selected solution. The system notifies the urban mobility planner that impact estimation data is incomplete or unavailable and cancels the report generation process. The use case terminates without generating a report.",
    "EF-3 (from Step 6): Measure impact reporting data is unavailable or inconsistent. Condition: While invoking the included \"report measure impacts\" functionality, the system detects that measure impact report data is missing or inconsistent for the selected solution. The system informs the urban mobility planner that the underlying measure impact reports are not ready for consolidation and stops report generation. The use case terminates without generating a report.",
    "EF-4 (from Step 8): Internal error occurs during report content generation. Condition: An internal processing error occurs while generating the solution report content. The system logs the error, informs the urban mobility planner that report generation has failed, and does not present a report. The use case terminates without generating a report."
  ],
  "information_for_steps": [
    "1. Available mobility solutions list, solution identifiers, brief solution descriptions.",
    "2. Selected solution identifier, solution metadata, associated measure set references.",
    "3. Report type selection (executive summary or extensive report), selected solution context.",
    "4. Selected solution identifier, reference to included \"estimate measure impacts\" process invocation parameters.",
    "5. Impact estimation results for the selected solution, including congestion, environmental, fairness, and cost-related indicators aggregated per measure.",
    "6. References to included \"report measure impacts\" process, collected measure impact report entries associated with the selected solution.",
    "7. Consolidated solution-level impact dataset, mapping between measure-level impacts and solution-level sections for the report.",
    "8. Generated report content elements, including headings, sections, summaries, and detailed findings depending on the chosen report type.",
    "9. Final solution report object, presentation data for on-screen viewing (e.g., rendered text, tables, and charts) made available to the urban mobility planner."
  ]
}