{
  "use_case_name": "Assign Patient Bed",
  "unique_id": "UC-009",
  "area": "Hospital Admission and Bed Management",
  "context_of_use": "The use case describes how a receptionist allocates an available hospital bed to a patient who needs a place to stay while in the hospital, after the receptionist has been authenticated by the system.",
  "scope": "Hospital Medical Record and Bed Management System",
  "level": "User-goal",
  "primary_actors": [
    "receptionist"
  ],
  "supporting_actors": [
    "Hospital Bed Inventory Subsystem"
  ],
  "stakeholders_and_interests": [
    "Receptionist: Needs to efficiently assign beds to patients so that hospital admission can proceed without delays.",
    "Patients: Need to have an assigned bed to ensure they have a place to stay while in the hospital.",
    "Hospital Administration: Needs accurate and up-to-date bed allocation to optimize resource utilization and occupancy management.",
    "Medical Staff: Need correct bed assignments to know where patients are located for care delivery.",
    "IT Operations: Needs consistent and reliable operation of the bed assignment functions to support hospital processes."
  ],
  "description": "This use case enables a receptionist to authenticate to the system and assign an available hospital bed to a patient, so that the patient has a designated place to stay during their hospital stay and the system maintains an accurate record of bed occupancy.",
  "triggering_event": "The receptionist initiates a bed assignment for a patient who requires a hospital stay.",
  "trigger_type": "External",
  "preconditions": [
    "The Hospital Medical Record and Bed Management System is operational and accessible.",
    "The receptionist has valid system credentials for authentication.",
    "The patient has been registered in the system with an identifiable patient record.",
    "At least one hospital bed record exists in the system configuration."
  ],
  "postconditions": [
    "The selected hospital bed is marked in the system as assigned to the specified patient.",
    "The patient record reflects the assigned bed identifier and related bed information.",
    "The bed inventory reflects updated occupancy status for the assigned bed.",
    "An audit trail entry is recorded for the bed assignment action performed by the receptionist."
  ],
  "assumptions": [
    "The included relationship to the \"authenticate\" use case implies that the receptionist must successfully log in before performing any bed assignment actions.",
    "The system maintains a master list of hospital beds, including their current occupancy status, which is managed outside this use case.",
    "The patient to whom the bed is being assigned has already completed any necessary registration processes before this use case starts.",
    "The same bed cannot be assigned to more than one patient simultaneously, and the system enforces this rule through its bed inventory subsystem.",
    "Receptionists have the authorization to view patient details necessary for bed assignment while respecting institutional privacy and confidentiality policies.",
    "The process of physically preparing the bed (e.g., cleaning, equipment setup) is handled operationally outside the system and is not part of this use case.",
    "Network connectivity and required infrastructure for system access from the receptionist’s workstation are available during the execution of this use case."
  ],
  "requirements_met": [
    "The system shall require the receptionist to successfully authenticate before accessing the bed assignment functionality.",
    "The system shall allow an authenticated receptionist to search for and select a patient record for whom a bed is to be assigned.",
    "The system shall display a list of beds that are available for assignment, including their identifiers and essential attributes (such as ward or room).",
    "The system shall allow the receptionist to select an available bed for the chosen patient.",
    "The system shall update the bed status to indicate that the selected bed is assigned to the chosen patient.",
    "The system shall record the association between the patient and the assigned bed in the patient’s record.",
    "The system shall prevent assigning a bed that is already indicated as occupied or otherwise unavailable in the system.",
    "The system shall confirm to the receptionist that the bed has been successfully assigned to the patient.",
    "The system shall record the date, time, and receptionist identifier for each bed assignment for audit purposes."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "Business rules for bed selection priority (for example, ward preferences, gender-based room allocation, or critical care requirements) need to be defined.",
    "Rules for reassigning or changing a previously assigned bed and how conflicts are handled are not specified.",
    "Policies on how long a bed can remain reserved without the patient occupying it are not defined.",
    "The extent of patient information that the receptionist is allowed to view during bed assignment requires clarification with privacy and compliance stakeholders."
  ],
  "main_flow": [
    "1. Receptionist initiates system access → System presents authentication interface as an included authentication step.",
    "2. Receptionist provides valid login credentials → System verifies the credentials and establishes an authenticated session for the receptionist.",
    "3. Receptionist selects the bed assignment function from the system menu → System displays the bed assignment interface.",
    "4. Receptionist searches for and selects the patient for whom a bed needs to be assigned → System retrieves and displays the selected patient’s identifying information relevant to bed assignment.",
    "5. Receptionist requests a list of available beds for assignment → System retrieves and displays a list of beds currently marked as available, including relevant bed details.",
    "6. Receptionist reviews the list of available beds and selects a suitable bed for the patient → System highlights the selected bed and prepares the assignment details for confirmation.",
    "7. Receptionist confirms the bed assignment for the selected patient and bed → System records the bed assignment, updates the bed status to assigned, and links the bed to the patient record.",
    "8. Receptionist reviews the confirmation → System displays a confirmation message and shows updated patient and bed information reflecting the new assignment."
  ],
  "alternative_flows": [
    "AF-1 (from Step 5): If the receptionist applies additional filters or sorting to the list of available beds before selection, the receptionist adjusts filter or sorting criteria and submits the request → System refreshes the list of available beds according to the specified criteria, after which the flow continues at Step 6.",
    "AF-2 (from Step 4): If the patient search returns multiple matching patient records, the receptionist reviews the list of matching patients and selects the correct patient based on available details → System displays the selected patient’s identifying information, after which the flow continues at Step 5."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): If the receptionist provides invalid authentication credentials, the system rejects the login attempt, displays an error message indicating invalid credentials, and allows the receptionist to retry authentication a limited number of times; if the maximum number of attempts is reached, the system blocks further login attempts for that session and terminates the use case without allowing bed assignment.",
    "EF-2 (from Step 4): If no patient record matches the search criteria, the system displays a message indicating that no matching patient was found and prompts the receptionist to revise the search criteria or cancel the bed assignment; if the receptionist cancels, the use case ends without assigning a bed.",
    "EF-3 (from Step 5): If no beds are currently available for assignment, the system displays a message indicating that there are no available beds and prevents proceeding to bed selection; the use case ends without assigning a bed.",
    "EF-4 (from Step 7): If, during the attempt to record the bed assignment, the system detects that the selected bed has become unavailable (for example, assigned in a concurrent transaction), the system cancels the assignment operation for that bed, displays a message indicating that the bed is no longer available, refreshes the list of available beds, and returns the flow to Step 6.",
    "EF-5 (from Step 7): If a system error or connectivity failure occurs while recording the bed assignment, the system does not update the bed or patient records, logs the error, presents an error notification to the receptionist, and terminates the use case without a completed bed assignment."
  ],
  "information_for_steps": [
    "1. Receptionist identifier, authentication request metadata.",
    "2. Username, password, authentication token, session identifier.",
    "3. User role permissions, menu options, selected function identifier.",
    "4. Patient search criteria (such as name, patient ID, date of birth), patient record identifiers, basic patient demographic data.",
    "5. Bed identifiers, bed status (available, occupied, unavailable), bed location details (such as ward, room, or unit), bed type attributes.",
    "6. Selected bed identifier, preview of bed attributes, association with selected patient identifier.",
    "7. Patient identifier, bed identifier, assignment timestamp, receptionist identifier, updated bed status value.",
    "8. Confirmation message text, updated patient record summary with bed assignment, updated bed record status and association information."
  ]
}