{
  "use_case_name": "Browse Products",
  "unique_id": "UC-002",
  "area": "E-commerce",
  "context_of_use": "This use case allows customers to browse, search, and view detailed information about products within the e-commerce platform.",
  "scope": "E-commerce System",
  "level": "User-goal",
  "primary_actors": [
    "customer"
  ],
  "supporting_actors": [],
  "stakeholders_and_interests": [
    "customer: wants to find and evaluate products easily",
    "business owner: wants to increase sales through effective product visibility"
  ],
  "description": "This use case enables customers to browse products by category, search for products by keyword, and view detailed information about products.",
  "triggering_event": "Customer initiates a browsing session.",
  "trigger_type": "External",
  "preconditions": [
    "Customer is logged into the system."
  ],
  "postconditions": [
    "Customer can view a list of products and their details."
  ],
  "assumptions": [
    "The customer has an active account to log in."
  ],
  "requirements_met": [
    "The system shall allow customers to browse products by category.",
    "The system shall allow customers to search for products by keyword.",
    "The system shall allow customers to view product details."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "None identified."
  ],
  "main_flow": [
    "1. Customer browses products by category → System displays a list of products in the selected category.",
    "2. Customer searches for products by keyword → System displays a list of products matching the keyword.",
    "3. Customer views product details → System displays detailed information about the selected product."
  ],
  "alternative_flows": [
    "AF-1 (from Step 1): If the customer selects a sub-category, then the system displays a list of products in the selected sub-category.",
    "AF-2 (from Step 2): If the customer enters no keyword, then the system prompts the customer to enter a valid keyword."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): If the system fails to retrieve products, then the system displays an error message indicating the issue.",
    "EF-2 (from Step 2): If no products match the search keyword, then the system displays a message indicating no results found."
  ],
  "information_for_steps": [
    "1. Category selection",
    "2. Search keyword",
    "3. Product selection"
  ]
}