{
  "use_case_name": "View Sensor Levels",
  "unique_id": "UC-008",
  "area": "Urban Mobility Analysis",
  "context_of_use": "The use case is executed when an urban mobility planner needs to inspect emission and traffic levels from individual sensors to consider environmental and traffic effects while validating urban mobility measures or proposals.",
  "scope": "Urban Mobility Planning Decision Support System",
  "level": "User-goal",
  "primary_actors": [
    "urban mobility planner"
  ],
  "supporting_actors": [
    "Pollution Sensor Data Source",
    "Traffic Sensor Data Source"
  ],
  "stakeholders_and_interests": [
    "Urban mobility planner: Needs accurate and timely emission and traffic level data from individual sensors to assess the environmental and traffic impact of current or proposed measures.",
    "City administration: Requires that mobility planning decisions are supported by transparent, data-driven evidence on emissions and traffic levels.",
    "Citizens in affected neighborhoods: Expect that congestion, pollution, and traffic impacts on their neighborhoods are properly evaluated and considered.",
    "Environmental authorities: Require reliable emission level information at sensor locations to ensure environmental effects of mobility measures are evaluated.",
    "Traffic management departments: Need insight into traffic levels at specific sensors to coordinate and adjust traffic management strategies."
  ],
  "description": "This use case allows an urban mobility planner to select an individual sensor and view the emission or traffic levels measured at that sensor so that environmental and traffic conditions can be considered in the evaluation of mobility measures and proposals.",
  "triggering_event": "The urban mobility planner decides to inspect emission or traffic levels at a specific sensor location in order to consider environmental or traffic effects for a measure or proposal.",
  "trigger_type": "External",
  "preconditions": [
    "The urban mobility planner is authenticated and authorized to access sensor information in the Urban Mobility Planning Decision Support System.",
    "At least one pollution sensor is registered in the system with associated emission level data.",
    "At least one traffic sensor is registered in the system with associated traffic level data.",
    "The system has access to the latest available sensor readings or stored historical sensor data."
  ],
  "postconditions": [
    "The system has presented the requested emission and/or traffic levels for the selected sensor to the urban mobility planner.",
    "The urban mobility planner has had the opportunity to review the sensor levels and incorporate them into their assessment of environmental or traffic conditions.",
    "The system has recorded, where applicable, that the sensor level view operation occurred for audit or analytical purposes."
  ],
  "assumptions": [
    "It is assumed that the Urban Mobility Planning Decision Support System maintains an internal catalog of sensors, including at least pollution sensors and traffic sensors, each with a unique identifier and descriptive attributes such as location.",
    "It is assumed that emission levels are provided to the system by a Pollution Sensor Data Source and traffic levels are provided to the system by a Traffic Sensor Data Source, and that these sources are external systems or data feeds.",
    "It is assumed that the urban mobility planner can distinguish between pollution sensors and traffic sensors within the system interface.",
    "It is assumed that the system may present both current and previously stored sensor levels, but the requirement text only mandates that the planner must be able to review the levels, without prescribing specific time-range selection functionality.",
    "It is assumed that the system presents sensor levels in a human-readable format that allows the urban mobility planner to interpret the magnitude of emission or traffic levels without requiring additional computation by the system.",
    "It is assumed that the use case does not alter any sensor configuration or underlying sensor data; it is a read-only inspection of emission and traffic levels.",
    "It is assumed that any time-related aspects of sensor levels (such as timestamp of readings) are displayed only to the extent necessary for the planner to understand the conditions, without adding analytical features beyond simple viewing."
  ],
  "requirements_met": [
    "The system shall allow the urban mobility planner to review the emission levels at a selected pollution sensor so that environmental effects are considered.",
    "The system shall allow the urban mobility planner to review the traffic levels at a selected traffic sensor so that traffic levels are considered.",
    "The system shall provide a list or search mechanism for the urban mobility planner to select a specific sensor for which emission or traffic levels are to be viewed.",
    "The system shall retrieve and display the latest available emission level data for the selected pollution sensor.",
    "The system shall retrieve and display the latest available traffic level data for the selected traffic sensor.",
    "The system shall clearly indicate the sensor identity and type (pollution sensor or traffic sensor) when displaying sensor levels.",
    "The system should display, for each shown sensor level, the associated measurement time so that the urban mobility planner can interpret the conditions accurately."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The required temporal scope of sensor levels (only latest reading versus configurable historical range) is not defined and requires clarification.",
    "The level of aggregation or granularity for emission and traffic levels (raw readings versus averaged values) is not specified and must be decided.",
    "The units and normalization standards for emission and traffic levels to be displayed to the planner are not established and need definition.",
    "The performance requirement for retrieving and displaying sensor levels (e.g., maximum acceptable response time) is not specified.",
    "The retention period for sensor readings used in this use case and any associated audit logging policies are not defined."
  ],
  "main_flow": [
    "1. Urban mobility planner requests to view sensor levels → System displays a list or selection interface of available sensors, including pollution and traffic sensors, with identifying information such as name and location.",
    "2. Urban mobility planner selects a specific pollution sensor to inspect emission levels → System retrieves the latest available emission level data for the selected pollution sensor.",
    "3. Urban mobility planner views emission level details for the selected pollution sensor → System presents the emission levels, including measurement values and associated timestamps, in a human-readable format.",
    "4. Urban mobility planner selects a specific traffic sensor to inspect traffic levels → System retrieves the latest available traffic level data for the selected traffic sensor.",
    "5. Urban mobility planner views traffic level details for the selected traffic sensor → System presents the traffic levels, including measurement values and associated timestamps, in a human-readable format.",
    "6. Urban mobility planner indicates completion of review of sensor levels → System records the completion of the viewing session, if logging is enabled, and returns the planner to the appropriate planning or analysis context."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): Urban mobility planner chooses to inspect only traffic sensor levels instead of emission levels. Condition: The planner is not interested in emission levels at this time. Flow: At Step 2, the planner skips selecting a pollution sensor and directly selects a traffic sensor. The system proceeds to retrieve traffic level data and continues with Step 4 and Step 5, then proceeds to Step 6.",
    "AF-2 (from Step 4): Urban mobility planner chooses to inspect only emission sensor levels instead of traffic levels. Condition: The planner is not interested in traffic levels at this time. Flow: After completing Step 3, the planner does not select any traffic sensor. The system skips Step 4 and Step 5 and continues directly to Step 6.",
    "AF-3 (from Step 1): Urban mobility planner filters the sensor list by type or location before selection. Condition: The planner wants to limit the sensor list to a particular area or to only pollution or only traffic sensors. Flow: Immediately after Step 1, the planner applies filter criteria; the system updates the sensor selection interface to show only sensors that match the criteria. The planner then continues with Step 2 or Step 4, depending on whether a pollution sensor or traffic sensor is selected."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): Selected pollution sensor data unavailable. Condition: The system cannot retrieve emission level data for the selected pollution sensor due to missing data or connectivity issues with the Pollution Sensor Data Source. Flow: The system displays an error message describing that emission levels for the selected sensor are currently unavailable and advises the planner to try again later or select a different sensor. The use case then allows the planner to return to Step 1 to select another sensor or to terminate the use case.",
    "EF-2 (from Step 4): Selected traffic sensor data unavailable. Condition: The system cannot retrieve traffic level data for the selected traffic sensor due to missing data or connectivity issues with the Traffic Sensor Data Source. Flow: The system displays an error message describing that traffic levels for the selected sensor are currently unavailable and advises the planner to try again later or select a different sensor. The use case then allows the planner to return to Step 1 to select another sensor or to terminate the use case.",
    "EF-3 (from Step 1): No sensors are available. Condition: The system has no registered pollution or traffic sensors when the planner requests to view sensor levels. Flow: The system informs the planner that no sensors are currently available for viewing and does not display a sensor selection list. The use case terminates without displaying sensor levels.",
    "EF-4 (from Step 1): Urban mobility planner session is not authenticated or authorization has expired. Condition: The planner attempts to access sensor levels without a valid authenticated session or without sufficient permissions. Flow: The system denies access to the sensor level viewing function, displays an authorization or authentication error message, and prompts the planner to authenticate or obtain appropriate access before retrying. The use case terminates without displaying sensor levels."
  ],
  "information_for_steps": [
    "1. Sensor list data including sensor identifiers, sensor type (pollution or traffic), sensor name, sensor location, and availability status.",
    "2. Selected pollution sensor identifier, associated emission level readings, and corresponding measurement timestamps.",
    "3. Emission level values (e.g., pollutant concentration values), measurement timestamps, and sensor metadata such as location and sensor name.",
    "4. Selected traffic sensor identifier, associated traffic level readings, and corresponding measurement timestamps.",
    "5. Traffic level values (e.g., vehicle count or flow indicators), measurement timestamps, and sensor metadata such as location and sensor name.",
    "6. Session metadata such as user identifier of the urban mobility planner, time of completion of the sensor review, and optional viewing log entries if logging is enabled."
  ]
}