{
  "use_case_name": "View Real-Time Measurements on Map",
  "unique_id": "UC-004",
  "area": "Real-Time Traffic and Environmental Monitoring",
  "context_of_use": "A UMD employee uses the monitoring map interface to view real-time traffic, heatmap, and environmental measurements for Wonderland in order to support informed monitoring and decision-making.",
  "scope": "Wonderland Traffic Simulation and Monitoring Platform",
  "level": "User-goal",
  "primary_actors": [
    "umd employee"
  ],
  "supporting_actors": [
    "IT infrastructure",
    "Network services"
  ],
  "stakeholders_and_interests": [
    "UMD employee: Wants to monitor real-time traffic, heatmap, and environmental measurements on an up-to-date map so that they can quickly understand the current situation and make informed decisions.",
    "UMD management: Wants staff to effectively monitor traffic and environmental impact in Wonderland using real-time visualizations to support operational and planning decisions.",
    "IT operations: Wants the monitoring and map application, along with its data connections, to function reliably so that real-time measurements can be displayed without interruption."
  ],
  "description": "This use case describes how a UMD employee opens the monitoring map interface and views real-time traffic conditions, traffic heatmaps, and environmental measurements visualized on an up-to-date street map of Wonderland, using intuitive controls to select and combine different measurement layers for monitoring and decision-making.",
  "triggering_event": "A UMD employee decides to monitor the current traffic and environmental situation in Wonderland using the map-based interface.",
  "trigger_type": "External",
  "preconditions": [
    "The Wonderland Traffic Simulation and Monitoring Platform is deployed and operational.",
    "The UMD employee has access to the monitoring map interface of the platform.",
    "The monitoring map application is connected to the configured live data sources for traffic and environmental measurements.",
    "The base street map of Wonderland is available and up to date in the system."
  ],
  "postconditions": [
    "The UMD employee has successfully viewed up-to-date traffic data visualized on the map.",
    "The UMD employee has successfully viewed up-to-date traffic heatmap information visualized on the map.",
    "The UMD employee has successfully viewed up-to-date environmental measurements (including CO2, noise, and air pollution levels) visualized on the map.",
    "Any selected layers and filters for traffic, heatmap, and environmental data are applied and visible on the map.",
    "The UMD employee can base monitoring and subsequent decisions on the displayed real-time measurements and selected visualizations."
  ],
  "assumptions": [
    "User access to the monitoring map interface is already established before this use case begins; authentication details are handled by separate mechanisms and are outside the scope of this use case.",
    "Live traffic and environmental measurements are continuously provided to the platform by external sensors and data sources, and this use case focuses only on their visualization.",
    "The system processes incoming live data quickly enough that it can be considered real time or near real time for monitoring purposes.",
    "The intuitive nature of the monitoring map interface is ensured through usability design but does not introduce capabilities beyond selecting, filtering, and viewing the described measurement layers.",
    "The structure and semantics of traffic and environmental parameters (e.g., which pollutants are measured) are predefined elsewhere and are simply presented as selectable options in this use case."
  ],
  "requirements_met": [
    "The system shall present an up-to-date map of the streets of Wonderland, including relevant road types and obstacles, as the background for visualizing real-time measurements.",
    "The system shall display current traffic conditions on the map using data gathered from sensors in Wonderland so that a UMD employee can monitor busy areas and congestions.",
    "The system shall provide a traffic heatmap view on the map so that a UMD employee can quickly see how traffic crowdedness is spatially distributed in Wonderland.",
    "The system shall display real-time environmental measurements on the map at measurement points so that a UMD employee can assess how the current traffic situation affects the environment.",
    "The system shall show the overall real-time CO2 emissions derived from current measurements so that a UMD employee can understand how harmful the current situation is to the environment.",
    "The system shall show real-time noise levels per measurement point on the map so that a UMD employee can determine whether noise levels exceed legal limits.",
    "The system shall show the real-time overall level of air pollution so that a UMD employee can understand how harmful the current situation is to the environment.",
    "The system shall show real-time air pollution levels per measurement point on the map so that a UMD employee can identify areas that are becoming too polluted.",
    "The system shall provide intuitive controls for a UMD employee to select and view traffic, heatmap, and environmental data layers on the map for real-time monitoring."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The exact set of environmental parameters to be displayed (e.g., specific pollutants, noise metrics) has not been fully defined.",
    "Visualization conventions for thresholds (such as legal noise or pollution limits) and how exceedances are highlighted on the map have not been specified.",
    "Update frequency and latency limits for data to still be considered real-time or sufficiently up to date for monitoring purposes have not been formalized.",
    "The required spatial resolution and coverage of sensors across Wonderland, and how gaps in coverage should be represented on the map, remain to be clarified.",
    "Detailed usability and accessibility criteria for the intuitive monitoring interface (e.g., color schemes, support for color-blind users) have not been established."
  ],
  "main_flow": [
    "1. UMD employee opens the monitoring map interface of the platform on a supported device → System loads and displays the up-to-date street map of Wonderland as the primary view.",
    "2. UMD employee selects the option to display real-time traffic data on the map → System retrieves current traffic measurements from live data sources and overlays traffic indicators (such as flow, speed, and congestion) on the street map in real time.",
    "3. UMD employee reviews the displayed traffic information on the map → System continuously updates the traffic visualization as new measurements arrive, keeping the displayed traffic situation current.",
    "4. UMD employee selects the option to display a traffic heatmap layer → System generates and overlays a real-time traffic heatmap on top of the street map, visually representing crowdedness across Wonderland.",
    "5. UMD employee reviews the traffic heatmap visualization → System maintains and updates the heatmap using incoming traffic measurements so that areas of varying crowdedness remain accurately represented.",
    "6. UMD employee selects options to display environmental measurement layers on the map (such as CO2 emissions, noise levels, and air pollution levels) → System retrieves the latest environmental measurements from live data sources and overlays them on the map at the corresponding measurement points and as overall indicators where applicable.",
    "7. UMD employee reviews the environmental measurements on the map, including overall indicators and per-measurement-point values → System keeps the environmental data visualizations up to date as new measurements are received.",
    "8. UMD employee adjusts the visible combination of traffic, heatmap, and environmental layers to focus on the current monitoring need → System applies the selection, updates the composite visualization on the map, and continues to reflect real-time measurements for all visible layers.",
    "9. UMD employee uses the presented real-time visualizations to assess the current traffic and environmental situation and, when finished, closes the monitoring map interface → System stops updating the view for that session while keeping data feeds and services available for subsequent monitoring sessions."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): UMD employee chooses to view only traffic data without heatmap or environmental layers. Condition: The employee is focused solely on current traffic flow and congestion. The employee enables only the traffic layer on the map. The system overlays and updates only traffic indicators on the street map. The flow continues with Step 3 for reviewing traffic data, and the employee may later proceed to Step 8 if additional layers are enabled.",
    "AF-2 (from Step 4): UMD employee chooses to view only the traffic heatmap without detailed traffic indicators. Condition: The employee prefers a simplified, aggregated view. The employee disables the detailed traffic indicators and leaves only the heatmap layer active. The system shows and updates only the heatmap on the street map. The flow continues with Step 5 for reviewing the heatmap, and the employee may later proceed to Step 8 to adjust layers again.",
    "AF-3 (from Step 6): UMD employee chooses to view only specific environmental parameters (for example, noise levels only or air pollution only). Condition: The employee is interested in a subset of environmental measurements. The employee selects a subset of environmental layers in the interface. The system overlays and updates only the selected environmental parameters on the map. The flow then continues with Step 7 for reviewing the selected environmental measurements.",
    "AF-4 (from Step 8): UMD employee changes filters such as region of interest or parameter-specific thresholds while viewing the map. Condition: The employee needs to focus on a particular area or value range. The employee adjusts map filters (for example, zooming to a district or setting value thresholds). The system reapplies the filters, updates the visible subset of traffic, heatmap, and environmental visualizations accordingly, and continues with Step 9 when the employee has finished monitoring.",
    "AF-5 (from Step 1): UMD employee switches between different map views or layouts (for example, standard map view versus satellite-style or schematic view). Condition: The employee wants an alternative visual context. The employee selects a different map view or layout from the interface. The system reloads the base map using the selected view while keeping any active measurement layers overlaid and updated. The flow then continues with Step 2 or the next relevant selection step depending on what the employee chooses to view."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): Real-time traffic data is temporarily unavailable from live sources. The system cannot retrieve current traffic measurements and therefore does not overlay traffic indicators on the map. The system displays a notification indicating that traffic data is temporarily unavailable while keeping the base map and any other active layers visible. The use case continues with any remaining available layers (such as environmental data) or ends after the employee acknowledges the limitation.",
    "EF-2 (from Step 4): Data needed for generating the traffic heatmap is incomplete or temporarily delayed. The system cannot reliably compute the heatmap from current traffic measurements. The system displays a message that the heatmap view is currently limited or unavailable and hides or dims the heatmap layer while maintaining other active layers. The flow may return to Step 3 or Step 6 for the employee to focus on other available visualizations, or the use case ends if the employee chooses to stop monitoring.",
    "EF-3 (from Step 6): Some environmental measurements (such as certain CO2, noise, or air pollution sensors) are not providing current data. The system retrieves only partial environmental data and can display measurements for a subset of points or parameters. The system overlays the available environmental data on the map, visually indicates missing or stale measurement points, and informs the employee that coverage is partial. The flow continues with Step 7, with the employee reviewing the partially available environmental data.",
    "EF-4 (from Step 7): Environmental or traffic measurements are older than an acceptable real-time threshold, resulting in outdated data being displayed. The system detects that the most recent data for one or more layers exceeds the configured freshness threshold. The system flags the affected layers or measurements as outdated on the map and shows a warning that the data is no longer current. The employee may choose to continue viewing with awareness of the limitation, adjust filters or layers (returning to Step 8), or close the interface, in which case the use case ends.",
    "EF-5 (from Step 1): The monitoring map interface cannot retrieve the base map of Wonderland due to a mapping service issue. The system fails to load the street map and displays an error notification indicating that the base map is unavailable. No measurement layers can be meaningfully displayed. The use case ends without successful visualization, and the employee may try again once the mapping service is restored."
  ],
  "information_for_steps": [
    "1. Base street map data for Wonderland, device display characteristics, current zoom and pan settings.",
    "2. Live traffic measurement data (e.g., flow, speed, occupancy, congestion indicators), mapping between sensors and road segments.",
    "3. Updated traffic measurement values, timestamp of last traffic update, visual encoding parameters for congestion.",
    "4. Aggregated traffic intensity values per map region or grid cell, color scale definitions for heatmap visualization.",
    "5. Continuous heatmap updates, hotspot locations, time of last heatmap refresh.",
    "6. Environmental measurement data per point (e.g., CO2 levels, noise levels, air pollutant concentrations), overall aggregated indicators, measurement locations.",
    "7. Updated environmental measurement values, timestamps of environmental updates, threshold markers for legal or recommended limits.",
    "8. Layer visibility flags (traffic, heatmap, environmental parameters), selected filters (region of interest, parameter ranges), current map view configuration.",
    "9. Summary of currently visible layers and filters, overall assessment context for decision-making, session end state for the monitoring view."
  ]
}