{
  "use_case_name": "Access Medical Records",
  "unique_id": "UC-002",
  "area": "Electronic Medical Record Access Management",
  "context_of_use": "Authorized users access the system to open and view the details of a specific medical record through authenticated and access-controlled interactions.",
  "scope": "Digital Medical Record Management System",
  "level": "User-goal",
  "primary_actors": [
    "patient",
    "doctor",
    "lab specialist"
  ],
  "supporting_actors": [
    "authentication service",
    "access control service"
  ],
  "stakeholders_and_interests": [
    "Patient: Wants to access and review own medical record details while maintaining confidentiality and control over who can see the information.",
    "Doctor: Wants to access assigned patient medical records in order to review medical details while restricting access to only authorized patient records.",
    "Lab specialist: Wants to access patient medical records that are relevant to their work so that they can see the medical record details needed for lab-related tasks.",
    "Healthcare organization: Wants secure, traceable access to medical records to comply with confidentiality and privacy requirements.",
    "System security administrator: Wants all access to medical records to be authenticated and constrained to authorized users and assigned records."
  ],
  "description": "This use case describes how authorized users (patients, doctors, lab specialists) authenticate, have their access rights evaluated, and then open and view the details of a selected medical record in the system.",
  "triggering_event": "A patient, doctor, or lab specialist initiates a request to view a medical record through the system user interface.",
  "trigger_type": "External",
  "preconditions": [
    "The Digital Medical Record Management System is operational and reachable by the actor.",
    "The actor has a valid registered user account in the system.",
    "The relevant medical record exists in the system repository.",
    "Required network and infrastructure services for authentication and access control are available."
  ],
  "postconditions": [
    "The requested medical record details have been displayed to the authorized actor according to the actor’s access rights.",
    "The system has applied access control rules to restrict visibility to information the actor is authorized to see.",
    "The system has internally determined that the actor was authenticated before granting access to the medical record.",
    "The system has an internal record that the medical record was accessed by the actor (at least at the level implied by system logging and audit policies)."
  ],
  "assumptions": [
    "It is assumed that the included use case \"authenticate\" corresponds to the user logging in or otherwise proving identity before accessing any medical record.",
    "It is assumed that the included use case \"manage record access\" corresponds to evaluating and enforcing access rights, such as allowing patients to see their own records and doctors and lab specialists to see only records they are authorized to access.",
    "It is assumed that patients are authorized to view only their own medical records.",
    "It is assumed that doctors and lab specialists are authorized to view only those patient medical records to which they have been previously assigned through separate functionality described outside this use case.",
    "It is assumed that the system provides a user interface allowing the actor to choose a specific medical record to open, consistent with the actor’s access rights.",
    "It is assumed that successful access requires prior successful authentication in the current session, and that re-authentication rules, if any, are handled by the included authentication behavior.",
    "It is assumed that the system enforces confidentiality requirements implied by the statements about restricting views to assigned patient medical records.",
    "It is assumed that access from different device types (mobile phones, tablets, computers) leverages the same access control and authentication mechanisms for this use case.",
    "It is assumed that the system is designed to be available 24/7 for initiating this use case, consistent with the user requirement to access the system at any given time."
  ],
  "requirements_met": [
    "The system shall allow a patient to access and open the patient’s own medical record in order to see the medical record’s details.",
    "The system shall allow a doctor to access and open the medical records of patients for whom the doctor is authorized, in order to see the medical record’s details.",
    "The system shall allow a lab specialist to access and open the medical records of patients for whom the lab specialist is authorized, in order to see the medical record’s details.",
    "The system shall require that a user be authenticated before accessing any medical record.",
    "The system shall restrict a doctor’s view to medical records of patients to whom that doctor is authorized or assigned, in order to maintain patient confidentiality.",
    "The system shall allow access to medical records only to users (patients, doctors, lab specialists) who have the appropriate access rights as determined by the system’s access control rules.",
    "The system shall be accessible by authorized users at any time, subject to system availability, in order to allow 24/7 access to medical records.",
    "The system shall support accessing medical records from different device types (such as mobile phones, tablets, and computers) without altering the access control behavior."
  ],
  "priority": "High",
  "risk": "High",
  "outstanding_issues": [
    "The exact authentication mechanisms and credential types (e.g., DigiD, username and password, or other methods) to be used in the included \"authenticate\" use case are not fully specified.",
    "The precise rules for assigning doctors and lab specialists to specific patient medical records, which determine access rights, are defined outside this use case and need clarification for complete access control specifications.",
    "The required level of logging and auditing for medical record access events (e.g., which fields are stored and retention periods) is not detailed.",
    "The behavior when the system is temporarily unavailable (maintenance windows, outages) and its impact on the promise of 24/7 access has not been defined.",
    "The specific data elements within a medical record that each actor type may see (field-level permissions) are not fully defined."
  ],
  "main_flow": [
    "1. Patient, doctor, or lab specialist initiates access to the system user interface to view a medical record → System presents an option to authenticate and proceed to the medical record access functionality.",
    "2. Patient, doctor, or lab specialist submits authentication credentials as part of the included \"authenticate\" behavior → System verifies the credentials and establishes an authenticated session for the actor.",
    "3. Authenticated patient, doctor, or lab specialist requests to open the medical records area → System displays a list or selection mechanism showing only medical records that are potentially accessible to the actor, as determined by the included \"manage record access\" behavior.",
    "4. Authenticated patient, doctor, or lab specialist selects a specific medical record from the available list → System invokes the included \"manage record access\" behavior to evaluate whether the actor is authorized to view the selected record.",
    "5. System confirms that the actor is authorized to access the selected medical record according to access control rules → System retrieves the selected medical record’s details from the repository.",
    "6. System formats and displays the medical record details to the actor according to the actor’s access rights → Patient, doctor, or lab specialist views the medical record details on the screen.",
    "7. Patient, doctor, or lab specialist chooses to end viewing or navigate away from the medical record → System terminates the record view and maintains the authenticated session or logs out the actor according to the overall session management rules."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): Actor is already authenticated when initiating access to the medical record. Condition: The actor has a valid active authenticated session when requesting to access the medical records area. Flow: Instead of submitting authentication credentials, the actor proceeds directly from the existing session to Step 3, where the system displays the medical records area according to the actor’s access rights.",
    "AF-2 (from Step 6): Actor switches to another authorized medical record during the same session. Condition: While viewing one medical record, the actor chooses another record that is also accessible. Flow: Actor selects a different accessible medical record from the selection mechanism → System re-evaluates access rights for the newly selected record using the included \"manage record access\" behavior, retrieves the corresponding medical record details, and displays them, after which the flow continues as described in Step 6 for the new record."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): Authentication fails. Condition: The actor provides invalid or insufficient authentication credentials. Flow: System rejects the authentication attempt, informs the actor that authentication failed without disclosing sensitive details, and does not proceed to Step 3. The actor may attempt authentication again according to system authentication policy or terminate the interaction.",
    "EF-2 (from Step 4): Actor selects a medical record the actor is not authorized to view. Condition: The actor attempts to open a medical record for which the included \"manage record access\" behavior determines that the actor lacks the required access rights. Flow: System denies access to the selected medical record, displays a generic access denied message without revealing confidential details, does not display any part of the record, and returns the actor to the selection mechanism from Step 3.",
    "EF-3 (from Step 5): Medical record retrieval fails. Condition: The system encounters an internal error or data retrieval problem when obtaining the selected medical record details. Flow: System does not display the medical record details, informs the actor that the record cannot be displayed due to a system error, and terminates the use case instance after logging the failure according to system error-handling policies.",
    "EF-4 (from Step 1): System is not reachable or is unavailable. Condition: The system cannot accept requests when the actor attempts to initiate access. Flow: The actor cannot proceed to authentication or record access; no medical record details are displayed, and the use case instance ends without achieving the goal."
  ],
  "information_for_steps": [
    "1. User identity indicator, device type information, initial request metadata.",
    "2. Authentication credentials, session identifier, authentication status.",
    "3. Actor role (patient, doctor, lab specialist), list of accessible medical record identifiers, basic record descriptors (such as patient identifier and summary metadata) filtered by access rights.",
    "4. Selected medical record identifier, actor role and identity, requested access type (view).",
    "5. Access control decision (authorized or not), access control rules applied, internal audit information related to the access attempt.",
    "6. Medical record details (clinical data, lab results, notes, and other record elements) formatted according to the actor’s permissions, presentation settings, and display context.",
    "7. Session state information, navigation state, and any internal logging of the end of the viewing action."
  ]
}