{
  "use_case_name": "Access Archive Interfaces",
  "unique_id": "UC-005",
  "area": "Research Data Archive Access and Integration",
  "context_of_use": "Depositors and developers interact with the research data archive through familiar web, institutional, workflow, and API-based interfaces to deposit and maintain datasets without needing to learn or install new software.",
  "scope": "Bath Research Data Archive System",
  "level": "User-goal",
  "primary_actors": [
    "depositor",
    "developer"
  ],
  "supporting_actors": [
    "Pure system",
    "Virtual Research Environment",
    "External workflow tool",
    "External client application using API"
  ],
  "stakeholders_and_interests": [
    "Depositor: Wants to access the archive through simple and familiar interfaces, including web, Pure, and workflow tools, to deposit and maintain datasets efficiently.",
    "Developer: Wants to access the archive via an API so that their services can programmatically deposit and maintain datasets.",
    "Bath Research Data Archive administrator: Wants interface access to support consistent interaction with the archive without compromising data quality or policy compliance.",
    "University IT services: Wants integrations to align with existing university systems to reduce support overhead and maintain a consistent technical environment.",
    "Funding bodies: Want researchers to have robust, usable archival access channels that support their compliance and impact requirements."
  ],
  "description": "This use case describes how depositors and developers access and interact with the Bath Research Data Archive through multiple supported interfaces, including a simple web interface, integration with Pure, integration with Virtual Research Environments and other workflow tools, and an API such as SWORD2, in order to deposit and maintain datasets using interfaces that are familiar to them.",
  "triggering_event": "The depositor or developer decides to interact with the Bath Research Data Archive in order to deposit or maintain datasets using a familiar interface.",
  "trigger_type": "External",
  "preconditions": [
    "The Bath Research Data Archive System is operational and reachable over the network.",
    "The depositor or developer has valid credentials for the chosen access interface where authentication is required.",
    "The chosen access interface (web interface, Pure, Virtual Research Environment, workflow tool, or API client) is available and correctly configured to communicate with the Bath Research Data Archive System.",
    "The depositor or developer has at least one dataset or dataset maintenance task that they intend to perform through the archive interfaces."
  ],
  "postconditions": [
    "The depositor or developer has successfully established interaction with the Bath Research Data Archive System through a selected interface.",
    "The chosen interface is perceived as familiar and consistent with the user’s existing tools or university systems, to the extent enabled by the archive.",
    "The archive has a record of the interface type used for the established interaction session."
  ],
  "assumptions": [
    "It is assumed that the Bath Research Data Archive System provides a web interface that can be accessed through a standard web browser without requiring additional client software installation.",
    "It is assumed that the Bath Research Data Archive System exposes integration endpoints or connectors that allow interaction from Pure as an institutional system.",
    "It is assumed that the Bath Research Data Archive System exposes integration endpoints or connectors that allow interaction from Virtual Research Environments and other workflow tools used by depositors.",
    "It is assumed that the Bath Research Data Archive System provides an API such as SWORD2 or a functionally equivalent protocol that enables programmatic deposit and maintenance of datasets by external services.",
    "It is assumed that authentication and authorization mechanisms for depositors and developers are already defined and implemented outside the scope of this use case, and this use case only relies on their existence.",
    "It is assumed that dataset deposit and maintenance operations themselves are specified in separate use cases, and this use case is limited to selection and establishment of archive access through different interfaces.",
    "It is assumed that the archive presents a user interface via web and integrations that is consistent with other University systems sufficiently to be perceived as familiar by depositors, without defining specific visual design rules in this use case.",
    "It is assumed that the API client used by the developer is responsible for correctly implementing the API protocol and handling any low-level network and format issues, while the archive only validates requests at the application level."
  ],
  "requirements_met": [
    "The system shall provide a simple web interface through which a depositor can deposit and maintain datasets without installing additional software.",
    "The system shall provide an interface for depositors that is consistent with the look and feel of other University systems so that depositors perceive the interfaces as familiar and joined up.",
    "The system shall integrate with Pure to allow depositors to deposit and maintain datasets via Pure as a single location for managing research outputs.",
    "The system shall allow depositors to deposit and maintain datasets through Virtual Research Environments and other workflow tools with which they are already familiar.",
    "The system shall provide an API, such as SWORD2 or an equivalent protocol, through which a developer’s service can deposit and maintain datasets in the archive.",
    "The system shall allow depositors to select between the web interface, Pure, and workflow tools as access channels for interacting with the archive.",
    "The system shall allow developers to configure and use external services that interact with the archive via the provided API."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The specific authentication and authorization mechanisms for each interface (web, Pure, Virtual Research Environments, workflow tools, and API) are not defined in this use case and require separate specification.",
    "The detailed technical integration method between the Bath Research Data Archive System and Pure has not been described and must be agreed with stakeholders and IT services.",
    "The scope of supported Virtual Research Environments and workflow tools is not bounded in this use case and requires a defined list or set of integration standards.",
    "The exact version and profile of the API protocol (e.g., SWORD2 version and supported extensions) are not specified and need to be formally defined.",
    "The degree and criteria of interface familiarity with other University systems (branding, navigation patterns, accessibility standards) are not fully articulated and need design guidelines.",
    "Non-functional requirements related to performance, availability, and security for each interface channel are not captured in this use case and must be documented separately."
  ],
  "main_flow": [
    "1. Depositor or developer initiates access to the Bath Research Data Archive through a chosen entry point (web URL, Pure, Virtual Research Environment, workflow tool, or API client) → System receives the incoming request and identifies the target as the Bath Research Data Archive System.",
    "2. Depositor or developer selects the preferred interface channel (simple web interface, Pure integration, Virtual Research Environment or other workflow tool integration, or API-based access) if more than one option is available within the entry point → System presents or activates the selected interface channel for interaction.",
    "3. Depositor uses the simple web interface or Pure or Virtual Research Environment or workflow tool to proceed to the dataset deposit and maintenance functions provided by the archive → System displays a user interface that is consistent with other University systems, showing the available dataset deposit and maintenance functions through the selected channel.",
    "4. Developer configures or uses an external client or service to connect to the archive’s API endpoint for dataset deposit and maintenance → System exposes the API endpoint and validates that the connection request conforms to the supported API protocol such as SWORD2.",
    "5. Depositor or developer confirms readiness to proceed with dataset deposit or maintenance operations via the chosen interface → System establishes an active interaction session through the selected interface and makes dataset deposit and maintenance operations available according to the user’s permissions."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): If the depositor or developer has only one interface channel available from the entry point, the system automatically selects that interface channel without requiring an explicit choice and continues at Step 3 for depositor interactions or Step 4 for developer API interactions as appropriate.",
    "AF-2 (from Step 3): If the depositor accesses the archive indirectly through Pure and is already authenticated in Pure, the system uses the existing Pure session to provide the familiar deposit and maintenance interface and then continues at Step 5.",
    "AF-3 (from Step 3): If the depositor accesses the archive through a Virtual Research Environment or other workflow tool, the system presents the archive interaction screens embedded or linked within the external tool while maintaining a familiar layout consistent with university systems and then continues at Step 5.",
    "AF-4 (from Step 4): If the developer’s service has a previously stored configuration for the API endpoint, the developer’s service initiates the connection using stored parameters and the system validates the existing configuration before proceeding directly to Step 5."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): If the Bath Research Data Archive System is unreachable when the depositor or developer attempts to access it, the system fails to establish a connection, returns an appropriate error message through the calling interface, and terminates the use case without establishing an interaction session.",
    "EF-2 (from Step 2): If the selected interface channel is temporarily unavailable, the system informs the depositor or developer that the selected interface cannot be used at this time, optionally lists any remaining available interfaces, and the use case ends unless the actor chooses to re-initiate access through another channel outside this execution.",
    "EF-3 (from Step 4): If the developer’s API request does not conform to the supported protocol or fails validation, the system rejects the request, returns an error response describing the validation failure, and does not establish an interaction session for dataset deposit or maintenance in this execution of the use case."
  ],
  "information_for_steps": [
    "1. Requested interface URL or endpoint, actor role (depositor or developer), network request metadata.",
    "2. Selected interface channel identifier (web interface, Pure integration, Virtual Research Environment integration, workflow tool integration, API access).",
    "3. User interface configuration data, university branding and layout settings, available dataset deposit and maintenance function identifiers.",
    "4. API endpoint URL, API protocol identifier (such as SWORD2), client credentials or tokens, request headers and basic configuration parameters.",
    "5. Session identifier, actor identity and role information, permitted dataset operations list associated with the established interaction session."
  ]
}