{
  "use_case_name": "Approve Data Disposal",
  "unique_id": "UC-014",
  "area": "Research Data Archiving and Preservation",
  "context_of_use": "This use case governs how the Bath Data Archive system enables a Bath Data Archive administrator to review and formally approve or reject previously scheduled data disposal actions in order to prevent destruction of datasets that are still required while allowing compliant disposal to proceed.",
  "scope": "Bath Data Archive system",
  "level": "User-goal",
  "primary_actors": [
    "bath data archive administrator"
  ],
  "supporting_actors": [
    "existing university storage systems"
  ],
  "stakeholders_and_interests": [
    "Bath Data Archive administrator: Wants to ensure that scheduled data disposals are appropriate so that data which is still required is not destroyed.",
    "Depositors and researchers: Want their archived datasets to be retained while required and only disposed of in line with agreed disposal policies and legal or contractual obligations.",
    "Data reusers: Want valuable datasets to remain available so that ongoing and future reuse is not prevented by premature disposal.",
    "Research Information manager: Wants the integrity and continuity of the archive holdings to support reporting on impact, compliance with funder requirements, and linkage to other research outputs.",
    "UnivITservice: Wants disposal approvals to be controlled so that storage usage is managed without risking unintended data loss.",
    "Funding bodies: Want assurance that research data archival and disposal follow robust plans so that funded research outputs remain accessible for appropriate periods.",
    "External collaborators and coordinators: Want assurance that data associated with collaborations is not destroyed prematurely in breach of collaboration agreements or IP-related constraints.",
    "Institution (University): Wants compliance with legal, regulatory, contractual, and internal policy requirements regarding data retention and disposal."
  ],
  "description": "The Bath Data Archive administrator reviews and decides on pending scheduled data disposal requests for archived datasets in order to authorise or reject each disposal so that required data is not destroyed.",
  "triggering_event": "The bath data archive administrator chooses to review scheduled data disposal actions in the Bath Data Archive system.",
  "trigger_type": "External",
  "preconditions": [
    "The Bath Data Archive system is operational and reachable via the administrator interface.",
    "The bath data archive administrator is authenticated and authorised to manage data disposal approvals in the Bath Data Archive system.",
    "At least one dataset in the Bath Data Archive has a disposal policy that can result in a scheduled disposal date.",
    "The system has generated one or more scheduled disposal items for archived data according to previously defined disposal policies."
  ],
  "postconditions": [
    "For each reviewed dataset, there is a recorded disposal decision (approved or rejected) associated with the scheduled disposal event in the Bath Data Archive system.",
    "For datasets with approved disposal, the system has marked them as authorised for disposal and is able to proceed with physical or logical deletion in accordance with existing storage and disposal mechanisms.",
    "For datasets with rejected disposal, the system has cancelled or postponed the pending disposal action so that the datasets are not disposed of at the scheduled time.",
    "The system has persisted an auditable record of the administrator’s disposal approval or rejection decisions, including relevant timestamps and identifiers."
  ],
  "assumptions": [
    "It is assumed that datasets can have a previously defined disposal policy and associated scheduled disposal dates managed by other use cases, as this use case only addresses approval of those scheduled disposals.",
    "It is assumed that the bath data archive administrator has already been provisioned with appropriate system credentials and permissions through existing identity and access management integrated with university systems such as LDAP, even though such integration is not described within this use case.",
    "It is assumed that the physical or logical deletion of data from existing university storage systems, including any object stores, is handled by underlying storage and archive mechanisms once disposal is approved, and that this use case is limited to authorisation or rejection of disposal.",
    "It is assumed that datasets subject to disposal may have legal, contractual, funder, or collaboration-agreement constraints that must be observed, and the administrator uses external guidance and policies to inform their decisions, as this use case does not add new policy evaluation capabilities.",
    "It is assumed that datasets to be disposed of are already stored on existing university storage systems that are part of the Bath Data Archive infrastructure, in line with the requirement to store archived data on existing storage systems.",
    "It is assumed that scheduled disposal items are visible to the bath data archive administrator in an interface that lists the datasets and their relevant disposal details, although the exact presentation and layout are outside the scope of this use case.",
    "It is assumed that the approval of data disposal may affect dataset access policies by making datasets unavailable after disposal, but this use case does not introduce new access control mechanisms beyond recording the disposal decision."
  ],
  "requirements_met": [
    "The system shall allow a Bath Data Archive administrator to view datasets that are scheduled for disposal before any destruction occurs.",
    "The system shall allow a Bath Data Archive administrator to approve scheduled disposal of data so that data disposal may proceed according to the defined disposal policy.",
    "The system shall allow a Bath Data Archive administrator to reject scheduled disposal of data so that data which is still required is not destroyed.",
    "The system shall record the outcome of each disposal decision (approved or rejected) together with the identity of the Bath Data Archive administrator and the decision timestamp.",
    "The system shall ensure that datasets with rejected disposal are not disposed of at the previously scheduled disposal time.",
    "The system shall ensure that datasets with approved disposal are flagged as authorised for disposal so that the underlying storage mechanisms may perform data deletion in accordance with configured retention and disposal processes."
  ],
  "priority": "High",
  "risk": "High",
  "outstanding_issues": [
    "The specific criteria and policies that the Bath Data Archive administrator must follow when deciding whether to approve or reject a scheduled data disposal are not fully defined and must be clarified by institutional policy owners.",
    "The required retention periods and legal or funder-imposed constraints for different categories of research data are not detailed and must be specified to guide disposal decisions.",
    "The precise timing and mechanism by which approved disposals are executed by underlying storage systems, including whether disposal is immediate or batched, is not described and requires definition.",
    "The process for modifying or rescheduling a dataset’s disposal policy after rejection of a scheduled disposal is not defined and may need to be covered by a separate use case or administrative procedure.",
    "The requirements for notification (e.g., whether depositors or other stakeholders are informed of impending or approved disposals) are not specified and must be determined.",
    "The required level of audit detail and retention period for disposal decision logs, for compliance and accountability purposes, is not described and must be agreed."
  ],
  "main_flow": [
    "1. Bath data archive administrator selects the option to review scheduled data disposals in the Bath Data Archive system interface → System displays a list of datasets with pending scheduled disposal events and key details for each dataset and its disposal schedule.",
    "2. Bath data archive administrator selects a specific dataset from the list to review its scheduled disposal → System presents detailed information about the selected dataset, including its identifier, summary metadata, scheduled disposal date, and configured disposal policy.",
    "3. Bath data archive administrator reviews the presented dataset and disposal details in order to determine whether the dataset should be disposed of as scheduled → System keeps the dataset’s disposal review screen active and ensures that the information required for decision-making remains available.",
    "4. Bath data archive administrator chooses to approve the scheduled disposal for the selected dataset → System records the approval decision for the dataset’s scheduled disposal, including the administrator’s identity and the decision timestamp.",
    "5. Bath data archive administrator confirms the approval decision as requested by the system → System marks the dataset as authorised for disposal, updates its disposal status accordingly, and ensures that it is queued or flagged for deletion by the underlying storage mechanisms in accordance with the defined disposal process.",
    "6. Bath data archive administrator repeats the review and approval process for any additional datasets with scheduled disposals that they wish to process during this session → System applies each recorded approval decision to the corresponding dataset and maintains an updated list of remaining pending scheduled disposals.",
    "7. Bath data archive administrator ends the disposal approval session → System finalises the session state, preserves all disposal decision records made during the session, and returns to the administrator’s main interface."
  ],
  "alternative_flows": [
    "AF-1 (from Step 4): Bath data archive administrator decides to reject the scheduled disposal for the selected dataset instead of approving it and selects the reject option → System records a rejection decision for the dataset’s scheduled disposal, including the administrator’s identity and the decision timestamp, cancels or postpones the pending disposal action so that the dataset will not be disposed of at the current scheduled time, updates the dataset’s disposal status to indicate rejection, and returns the bath data archive administrator to the list of datasets with pending scheduled disposals so they may continue with Step 6.",
    "AF-2 (from Step 2): Bath data archive administrator identifies that no further detailed review of the currently selected dataset is required and returns directly to the list of pending scheduled disposals without making a disposal decision → System discards any unsaved changes related to the currently viewed dataset’s disposal review, leaves the existing disposal schedule unchanged, and returns the bath data archive administrator to the list of datasets with pending scheduled disposals so they may proceed with Step 2 for another dataset or continue to Step 7 to end the session."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): System is unable to retrieve the list of datasets with pending scheduled disposal events due to a temporary system or storage error → System displays an error message indicating that scheduled disposals cannot be loaded at this time, logs the error for operational follow-up, and instructs the bath data archive administrator to retry later, after which the use case terminates without any disposal decisions being made.",
    "EF-2 (from Step 2): The selected dataset’s detailed information cannot be loaded because the dataset metadata or disposal record is missing or corrupted → System displays an error message indicating that the dataset details for disposal review are unavailable, logs the inconsistency for administrative investigation, returns the bath data archive administrator to the list of datasets with pending scheduled disposals, and excludes the problematic dataset from further disposal approval until the issue is resolved, while allowing the administrator to continue with Step 2 for other datasets.",
    "EF-3 (from Step 5): System fails to persist the approval decision for the scheduled disposal due to a database or storage write error → System displays an error message indicating that the approval decision could not be saved, rolls back any partial changes to the dataset’s disposal status so that no unintended disposal occurs, logs the failure for later resolution, and returns the bath data archive administrator to the dataset’s disposal review screen with the decision not recorded, allowing the administrator to retry Step 4 and Step 5 or navigate back to the list of pending disposals."
  ],
  "information_for_steps": [
    "1. Scheduled disposal list data including dataset identifiers, dataset titles, depositor identifiers, scheduled disposal dates, and current disposal statuses.",
    "2. Selected dataset details including dataset identifier, descriptive metadata summary, depositor information, scheduled disposal date and time, disposal policy reference, and any associated project or funder identifiers relevant to disposal.",
    "3. Dataset review information including dataset metadata, disposal policy information, scheduled disposal timing, and any linked indicators that the dataset may still be required according to external policies or agreements.",
    "4. Disposal decision data including chosen action (approve disposal), administrator identifier, decision timestamp, and any optional decision rationale captured by the system if configured.",
    "5. Disposal authorisation status update including dataset identifier, updated disposal status value indicating authorisation, linkage to underlying disposal process, administrator identifier, and confirmation of the time at which the approval was recorded.",
    "6. Batch review tracking data including the set of datasets processed during the session, their respective disposal decision outcomes, and an updated subset of datasets that still have pending scheduled disposals.",
    "7. Session closure information including summary of disposal decisions executed during the session and administrative interface state required to return the bath data archive administrator to the main administration dashboard."
  ]
}