{
  "use_case_name": "View Medical Record",
  "unique_id": "UC-006",
  "area": "Electronic Medical Record Access",
  "context_of_use": "The patient uses the hospital management system to access and view permitted parts of their electronic medical record and available test results, including from mobile devices, in accordance with configured privacy and data management rules.",
  "scope": "Hospital Management System",
  "level": "User-goal",
  "primary_actors": [
    "patient"
  ],
  "supporting_actors": [
    "system administrator"
  ],
  "stakeholders_and_interests": [
    "Patient: Wants convenient, secure access to permitted medical information and test results, including from mobile devices.",
    "System administrator: Wants patient access to be limited to authorized, hospital-allowed parts of the electronic medical record and compliant with implemented GDPR standards.",
    "Doctor: Wants sensitive medical information to be restricted from patients when not intended for them to minimize security risks.",
    "Systems analyst: Wants underlying clinical data to remain available in anonymized form for analytics without compromising patient privacy.",
    "Hospital management: Wants centralized, accurate electronic medical records that are accessible to patients in a controlled and secure manner."
  ],
  "description": "This use case enables a patient to log into the hospital management system and view hospital-allowed parts of their electronic medical record and test results, including from mobile devices, while enforcing configured data privacy and medical data management rules.",
  "triggering_event": "The patient decides to view their electronic medical record or test results using the hospital management system.",
  "trigger_type": "External",
  "preconditions": [
    "The patient has a valid personal user account registered in the hospital management system.",
    "The patient has successfully authenticated to the hospital management system prior to viewing their medical record.",
    "The patient’s electronic medical record data is stored in the central database of the hospital management system.",
    "Access control rules and GDPR-compliant data protection settings have been configured by the system administrator.",
    "The system has established a secure connection suitable for transmitting protected health information."
  ],
  "postconditions": [
    "The patient has been presented with the parts of their electronic medical record that the hospital allows them to access.",
    "The patient has been able to view any test results that are available and permitted for patient viewing.",
    "No information that is restricted from the patient has been displayed.",
    "All accesses to the patient’s electronic medical record have been processed according to configured privacy and medical data management rules."
  ],
  "assumptions": [
    "It is assumed that the hospital management system already implements user login and authentication, as implied by the requirement that system access is limited to authorized users who must log in to personal accounts.",
    "It is assumed that access levels and restrictions to parts of the electronic medical record are preconfigured by system administrators and doctors, consistent with requirements to grant different access levels and to restrict patients from viewing information not intended for them.",
    "It is assumed that GDPR standards and anonymization rules are enforced by the system for all data access operations, including patient self-access, as implied by system administrator requirements to implement GDPR standards and anonymize data viewed by systems analysts.",
    "It is assumed that electronic medical records and test results are stored centrally in the hospital’s database and are integrated within the management system, as implied by requirements to store all data in a central database and to integrate electronic medical records with the management system.",
    "It is assumed that mobile device access uses the same authorization and access control rules as access from a personal computer, as implied by the requirement that patients can view their electronic medical record on a mobile device and that doctors have consistent functionality across devices.",
    "It is assumed that the included use case \"enforce data privacy\" corresponds to applying already configured access control, restriction, and GDPR rules during record viewing, without introducing any additional privacy functionality.",
    "It is assumed that the included use case \"manage medical data\" corresponds to retrieving and presenting already stored and integrated medical record data and test results from the central database, without adding any new data manipulation capabilities.",
    "It is assumed that test results are marked as available in the electronic medical record by clinical workflows external to this use case before being presented to the patient."
  ],
  "requirements_met": [
    "The system shall allow a patient to access the parts of their electronic medical record that the hospital allows so that the patient can view their medical information.",
    "The system shall allow a patient to view their test results once the results are available so that the patient is informed about their health status.",
    "The system shall allow a patient to access and view their electronic medical record on a mobile device so that the patient can view their data anywhere.",
    "The system shall restrict patients from viewing information within the electronic medical record that is not intended for them, as configured by authorized personnel, so that security risks are minimized.",
    "The system shall enforce access level configurations defined by the system administrator when a patient views their electronic medical record so that functionalities and data visibility are restricted appropriately.",
    "The system shall implement GDPR standards when presenting electronic medical record data to a patient so that stored data is protected.",
    "The system shall retrieve patient electronic medical record data and test results from the central database integrated with the management system when a patient requests to view their record."
  ],
  "priority": "High",
  "risk": "High",
  "outstanding_issues": [
    "The exact granularity and configuration method for specifying which parts of the electronic medical record the hospital allows patients to view is not defined.",
    "The policy for when test results become \"available\" for patient viewing, including any required approval or delay, is not specified.",
    "The session timeout and re-authentication requirements for patients viewing sensitive medical information are not described.",
    "The required level of audit logging for patient access to the electronic medical record, such as which fields are logged and retention periods, is not defined.",
    "The precise behavior and messaging when access to certain medical record sections is restricted for a patient is not specified."
  ],
  "main_flow": [
    "1. Patient initiates access to their electronic medical record from a personal computer or mobile device → System presents an option to view the electronic medical record after confirming the patient is logged in.",
    "2. Patient selects the option to view their electronic medical record → System invokes configured data privacy controls to determine which parts of the electronic medical record are permitted for this patient account based on access levels and restrictions.",
    "3. Patient continues the request to view their electronic medical record → System retrieves the patient’s electronic medical record data and available test results from the central database using the integrated medical record management functions.",
    "4. Patient waits while the system processes the request → System filters the retrieved electronic medical record data so that only hospital-allowed sections and test results intended for the patient are included in the response.",
    "5. Patient views the displayed electronic medical record overview on the chosen device → System presents the permitted sections of the electronic medical record, including available test results, in a readable format suitable for the device type.",
    "6. Patient optionally navigates within the presented record, such as opening detailed views of visits, diagnoses, or test results → System displays the requested detailed information only for sections that remain permitted under the applied access control and privacy rules.",
    "7. Patient finishes reviewing their electronic medical record → System maintains the applied privacy and data management controls for the duration of the session and remains ready for further permitted navigation or logout."
  ],
  "alternative_flows": [
    "AF-1 (from Step 1): Patient starts access from a mobile device. Condition: The patient uses a mobile device application or mobile browser to initiate access to the electronic medical record. The system adapts the user interface and presentation format to the mobile device while performing the same privacy enforcement (Step 2) and data retrieval (Step 3) actions. The flow then continues with Step 5.",
    "AF-2 (from Step 5): Patient chooses to focus only on test results. Condition: At the overview screen, the patient selects a specific option to view only available test results. The system filters the permitted data to show only test result entries and displays them in a dedicated test-results view while still enforcing the same access control and privacy rules. The flow then continues with Step 7 after the patient has finished reviewing the test results."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): Patient is not authenticated. Condition: The patient attempts to initiate access to the electronic medical record without having an active authenticated session. The system detects the lack of authentication, does not display any medical information, and requires the patient to log in via the existing login mechanism before Step 1 can be retried.",
    "EF-2 (from Step 2): No sections are permitted for viewing. Condition: Privacy configuration and access level restrictions result in no parts of the electronic medical record being available for the patient to view. The system displays a message indicating that no medical record information is currently accessible to the patient and does not proceed to data retrieval. The use case ends without displaying record data.",
    "EF-3 (from Step 3): Medical record data cannot be retrieved. Condition: The system cannot retrieve the patient’s electronic medical record or test results from the central database due to a data access failure. The system logs the failure according to existing logging policies, informs the patient that the record cannot be displayed at this time, and terminates the use case without revealing any partial or inconsistent medical information.",
    "EF-4 (from Step 6): Patient attempts to navigate to a restricted section. Condition: While viewing permitted information, the patient selects a link or section that is restricted for their access level. The system prevents access to the restricted content, displays an appropriate access-denied message, and keeps the patient within the permitted parts of the record. The flow then returns to Step 5."
  ],
  "information_for_steps": [
    "1. Patient identifier, device type, session identifier.",
    "2. Patient identifier, configured access level, privacy and restriction rules.",
    "3. Patient identifier, electronic medical record data, test result records, central database connection parameters.",
    "4. Retrieved medical record entries, retrieved test result entries, access control filter criteria.",
    "5. Filtered medical record summary data, filtered test result summaries, presentation layout for device type.",
    "6. Selected record section identifier, detailed medical record entry data, detailed test result data, current access permissions.",
    "7. Session identifier, displayed data categories, applied privacy rules reference."
  ]
}