{
  "use_case_name": "Share Wearable Data",
  "unique_id": "UC-009",
  "area": "Patient Health Data Management",
  "context_of_use": "A patient uses the mobile-accessible healthcare system to share health data collected from their wearable device with designated healthcare professionals while maintaining control over access to their medical data.",
  "scope": "Healthcare Patient Portal System",
  "level": "User-goal",
  "primary_actors": [
    "patient"
  ],
  "supporting_actors": [
    "healthcare professional"
  ],
  "stakeholders_and_interests": [
    "Patient: Wants to share health data collected from wearable devices with healthcare professionals while retaining control over who can access their medical data.",
    "Healthcare professional: Wants timely access to patient wearable data to support clinical assessment and decision-making.",
    "Healthcare organization: Wants accurate and up-to-date patient data to improve quality of care and operational efficiency.",
    "Security and compliance: Requires that access to wearable data and medical data is properly authenticated and access-controlled."
  ],
  "description": "This use case describes how a patient shares health data collected from their wearable device with healthcare professionals through the healthcare patient portal system, including authentication and access control to ensure that only authorized healthcare professionals can view the shared data.",
  "triggering_event": "The patient decides to share wearable-device health data with one or more healthcare professionals using the healthcare patient portal system.",
  "trigger_type": "External",
  "preconditions": [
    "The patient has an active customer account in the healthcare patient portal system.",
    "The patient has successfully registered at least one compatible wearable device that is capable of providing health data to the system.",
    "The healthcare patient portal system is operational and reachable from the patient’s mobile device.",
    "Relevant healthcare professionals exist in the system and can be selected as recipients for shared data."
  ],
  "postconditions": [
    "The patient’s selected wearable health data is stored in the system in association with the patient’s medical data.",
    "The system has recorded that specific healthcare professionals are authorized to access the shared wearable health data.",
    "Authorized healthcare professionals can retrieve and review the shared wearable health data through their own system access according to configured access rights.",
    "The system has logged the sharing action for audit and traceability purposes."
  ],
  "assumptions": [
    "It is assumed that the wearable device is already paired or integrated with the healthcare patient portal system and that data can be retrieved from the wearable without additional system functionality beyond what is implied by the requirement to collect data through wearable devices.",
    "It is assumed that healthcare professionals referenced in the requirement are already registered users within the broader healthcare system, even though they are not listed as actors in this specific input; they are treated as recipients of shared data rather than active initiators in this use case.",
    "It is assumed that the included relationship \"authenticate and control access\" refers to the patient logging in and setting or confirming access rights before sharing wearable data, and that this is implemented as part of the main flow without adding capabilities beyond authentication and access control.",
    "It is assumed that patients can select which healthcare professionals will be allowed to access the shared wearable data, consistent with the stated need to control who has access to their medical data.",
    "It is assumed that the mobile device used by the patient provides a secure connection to the healthcare patient portal system.",
    "It is assumed that only data explicitly shared by the patient in this use case becomes accessible to the designated healthcare professionals under the configured access control settings."
  ],
  "requirements_met": [
    "The system shall enable a patient to share data collected through their wearable device or devices with healthcare professionals.",
    "The system shall require the patient to authenticate before sharing wearable data with healthcare professionals.",
    "The system shall enable a patient to control which healthcare professionals have access to their shared wearable data.",
    "The system shall store the shared wearable data in association with the patient’s medical data in the patient portal.",
    "The system shall make the shared wearable data available for access by authorized healthcare professionals according to the patient’s access control configuration.",
    "The system shall record an audit trail entry whenever a patient shares wearable data with healthcare professionals, including timestamp and selected recipients."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The granularity of access control for wearable data (for example, per-data-type, per-time-range, or all-or-nothing) has not been specified and requires clarification.",
    "The frequency and mechanism by which wearable data is synchronized with the system (real-time streaming versus periodic uploads) has not been defined.",
    "The maximum retention period and data lifecycle policies for shared wearable data are not specified and must be determined in accordance with organizational and regulatory requirements.",
    "The specific categories of healthcare professionals who may be selected as recipients of shared wearable data (for example, only assigned doctors versus any clinician in the organization) require policy definition.",
    "The behavior of the system when a healthcare professional’s account is deactivated or their role changes with respect to previously granted access to wearable data is not specified."
  ],
  "main_flow": [
    "1. Patient initiates sharing wearable data from their mobile device by selecting the option to share wearable data with healthcare professionals → System displays the patient authentication interface as part of the included \"authenticate and control access\" functionality.",
    "2. Patient provides valid authentication credentials using the mobile interface → System verifies the credentials and establishes an authenticated session for the patient.",
    "3. Patient navigates to the wearable data sharing function and requests to manage sharing of wearable data → System retrieves available wearable devices and associated health data linked to the patient account and displays the list of wearable data available for sharing.",
    "4. Patient selects the specific wearable device data or data categories to be shared → System marks the selected wearable data items as candidates for sharing and displays the current access control options for these data items.",
    "5. Patient selects one or more healthcare professionals who should be granted access to the selected wearable data → System validates the selected healthcare professionals against existing users and displays a confirmation of the selected recipients.",
    "6. Patient confirms the sharing configuration, including selected wearable data and selected healthcare professionals, and submits the sharing request → System records the sharing configuration by associating the selected wearable data with the patient’s medical data and updating access control rules to grant access to the selected healthcare professionals.",
    "7. Patient reviews the confirmation message shown on the mobile device → System displays a confirmation indicating that the selected wearable data has been successfully shared with the specified healthcare professionals and logs the sharing event for audit purposes."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): Patient is already authenticated when initiating sharing from within an existing session, so no additional login is required → System detects an active authenticated session for the patient, skips re-authentication, and proceeds directly to retrieve available wearable devices and associated health data as described in Step 3.",
    "AF-2 (from Step 4): Patient chooses to share all currently available wearable data instead of selecting specific subsets → System interprets the choice as selection of all available wearable data linked to the patient account and proceeds to display access control options for the complete wearable data set before continuing with Step 5.",
    "AF-3 (from Step 5): Patient decides to modify previously configured recipients for existing shared wearable data instead of defining new recipients → System displays the list of healthcare professionals who currently have access to the selected wearable data, allows the patient to adjust the list by adding or removing professionals, and after confirmation proceeds with updating access control rules as in Step 6."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): Patient provides invalid authentication credentials → System rejects the authentication attempt, displays an error message indicating that the login failed, may allow the patient to retry authentication according to security policies, and does not permit access to the wearable data sharing function until valid credentials are provided; the use case terminates if authentication is not eventually successful.",
    "EF-2 (from Step 3): No wearable devices or wearable data are available for the patient account → System informs the patient that no wearable data is currently available for sharing and provides an informational message about the absence of data; the use case ends without recording any shared data or access control changes.",
    "EF-3 (from Step 5): Selected healthcare professionals cannot be validated in the system (for example, due to incorrect selection or missing records) → System displays an error message identifying which selections are invalid, prevents confirmation of the sharing configuration, and prompts the patient to adjust the selection of healthcare professionals before returning to Step 5; if the patient cancels, the use case ends without sharing data.",
    "EF-4 (from Step 6): System fails to persist sharing configuration due to technical error (such as database failure or connectivity issue) → System displays an error message stating that the wearable data could not be shared at this time, rolls back any partial updates to access control or data associations, logs the failure event, and terminates the use case without granting access to wearable data."
  ],
  "information_for_steps": [
    "1. Patient identifier, mobile device session information, share wearable data request type.",
    "2. Patient authentication credentials, authentication token, session identifier.",
    "3. List of registered wearable devices, wearable device identifiers, available wearable health data metadata, patient account identifier.",
    "4. Selected wearable device identifiers, selected wearable data types or data categories, timestamp of selection.",
    "5. List of available healthcare professionals, identifiers of selected healthcare professionals, validation status for each selected professional.",
    "6. Sharing configuration details, mappings between patient identifier, wearable data identifiers, and healthcare professional identifiers, updated access control rules, audit log entry data.",
    "7. Confirmation message content, sharing result status, audit trail reference identifier."
  ]
}