{
  "use_case_name": "Control Device Authorization",
  "unique_id": "UC-011",
  "area": "Patient Privacy and Device Integration",
  "context_of_use": "The use case enables a patient to control whether an external device may be linked to the patient’s medical record and to configure which parties are permitted to view data generated by such devices, while operating within an authenticated session of the medical record system.",
  "scope": "Medical Record Management System",
  "level": "User-goal",
  "primary_actors": [
    "patient"
  ],
  "supporting_actors": [
    "authenticate"
  ],
  "stakeholders_and_interests": [
    "Patient: Wants to maintain confidentiality of the medical record and control which external devices are linked and who can see the generated data.",
    "Healthcare providers (including doctors, lab specialists, nurses, receptionists as organizational roles): Want access to relevant and authorized external device data to support diagnosis and treatment, while complying with patient privacy preferences.",
    "Healthcare organization: Wants the system to enforce patient confidentiality, comply with data protection regulations, and provide clear auditability of device authorizations and data access permissions.",
    "System administrator: Wants clear, enforceable rules for device linkage and data visibility to minimize misconfiguration and security incidents."
  ],
  "description": "This use case describes how a patient, after authenticating, grants or rejects authorization to link an external device to the patient’s medical record and configures which parties are allowed to view the data generated by the authorized external devices, thereby enforcing patient privacy and confidentiality preferences.",
  "triggering_event": "The patient decides to manage external device linkage or viewing permissions for data generated by external devices associated with the patient’s medical record.",
  "trigger_type": "External",
  "preconditions": [
    "The patient has a registered user account in the Medical Record Management System.",
    "The patient has access to a compatible client (such as mobile phone, tablet, or computer) with network connectivity to the system.",
    "The authentication functionality included by this use case is available and operational.",
    "At least one type of external device is supported by the Medical Record Management System for potential linkage to a medical record."
  ],
  "postconditions": [
    "The system has stored the patient’s explicit authorization decision for each processed external device (granted or rejected) in association with the patient’s medical record.",
    "The system has stored the patient’s configured viewing permissions that specify which parties are allowed to see external device–generated data associated with the patient’s medical record.",
    "Subsequent access to external device–generated data by system users is constrained according to the patient’s stored authorization and viewing permission settings."
  ],
  "assumptions": [
    "It is assumed that the Medical Record Management System already implements an authentication mechanism corresponding to the included \"authenticate\" use case, and this use case reuses that mechanism without modifying its behavior.",
    "It is assumed that external devices can be uniquely identified within the Medical Record Management System for the purpose of managing authorization (for example by a device identifier provided during configuration), although the exact identification mechanism is outside the scope of this use case.",
    "It is assumed that the set of potential viewers of external device data (such as doctors, lab specialists, or other organizational roles) is predefined by the system configuration, and this use case allows the patient to select from that predefined set without creating new types of viewers.",
    "It is assumed that granting authorization to link an external device only permits the system to receive and associate data from that device with the patient’s medical record and does not automatically grant any additional access rights beyond those explicitly configured by the patient for viewing the generated data.",
    "It is assumed that rejecting authorization to link an external device prevents the system from establishing or maintaining an active linkage for that specific device and prevents future data from that device from being associated with the patient’s medical record.",
    "It is assumed that changes to authorization and viewing permissions take effect for subsequent data access and device linkage operations and do not retroactively alter completed access events, although historical access remains subject to audit outside the scope of this use case."
  ],
  "requirements_met": [
    "The system shall allow a patient to explicitly grant authorization to link an external device, such as a fitness band, to the patient’s medical record.",
    "The system shall allow a patient to explicitly reject authorization to link an external device, such as a fitness band, to the patient’s medical record.",
    "The system shall, based on the patient’s authorization decision, either enable or prevent the linkage of the selected external device to the patient’s medical record.",
    "The system shall allow a patient to configure who is permitted to view data generated by authorized external devices linked to the patient’s medical record.",
    "The system shall enforce the patient’s configured viewing permissions when any party attempts to view data generated by external devices associated with the patient’s medical record.",
    "The system shall require the patient to be authenticated, via the included authentication functionality, before allowing the patient to grant or reject device linkage or to configure viewing permissions for external device–generated data."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The specific granularity of viewing permissions (for example, per device type, per individual device, per data category, or per individual healthcare provider) has not been defined and requires a policy decision.",
    "The default authorization state for new external devices (for example, default denied until explicitly granted) has not been specified and requires a security and privacy policy decision.",
    "The retention and handling policy for historical device data when a patient later revokes authorization or restricts viewing permissions is not defined and requires clarification.",
    "The required user interface mechanisms for presenting device options and viewer categories to the patient, including usability and accessibility requirements, remain unspecified.",
    "The frequency and method for informing patients about the current list of authorized devices and configured viewing permissions (for example, periodic reminders or notifications) is not defined."
  ],
  "main_flow": [
    "1. Patient initiates device authorization management from the system’s interface → System invokes the included authentication functionality to verify the patient’s identity.",
    "2. Patient provides required authentication credentials according to the authentication process → System validates the credentials and establishes an authenticated session for the patient.",
    "3. Patient requests to manage external device settings for the patient’s medical record → System displays the patient’s external device management page, showing available external devices and their current authorization status related to the patient’s medical record.",
    "4. Patient selects an external device for which to set or change the linkage authorization → System highlights the selected device and displays its current authorization state and a control to grant or reject authorization.",
    "5. Patient chooses to grant authorization for the selected external device to be linked to the patient’s medical record and confirms the choice → System records the granted authorization for the selected device in association with the patient’s medical record and updates the device’s status to authorized.",
    "6. Patient chooses to configure who may view data generated by the authorized external device → System displays the available viewer categories or parties predefined by the system and the current viewing permissions for the selected device or device data.",
    "7. Patient selects the desired viewers who are permitted to see the data generated by the authorized external device and confirms the selection → System stores the patient’s viewing permission configuration for the selected device or device data and updates the access control rules accordingly.",
    "8. Patient reviews a summary of current external device authorizations and viewing permissions and chooses to complete the management session → System presents a confirmation message indicating that the patient’s device authorization and viewing permission settings have been successfully updated and keeps the configurations available for subsequent enforcement."
  ],
  "alternative_flows": [
    "AF-1 (from Step 5): Patient chooses to reject authorization instead of granting it for the selected external device. Condition: At Step 5, the patient decides that the external device must not be linked to the medical record. Flow: Patient chooses to reject authorization for the selected external device and confirms the choice → System records the rejected authorization state for the selected device in association with the patient’s medical record and updates the device’s status to unauthorized → Flow continues with Step 8, where the patient can review the updated summary.",
    "AF-2 (from Step 6): Patient skips configuring viewing permissions for the selected device. Condition: At Step 6, the patient decides to use existing default viewing permissions without modification. Flow: Patient chooses not to change any viewing permissions and proceeds without making selections → System retains the current or default viewing permissions for the selected device and indicates that existing permissions remain in effect → Flow continues with Step 8, where the patient reviews the overall configuration.",
    "AF-3 (from Step 3): Patient manages multiple external devices in a single session. Condition: At Step 3, multiple devices are listed and the patient intends to configure more than one. Flow: Patient selects a device and completes Steps 4 through 7 for that device → System saves the configuration for that device and redisplays the device list → Patient selects another device and repeats Steps 4 through 7 as needed → After finishing configuration for all desired devices, flow proceeds to Step 8 for final review."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): Authentication fails. Condition: The patient provides invalid or incomplete authentication credentials. Flow: System rejects the authentication attempt, informs the patient that authentication has failed, and may present an option to retry the authentication process in accordance with the included authentication use case → The device authorization management process is not initiated, and no changes are made to authorization or viewing permissions for external devices.",
    "EF-2 (from Step 3): External device information cannot be retrieved. Condition: The system is temporarily unable to access the list of external devices or their current authorization states. Flow: System displays an error message indicating that external device information is temporarily unavailable and advises the patient to try again later → The system prevents further steps related to device authorization and viewing permission configuration during this attempt and maintains existing settings unchanged.",
    "EF-3 (from Step 7): Saving viewing permission configuration fails. Condition: A system error occurs while storing the patient’s updated viewing permissions. Flow: System notifies the patient that saving the configuration has failed and indicates that previously stored viewing permissions remain in effect → System logs the error for administrative review and prevents progression to Step 8 for a successful summary until the configuration can be saved in a subsequent attempt."
  ],
  "information_for_steps": [
    "1. Patient identity reference, authentication invocation request.",
    "2. Authentication credentials (for example, username and password or DigiD token reference), authentication result status.",
    "3. Patient identifier, list of supported external devices, current authorization status per device.",
    "4. Selected device identifier, current authorization state for the selected device.",
    "5. Patient authorization decision (grant), timestamp of decision, linkage status for selected device.",
    "6. Selected device identifier, list of predefined viewer categories or parties, current viewing permissions associated with the device.",
    "7. Patient-selected viewers permitted to access external device data, updated access control rules, timestamp of configuration.",
    "8. Summary of device authorization states and viewing permissions per device, confirmation message details."
  ]
}