{
  "use_case_name": "Manage Device Data",
  "unique_id": "UC-010",
  "area": "Medical Record Device Data Management",
  "context_of_use": "This use case describes how authenticated patients and doctors manage data and results originating from external and fitness devices within the medical record, including required prior device linking and authorization.",
  "scope": "Digital Medical Record System",
  "level": "User-goal",
  "primary_actors": [
    "patient",
    "doctor"
  ],
  "supporting_actors": [],
  "stakeholders_and_interests": [
    "patient: Wants to upload fitness data, see external device results, and control which device data appears in the medical record in order to monitor personal progress and maintain privacy.",
    "doctor: Wants to view and manually enter external device results into the patient medical record in order to have consolidated and up-to-date clinical information.",
    "system owner: Wants consistent and secure handling of external and fitness device data to support availability, confidentiality, and integrity requirements.",
    "regulatory bodies: Require that medical and device data be handled in a way that preserves patient confidentiality and traceability."
  ],
  "description": "Allows authenticated patients and doctors to manage data from external and fitness devices in the digital medical record, including performing prerequisite authentication, device linking, and authorization control, and then uploading, entering, and viewing device-generated results.",
  "triggering_event": "A patient or doctor decides to manage external or fitness device data associated with a patient medical record.",
  "trigger_type": "External",
  "preconditions": [
    "The Digital Medical Record System is operational and accessible.",
    "The primary actor has network access to the Digital Medical Record System.",
    "The primary actor has valid credentials that can be used for authentication.",
    "The patient medical record to which device data will be associated already exists in the system."
  ],
  "postconditions": [
    "The relevant external or fitness device data have been stored in association with the appropriate patient medical record.",
    "Authorized actors can subsequently view the stored external or fitness device data as part of the medical record.",
    "All successful uploads or manual entries of device data are recorded in the system with sufficient information to support later retrieval."
  ],
  "assumptions": [
    "It is assumed that the \"authenticate\" included use case represents an existing system capability that verifies the identity of the doctor or patient using unique login credentials or DigiD without defining new authentication mechanisms.",
    "It is assumed that the \"link external devices\" included use case represents an existing system capability that establishes a technical association between an external or fitness device and the patient medical record without adding new device types beyond those implied (e.g., fitness bands, blood pressure monitors, CT scanners).",
    "It is assumed that the \"control device authorization\" included use case represents an existing system capability that allows the patient to grant or revoke authorization for external or fitness devices to send data to the medical record and to determine which users may see that device data.",
    "It is assumed that only one patient medical record context is active during a single execution of this use case and that all device data managed in the main flow is associated with that active medical record.",
    "It is assumed that storage, formatting, and unit conversion of device data are handled by existing system mechanisms and are not altered by this use case.",
    "It is assumed that when the doctor performs manual entry of external device results, the doctor is already assigned to the relevant patient medical record according to existing assignment rules defined outside this use case.",
    "It is assumed that when the patient uploads fitness data, the data originate from a previously linked fitness device or from data files produced by such a device, consistent with the included linking and authorization functionality."
  ],
  "requirements_met": [
    "The system shall allow a patient to upload fitness data to the software so that doctors can have more information about the patient's daily life.",
    "The system shall allow a patient to view results from external devices, such as blood pressure monitors and CT scanners, in order to monitor progress over time.",
    "The system shall allow a doctor to manually enter results from external devices into the patient medical record when automatic linking or the external device malfunctions.",
    "The system shall require that the user be authenticated before managing external or fitness device data associated with a medical record.",
    "The system shall require that external or fitness devices be linked to the software before device-generated data can be uploaded automatically to the medical record.",
    "The system shall require that device data transfer and visibility comply with the patient's device authorization and privacy controls before displaying device results.",
    "The system shall associate all uploaded or entered device data with the correct patient medical record so that the data are available in a consolidated form."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The specific formats and file types supported for fitness data uploads by patients are not defined and require clarification.",
    "The rules for how long external and fitness device data must be retained in the medical record are not specified and require a retention policy decision.",
    "The exact granularity of patient control over which actors may view specific device data (for example per device type or per measurement) is not defined and requires a privacy policy decision.",
    "The conflict resolution behavior when device data authorization is revoked after data have already been stored (for example whether data are hidden or removed) is not specified.",
    "The maximum volume and frequency of device data uploads and manual entries supported by the system are not defined and may impact performance and storage planning."
  ],
  "main_flow": [
    "1. patient or doctor → The system prompts the actor to authenticate in order to access medical record and device data management functions.",
    "2. patient or doctor → The system executes the included \"authenticate\" functionality and confirms successful authentication, establishing a session for the actor.",
    "3. patient or doctor → The system allows the actor to select or confirm the patient medical record for which device data will be managed and displays the current medical record overview.",
    "4. patient or doctor → The system executes the included \"link external devices\" functionality as needed, ensuring that the relevant external or fitness device is linked to the selected patient medical record.",
    "5. patient or doctor → The system executes the included \"control device authorization\" functionality as needed, ensuring that current patient authorization settings for device data transfer and visibility are applied.",
    "6. patient → The system provides an option to upload fitness data associated with the linked fitness device and prompts the patient to provide the fitness data.",
    "7. patient → The system receives the fitness data, associates it with the selected patient medical record, and stores it as part of the device data section of the record.",
    "8. doctor → The system provides an option for the doctor to manually enter results from an external device for the selected patient medical record.",
    "9. doctor → The system receives the manually entered external device results, validates the entered values syntactically, and stores them in association with the selected patient medical record.",
    "10. patient or doctor → The system displays the consolidated external and fitness device data associated with the selected patient medical record, including the newly uploaded or manually entered data where authorized.",
    "11. patient or doctor → The system confirms completion of device data management activities for the selected patient medical record and maintains the stored data for subsequent authorized access."
  ],
  "alternative_flows": [
    "AF-1 (from Step 4): If the relevant external or fitness device is already linked to the selected patient medical record, the system confirms the existing link without requiring additional device linking actions and proceeds directly to Step 5.",
    "AF-2 (from Step 5): If existing patient device authorization settings already permit the intended device data transfer and viewing by the current actor, the system confirms that the current authorization is sufficient and proceeds directly to Step 6 or Step 8 according to the actor's chosen action.",
    "AF-3 (from Step 6): If the patient chooses to manage only viewing of previously stored device data without uploading new fitness data, the patient skips the upload action, and the system proceeds directly to Step 10 to display the existing device data.",
    "AF-4 (from Step 8): If the doctor chooses not to enter any new manual external device results and only wishes to review existing device data, the doctor skips the manual entry action, and the system proceeds directly to Step 10 to display the existing device data."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): If authentication fails, the system denies access to medical record and device data management functions, informs the actor of the failed authentication, and terminates the use case without changing any medical record data.",
    "EF-2 (from Step 4): If the system cannot complete the device linking process due to a technical problem with the external or fitness device or connectivity, the system informs the actor that automatic device linking is unavailable and allows the actor to proceed only with functions that do not require automatic device data transfer, such as manual entry by a doctor and viewing of already stored data, then continues at Step 5.",
    "EF-3 (from Step 5): If patient authorization for the relevant device data transfer or visibility is not granted or has been explicitly denied, the system prevents new device data for that device from being stored or shown to unauthorized actors, informs the current actor that access to that device data is restricted by patient authorization, and terminates the use case for operations that require that authorization while retaining any previously authorized data.",
    "EF-4 (from Step 7): If the fitness data file or input provided by the patient cannot be processed by the system due to format or integrity issues, the system rejects the upload, informs the patient that the fitness data could not be stored, and allows the patient to attempt the upload again within the current session or to cancel the upload and proceed to Step 10 to view existing data.",
    "EF-5 (from Step 9): If the manually entered external device results contain syntactically invalid values that the system cannot store, the system highlights the invalid entries, informs the doctor of the validation errors, and prompts the doctor to correct the entries or cancel the manual entry, after which the doctor may retry Step 9 or proceed to Step 10 without storing invalid data."
  ],
  "information_for_steps": [
    "1. User credentials, authentication prompt parameters, session initiation request.",
    "2. Authentication data, credential verification result, authenticated user identifier, session token.",
    "3. Patient identifier selection, medical record identifier, medical record summary data.",
    "4. Device identifier, device type (e.g., fitness band, blood pressure monitor, CT scanner interface), device-to-record linkage metadata.",
    "5. Patient device authorization settings, permitted device data types, permitted viewer roles.",
    "6. Fitness data upload options, fitness data source selection, upload command from patient.",
    "7. Fitness data payload, timestamp, association to patient medical record, storage confirmation data.",
    "8. Manual entry form structure for external device results, selected device type, target medical record section.",
    "9. Manually entered measurement values, measurement units, timestamps, validation rules, association to patient medical record.",
    "10. Consolidated device data set for the patient medical record, filtering based on authorization and actor role, display parameters.",
    "11. Completion status of device data management operations, updated medical record state, audit information for changes applied during the use case."
  ]
}