{
  "use_case_name": "View Medical Records",
  "unique_id": "UC-004",
  "area": "Medical Administration",
  "context_of_use": "This use case allows receptionists to access and view patients' electronic medical records for administrative purposes.",
  "scope": "Hospital Management System",
  "level": "User-goal",
  "primary_actors": [
    "receptionist"
  ],
  "supporting_actors": [],
  "stakeholders_and_interests": [
    "Receptionist: Needs access to patient information for contact and administrative tasks."
  ],
  "description": "Allow receptionists to view patients’ electronic medical records needed for contact and administrative tasks.",
  "triggering_event": "Receptionist initiates a request to view a patient's electronic medical record.",
  "trigger_type": "External",
  "preconditions": [
    "Receptionist is logged into the hospital management system.",
    "Receptionist has the necessary permissions to view medical records."
  ],
  "postconditions": [
    "Receptionist successfully views the patient's electronic medical record."
  ],
  "assumptions": [
    "The system has a functioning electronic medical record database.",
    "The receptionist has been granted appropriate access rights."
  ],
  "requirements_met": [
    "The system shall allow receptionists to view patients' electronic medical records.",
    "The system shall manage access control to ensure only authorized personnel can view records."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "Clarification on data privacy measures for patient records."
  ],
  "main_flow": [
    "1. Receptionist requests to view a patient's electronic medical record → System retrieves the patient's electronic medical record.",
    "2. System displays the patient's electronic medical record → Receptionist reviews the information."
  ],
  "alternative_flows": [
    "AF-1 (from Step 1): If the receptionist does not have access rights, the system displays an error message and denies access."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): If the system fails to retrieve the electronic medical record, the system displays an error message indicating the failure."
  ],
  "information_for_steps": [
    "1. Patient's electronic medical record",
    "2. Receptionist's access permissions"
  ]
}