{
  "use_case_name": "Manage Dataset Access Policies",
  "unique_id": "UC-020",
  "area": "Research Data Management",
  "context_of_use": "Depositors and external coordinators configure dataset access policies, including embargoes, licenses, disposal policies, and intellectual property protections, so that dataset access and reuse comply with rights, legal obligations, and collaboration agreements.",
  "scope": "Bath Data Archive system",
  "level": "User-goal",
  "primary_actors": [
    "depositor",
    "externalcoordinator"
  ],
  "supporting_actors": [
    "Bath Data Archive administrator"
  ],
  "stakeholders_and_interests": [
    "Depositor: Wants to control access to datasets through embargoes, licenses, and disposal policies to protect right of first use, intellectual property, confidentiality, and legal compliance.",
    "Externalcoordinator: Wants guarantees that their intellectual property rights will not be breached when collaborating, so that collaboration risk is acceptable.",
    "Bath Data Archive administrator: Wants deposited datasets to comply with policies and licensing requirements so that the archive operates consistently and lawfully.",
    "Fundingbody: Wants reassurance that researchers have robust archival and access plans for their data so that funded research remains a worthwhile investment.",
    "Research Information manager: Wants accurate representation of dataset access and licensing conditions so that reporting on research outputs is reliable.",
    "UnivITservice: Wants access policies to be enforceable by existing infrastructure so that data integrity, availability, and security can be maintained."
  ],
  "description": "This use case describes how a depositor and an external coordinator configure and manage access policies for a dataset, including setting embargoes, applying licenses, defining disposal policies, and ensuring that intellectual property rights are protected.",
  "triggering_event": "The depositor decides to configure or update the access policies for a specific dataset in the Bath Data Archive.",
  "trigger_type": "External",
  "preconditions": [
    "The depositor is authenticated in the Bath Data Archive system.",
    "The depositor has access rights to manage access policies for the target dataset.",
    "The target dataset record exists in the Bath Data Archive system.",
    "The externalcoordinator, if involved, has an established collaboration relationship relevant to the dataset."
  ],
  "postconditions": [
    "The dataset has an explicit embargo configuration recorded in the system, including whether an embargo exists and its duration if applicable.",
    "The dataset has an explicit license selected and recorded in the system.",
    "The dataset has an explicit disposal policy recorded in the system.",
    "The dataset access policies recorded in the system are consistent with the depositor's stated confidentiality responsibilities, collaboration agreements, and intellectual property protections.",
    "Any changes to access policies are stored with the dataset record so that they can be enforced by the system."
  ],
  "assumptions": [
    "It is assumed that the Bath Data Archive system already provides user authentication and authorization mechanisms to distinguish depositors and externalcoordinators.",
    "It is assumed that the dataset has already been created or deposited in the system before access policies are managed in this use case.",
    "It is assumed that the system offers a predefined set of license options and policy parameters configured by administrators, and this use case only covers selecting among those options.",
    "It is assumed that the system stores but does not, within this use case, execute the actual disposal of data; execution of disposal is handled in a separate process and use case.",
    "It is assumed that the guarantees about non-breach of intellectual property rights, mentioned by the externalcoordinator, are fulfilled through correct configuration and storage of access policies within the system and through institution-level policies outside the system.",
    "It is assumed that any legal or policy rules that constrain allowed embargo durations, disposal options, and license choices are defined outside this use case and enforced by system configuration provided by administrators.",
    "It is assumed that externalcoordinators do not directly edit policies in the system in this use case but may review or request changes through out-of-band communication with depositors."
  ],
  "requirements_met": [
    "The system shall allow a depositor to place a dataset under an embargo so that the depositor's right of first use is protected and confidentiality responsibilities can be fulfilled.",
    "The system shall allow a depositor to apply a license to a dataset so that the depositor's intellectual property rights are protected appropriately.",
    "The system shall allow a depositor to specify a disposal policy for a dataset so that the depositor does not accidentally breach laws or collaboration agreements.",
    "The system shall record dataset access policies in a way that supports providing guarantees to an externalcoordinator that their intellectual property rights will not be breached when collaborating.",
    "The system shall store all configured access policies with the dataset record so that they can be inspected, audited, and enforced.",
    "The system should present access policy options in a structured interface that enables a depositor to review embargo, license, and disposal policy settings before confirmation."
  ],
  "priority": "High",
  "risk": "High",
  "outstanding_issues": [
    "The allowable range and maximum duration for dataset embargoes have not been defined.",
    "The set of supported license types and whether custom licenses are permitted has not been specified.",
    "The exact disposal policy options, including retention periods and conditions under which disposal may be overridden, remain to be detailed.",
    "The mechanism by which guarantees about intellectual property protection are communicated to externalcoordinators has not been defined.",
    "It is unclear whether externalcoordinators should be able to view or influence dataset access policy settings directly within the system.",
    "The precedence rules between institutional policies, funder requirements, collaboration agreements, and depositor-specified policies for access control have not been clarified."
  ],
  "main_flow": [
    "1. Depositor selects the target dataset in the Bath Data Archive user interface to manage access policies → System displays the dataset overview page including current access policy settings.",
    "2. Depositor chooses to edit access policies for the dataset → System presents an access policy configuration interface with sections for embargo, license, and disposal policy.",
    "3. Depositor configures embargo settings for the dataset, including whether an embargo is applied and the intended embargo end condition or date → System records the selected embargo settings in a pending policy configuration.",
    "4. Depositor selects a license for the dataset from the available options → System records the selected license in the pending policy configuration and displays a summary of the license choice.",
    "5. Depositor specifies a disposal policy for the dataset, including any retention or disposal conditions according to applicable agreements → System records the specified disposal policy in the pending policy configuration.",
    "6. Depositor reviews the embargo, license, and disposal policy settings in a consolidated summary view → System displays a confirmation summary of all configured access policies for the dataset.",
    "7. Depositor confirms the access policy configuration for the dataset → System saves the configured access policies with the dataset record as the active policies.",
    "8. System updates internal representations of dataset access rights based on the saved policies → System makes the configured embargo, license, and disposal policy available for enforcement and for display to authorized users, enabling protection of depositor and externalcoordinator intellectual property and compliance responsibilities."
  ],
  "alternative_flows": [
    "AF-1 (from Step 3): Depositor chooses not to apply an embargo. Condition: Depositor decides that immediate open access is acceptable. Flow: Depositor explicitly selects the option indicating no embargo for the dataset → System records that no embargo is applied and marks the dataset as not embargoed in the pending policy configuration → Flow resumes at Step 4.",
    "AF-2 (from Step 5): Depositor defers specification of a detailed disposal schedule while still indicating a general disposal policy. Condition: Institutional or funder guidance is not yet fully known. Flow: Depositor selects a general disposal policy option that indicates data is to be retained until an external review or policy decision is made, without specifying an exact disposal date → System records the general disposal policy with an open-ended retention condition in the pending policy configuration → Flow resumes at Step 6.",
    "AF-3 (from Step 6): Depositor adjusts policies after review. Condition: During review, depositor identifies a change needed to embargo, license, or disposal policy. Flow: Depositor uses the interface controls in the summary view to return to the relevant policy section (embargo, license, or disposal) → System reopens the selected policy section with the current pending values → Depositor updates the settings as required → System updates the pending policy configuration and returns to the consolidated summary view → Flow resumes at Step 7."
  ],
  "exception_flows": [
    "EF-1 (from Step 3): Embargo configuration violates allowed policy constraints. Condition: Depositor attempts to set embargo parameters that conflict with configured institutional or funder constraints. Flow: System detects that the requested embargo settings exceed allowed values or conflict with mandatory access requirements → System rejects the invalid embargo configuration, displays an error message describing the policy conflict, and prompts the depositor to modify the embargo settings → Use case continues at Step 3 with corrected input or is abandoned by the depositor.",
    "EF-2 (from Step 4): Selected license is unavailable or invalid. Condition: The depositor's chosen license option is not valid according to current configuration. Flow: System identifies that the selected license cannot be applied (for example, because it has been withdrawn from use in the system configuration) → System displays an error message and resets the license selection field, requiring the depositor to choose another available license → Use case continues at Step 4.",
    "EF-3 (from Step 5): Disposal policy conflicts with legal or collaboration constraints. Condition: The depositor's specified disposal policy is incompatible with known high-level constraints. Flow: System detects that the requested disposal policy conflicts with configured mandatory retention or destruction rules → System displays an error message indicating the conflict and prevents saving of the invalid disposal policy, keeping existing values unchanged in the pending configuration → Use case continues at Step 5.",
    "EF-4 (from Step 7): Failure to save access policy configuration. Condition: A technical or storage error occurs while saving the updated access policies. Flow: System fails to persist the new settings and detects the error → System notifies the depositor that access policy changes could not be saved and maintains the previously active access policies unchanged → Use case terminates with the dataset retaining the prior access policy configuration."
  ],
  "information_for_steps": [
    "1. Dataset identifier; depositor identifier; current access policy summary.",
    "2. Dataset identifier; current embargo, license, and disposal policy values.",
    "3. Dataset identifier; embargo flag; embargo start and end conditions or dates; confidentiality indicators.",
    "4. Dataset identifier; selected license type; license reference or code.",
    "5. Dataset identifier; disposal policy type; retention conditions; disposal triggers.",
    "6. Dataset identifier; consolidated embargo, license, and disposal policy summary; depositor identifier.",
    "7. Dataset identifier; finalized access policy configuration; timestamp of confirmation; depositor identifier.",
    "8. Dataset identifier; active access policy metadata; references used for enforcement and display."
  ]
}