{
  "use_case_name": "Schedule Games",
  "unique_id": "UC-003",
  "area": "Game Scheduling and Match Official Allocation",
  "context_of_use": "The system automatically generates and maintains game schedules and allocates match officials while considering defined constraints and preferences to reduce manual workload and avoid rescheduling.",
  "scope": "IFA League Management System",
  "level": "User-goal",
  "primary_actors": [
    "ifa employee"
  ],
  "supporting_actors": [
    "ifa",
    "match official"
  ],
  "stakeholders_and_interests": [
    "ifa: The IFA seeks unbiased, conflict-free, and rule-compliant game schedules that support operational integrity and fairness.",
    "ifa employee: The IFA employee seeks to reduce manual workload by relying on automated scheduling and allocation while retaining controlled override capability.",
    "match official: The match official seeks schedules that respect their preferred time slots, dates, and locations and avoid personal schedule conflicts.",
    "teams and team managers: Teams and their managers rely on predictable and fair game schedules to plan their participation and logistics.",
    "fans: Fans depend on stable and reliable match schedules to plan attendance and engagement.",
    "ifa management: IFA management is interested in ensuring that scheduling operations adhere to organizational policies and minimize errors."
  ],
  "description": "This use case enables an IFA employee to generate, review, and, when necessary, override automatically created game schedules and match official allocations, while the system considers match officials’ availability preferences and avoids conflicts between game schedules and match officials’ personal schedules.",
  "triggering_event": "An IFA employee decides to generate or update a game schedule and associated match official allocations for one or more competitions or time periods.",
  "trigger_type": "External",
  "preconditions": [
    "The IFA League Management System is operational and accessible to the IFA employee.",
    "The IFA employee is authenticated and authorized to create and manage game schedules.",
    "Relevant competition, league, team, and match data required to schedule games has been previously defined in the system.",
    "Registered match officials exist in the system with associated identification data.",
    "Match officials’ personal schedule information and preferred time slots, dates, and locations have been recorded or are available to the scheduling function."
  ],
  "postconditions": [
    "A game schedule is generated or updated in the system for the selected scope (e.g., competition, league, or time period).",
    "Each scheduled game in the generated schedule has zero or more match officials allocated according to the system’s allocation rules.",
    "The generated schedule respects recorded match official personal schedule constraints to avoid conflicts.",
    "The generated schedule considers recorded match official preferred time slots, dates, and locations where possible.",
    "Any applied schedule overrides have been recorded by the system, including the identities of the certified IFA employees involved in the override approval.",
    "The final schedule state is stored and available for subsequent use by other processes or stakeholders."
  ],
  "assumptions": [
    "The IFA League Management System already includes functionality for defining competitions, leagues, teams, and matches, and this use case only utilizes that existing data without introducing new management capabilities.",
    "The system already has mechanisms for recording and maintaining match officials’ personal schedules and their preferred time slots, dates, and locations, and this use case consumes that information for scheduling purposes.",
    "Certification status of IFA employees is already managed elsewhere in the system, and this use case only checks the certification status when validating schedule override approvals.",
    "The criteria and algorithmic details for generating schedules and allocating match officials are defined as internal system logic and are not configured or modified by actors as part of this use case.",
    "This use case focuses on generating and adjusting upcoming game schedules and does not modify historical schedules of already completed games.",
    "Notification of stakeholders about schedule changes is handled by a separate use case, and this use case only produces the schedule data that such notification functions may consume.",
    "The IFA defines what constitutes a conflict with a match official’s personal schedule, and the system applies that definition consistently during scheduling.",
    "The IFA defines what constitutes consideration of match officials’ preferences, and the system attempts to satisfy these preferences without guaranteeing full satisfaction for all officials."
  ],
  "requirements_met": [
    "The system shall provide a function for an authenticated IFA employee to request automatic scheduling of games to reduce manual workload.",
    "The system shall automatically generate game schedules based on existing competition, league, team, and match data.",
    "The system shall automatically allocate match officials to scheduled games upon request by an authenticated IFA employee.",
    "The system shall ensure that automatically generated game schedules avoid conflicts with match officials’ recorded personal schedules so that rescheduling due to such conflicts is minimized.",
    "The system shall take into consideration each match official’s recorded preferred time slots, dates, and locations when generating their officiating schedule.",
    "The system shall support controlled overrides of an automatically generated schedule only when at least two certified IFA employees approve the override.",
    "The system shall record the details of any schedule override, including the affected games and the identities of the certified IFA employees who approved the override.",
    "The system shall store the resulting game schedule and match official allocations in a manner that allows subsequent access by authorized actors and related system functions."
  ],
  "priority": "High",
  "risk": "High",
  "outstanding_issues": [
    "The precise scheduling algorithm and optimization criteria for balancing fairness, workload distribution, and preference satisfaction have not been specified.",
    "The exact definition of a conflict between game schedules and match officials’ personal schedules requires clarification from the IFA.",
    "The minimum and maximum number of match officials required per game for different competition types are not defined.",
    "The operational procedure for designating and maintaining the list of certified IFA employees who may approve schedule overrides is not specified.",
    "The required level of audit detail and retention period for schedule generation and override activities is not defined.",
    "Rules for handling partially satisfied match official preferences (e.g., prioritization among officials) have not been formally stated.",
    "The extent to which this use case should interact with or be constrained by league-specific rulesets for scheduling is not explicitly defined."
  ],
  "main_flow": [
    "1. IFA employee initiates the scheduling process by selecting the relevant competition, league, or time period for which games should be scheduled → System displays available competitions, leagues, and time periods along with any existing scheduling data for the selected scope.",
    "2. IFA employee confirms the set of games to be scheduled or rescheduled within the selected scope → System retrieves and lists the games requiring scheduling, including date ranges, participating teams, and venue information where available.",
    "3. System retrieves recorded match officials’ personal schedules and preferred time slots, dates, and locations for the scheduling horizon → System prepares internal availability and preference data structures for use in automatic scheduling and allocation.",
    "4. IFA employee requests automatic generation or update of the game schedule for the selected set of games → System executes the scheduling logic to assign dates, times, and venues to unscheduled or adjustable games within the defined constraints.",
    "5. System allocates available match officials to each scheduled game based on recorded personal schedules, preferences, and internal allocation rules → System produces a proposed allocation ensuring that allocated match officials do not have conflicts with their personal schedules.",
    "6. System verifies that no match official is allocated to games that conflict with their recorded personal schedules → System adjusts allocations as needed to remove detected conflicts and confirms a conflict-free allocation set according to the defined conflict criteria.",
    "7. System incorporates match officials’ preferred time slots, dates, and locations into the allocation where feasible → System updates the proposed schedule and allocations to reflect satisfied preferences to the maximum extent supported by its allocation rules.",
    "8. System presents the generated game schedule and match official allocations to the IFA employee for review → IFA employee reviews the schedule and allocation details, including dates, times, locations, and assigned match officials for each game.",
    "9. IFA employee accepts the generated schedule and allocations without overrides → System finalizes and stores the accepted schedule and allocations as the active schedule for the selected scope, making them available for subsequent processes and queries."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): IFA employee adjusts the set of games to be scheduled before generation. Condition: The IFA employee determines that some games should be excluded or additional games included before running the scheduling process. Flow: The IFA employee modifies the selection of games by adding or removing games from the list; the system updates the list of games to be scheduled and returns to Step 4 with the revised game set.",
    "AF-2 (from Step 8): IFA employee requests modification of the proposed schedule without requiring an override. Condition: The IFA employee wishes to refine parameters (such as the scheduling horizon or game subset) and regenerate the schedule instead of directly accepting it. Flow: The IFA employee updates scheduling parameters or the selected scope; the system discards the current proposal, recalculates the schedule and allocations using Steps 3 through 7, and then returns to Step 8 with the new proposal."
  ],
  "exception_flows": [
    "EF-1 (from Step 4): Scheduling cannot be completed for one or more games due to insufficient available time slots. Condition: The system determines that, given the selected scope and defined constraints, it cannot assign valid dates and times to all games. Flow: The system identifies the affected games, displays a message indicating that scheduling could not be completed for those games, and presents the partial schedule that could be generated; the IFA employee may adjust scope or constraints outside this use case or cancel the scheduling request, and the system does not finalize an incomplete schedule as the active schedule.",
    "EF-2 (from Step 5): Match official allocation fails for one or more games due to lack of available officials. Condition: The system determines that no match officials are available for specific games without violating personal schedule constraints. Flow: The system flags the affected games, displays a warning that match official allocation could not be completed for those games, and retains the rest of the generated schedule; the IFA employee may address resource issues outside this use case or rerun the process later, and the system only finalizes the successfully allocated portion if explicitly confirmed by the IFA employee.",
    "EF-3 (from Step 8): IFA employee attempts to override the generated schedule without sufficient certified approvals. Condition: The IFA employee initiates an override action that would change the automatically generated schedule or allocations, but fewer than two certified IFA employees approve the override. Flow: The system checks the number and certification status of approving IFA employees, rejects the override request due to insufficient certified approvals, displays an error message indicating the reason for rejection, keeps the automatically generated schedule unchanged, and returns to Step 8 for further review or acceptance.",
    "EF-4 (from Step 9): Failure to store the finalized schedule due to a system error. Condition: A technical error occurs while persisting the accepted schedule and allocations. Flow: The system reports that saving the schedule has failed, logs the error condition for investigation, marks the schedule as not finalized, and prompts the IFA employee to retry the operation at a later time; the use case ends without an active schedule being updated."
  ],
  "information_for_steps": [
    "1. Competition identifiers, league identifiers, time period parameters, user identity of IFA employee, existing scheduling metadata.",
    "2. List of matches or games, game identifiers, participating team identifiers, venue identifiers, existing scheduled or unscheduled status for each game.",
    "3. Match official identifiers, match officials’ personal schedule entries, preferred time slot data, preferred date data, preferred location data.",
    "4. Scheduling request parameters, scheduling horizon, constraints derived from competition and league settings, internal scheduling configuration data.",
    "5. List of scheduled games, candidate match officials per game, match official allocation rules, generated match official assignments per game.",
    "6. Conflict detection rules, time and location data for games, match officials’ personal schedule entries, conflict resolution adjustments applied to allocations.",
    "7. Preference satisfaction rules, mapping between games and match official preference profiles, indicators of which preferences are satisfied in the resulting schedule.",
    "8. Generated schedule details including game identifiers, dates, times, locations, and assigned match officials, display formatting data, IFA employee review inputs.",
    "9. Finalized schedule data set, final match official allocation data, audit trail data including timestamp and IFA employee identity, storage confirmation status."
  ]
}