{
  "use_case_name": "Review Sensor Data",
  "unique_id": "UC-007",
  "area": "Urban Mobility Analysis",
  "context_of_use": "The urban mobility planner reviews historical and current emission and traffic levels from monitoring sensors to assess the environmental and traffic impacts of mobility measures and proposals.",
  "scope": "Urban Mobility Planning Decision Support System",
  "level": "User-goal",
  "primary_actors": [
    "urban mobility planner"
  ],
  "supporting_actors": [
    "Environmental Monitoring Sensors",
    "Traffic Monitoring Sensors"
  ],
  "stakeholders_and_interests": [
    "Urban mobility planner: Wants to review emission and traffic levels from sensors to consider environmental and traffic effects in mobility proposals.",
    "City administration: Wants mobility proposals to be supported by objective sensor data for transparency and informed decision-making.",
    "Citizens: Expect that traffic and environmental measures are evaluated based on reliable sensor data to protect quality of life.",
    "Environmental agencies: Require accurate emission level assessments for compliance with environmental policies and regulations.",
    "Traffic management department: Needs validated traffic level information to coordinate and optimize traffic operations."
  ],
  "description": "This use case enables the urban mobility planner to select pollution and traffic sensors, specify a time frame, and review corresponding emission and traffic levels so that environmental and traffic effects of measures and scenarios are properly considered in urban mobility planning.",
  "triggering_event": "The urban mobility planner decides to review emission and traffic levels from sensors related to a measure or area of interest.",
  "trigger_type": "External",
  "preconditions": [
    "The urban mobility planner is authenticated and authorized to access sensor data in the system.",
    "Environmental monitoring sensors are registered in the system with identifiable sensor IDs or locations.",
    "Traffic monitoring sensors are registered in the system with identifiable sensor IDs or locations.",
    "The system has access to stored historical sensor readings for the selected sensors.",
    "The system clock and time references are correctly configured to interpret date and time filters."
  ],
  "postconditions": [
    "The system has presented emission level data for the selected pollution sensor over the specified time frame to the urban mobility planner.",
    "The system has presented traffic level data for the selected traffic sensor over the specified time frame to the urban mobility planner.",
    "The urban mobility planner has the option to use the reviewed sensor data as input to further analysis or reporting activities within the system."
  ],
  "assumptions": [
    "It is assumed that emission levels are obtained from pollution sensors that measure indicators such as NOx, CO2, or particulate matter, and that these readings are stored in the system before this use case is executed.",
    "It is assumed that traffic levels are obtained from traffic sensors (for example, loop detectors or camera-based counters) providing metrics such as vehicle counts or traffic density, and that these readings are stored in the system before this use case is executed.",
    "It is assumed that the system provides a user interface that allows the urban mobility planner to search and select sensors by ID, name, or geographic location.",
    "It is assumed that the system stores both historical and current sensor data and can filter data by specified date and time ranges.",
    "It is assumed that notification or alerting functionalities mentioned in other user stories (such as congestion or fairness notifications) are handled in separate use cases and are not part of this use case.",
    "It is assumed that the system presents sensor data in tabular and/or graphical form without performing additional predictive analytics beyond retrieving and aggregating already recorded sensor readings.",
    "It is assumed that only the actor \"urban mobility planner\" interacts directly with the system in this use case and no additional human actor roles are involved.",
    "It is assumed that data quality checks, calibration procedures, and sensor maintenance activities are managed outside this use case and are not triggered by it."
  ],
  "requirements_met": [
    "The system shall allow the urban mobility planner to select a pollution sensor to review its emission levels.",
    "The system shall display emission levels recorded by the selected pollution sensor for a specified time period so that environmental effects are considered.",
    "The system shall allow the urban mobility planner to select a traffic sensor to review its traffic levels.",
    "The system shall display traffic levels recorded by the selected traffic sensor for a specified time period so that traffic levels are considered.",
    "The system shall allow the urban mobility planner to specify date and time filters when reviewing sensor data.",
    "The system shall retrieve sensor readings only from sensors that are registered and available in the system.",
    "The system shall present the retrieved sensor data in a format that permits the urban mobility planner to analyze variations over time.",
    "The system shall ensure that only authenticated and authorized urban mobility planners can access detailed sensor data."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The required minimum temporal resolution of sensor data (for example, minute-based, hourly, or daily aggregation) is not defined and must be agreed with stakeholders.",
    "The required maximum historical retention period for sensor data (for example, months or years of history) is not specified and must be established.",
    "The precise set of emission and traffic metrics that must be displayed for each sensor (for example, specific pollutants or traffic indicators) is not detailed and requires clarification.",
    "The expected visualization formats for sensor data (for example, line charts, heatmaps, tabular reports) need to be confirmed with the urban mobility planner and related stakeholders.",
    "Access control policies regarding which sensor data subsets may be viewed by different user groups, if any besides the urban mobility planner, are not defined and must be determined."
  ],
  "main_flow": [
    "1. Urban mobility planner selects the sensor data review function in the system → System displays options to review emission levels or traffic levels and lists available sensors or sensor search criteria.",
    "2. Urban mobility planner chooses to review emission levels and selects a pollution sensor from the provided list or search results → System confirms the selected pollution sensor and prompts for a date and time range.",
    "3. Urban mobility planner specifies the desired date and time range for emission level review and submits the request → System retrieves emission level readings for the selected pollution sensor within the specified time range.",
    "4. Urban mobility planner views the presented emission level data → System displays emission level data for the selected pollution sensor over the specified period, using tabular and/or graphical representations.",
    "5. Urban mobility planner chooses to review traffic levels and selects a traffic sensor from the provided list or search results → System confirms the selected traffic sensor and prompts for a date and time range.",
    "6. Urban mobility planner specifies the desired date and time range for traffic level review and submits the request → System retrieves traffic level readings for the selected traffic sensor within the specified time range.",
    "7. Urban mobility planner views the presented traffic level data → System displays traffic level data for the selected traffic sensor over the specified period, using tabular and/or graphical representations.",
    "8. Urban mobility planner finishes reviewing sensor data → System maintains the reviewed sensor data views available for reference during the current session and returns to the main analysis or planning interface."
  ],
  "alternative_flows": [
    "AF-1 (from Step 1): Urban mobility planner directly selects a specific sensor from a map-based view instead of from a list or search results. The system highlights the selected sensor, identifies it as pollution or traffic type, and proceeds to the corresponding prompt for date and time range equivalent to Step 2 or Step 5, then continues with the main flow from that subsequent step.",
    "AF-2 (from Step 4): After viewing emission level data, the urban mobility planner adjusts the date and time range to refine the analysis. The system accepts the new date and time range, retrieves the corresponding emission level readings for the same pollution sensor, updates the displayed emission data, and then the flow continues again from Step 4.",
    "AF-3 (from Step 7): After viewing traffic level data, the urban mobility planner adjusts the date and time range to refine the analysis. The system accepts the new date and time range, retrieves the corresponding traffic level readings for the same traffic sensor, updates the displayed traffic data, and then the flow continues again from Step 7.",
    "AF-4 (from Step 1): Urban mobility planner chooses to review only one type of sensor data (either emission levels or traffic levels). The system executes only the corresponding part of the main flow (Steps 2–4 for emission levels or Steps 5–7 for traffic levels) and then proceeds directly to Step 8 when the urban mobility planner finishes reviewing sensor data."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): The selected pollution sensor has no stored emission data for the specified date and time range. The system informs the urban mobility planner that no emission data is available for the selected sensor and period, offers the option to select another date and time range or another pollution sensor, and then returns to Step 2 or ends the use case if the urban mobility planner cancels the operation.",
    "EF-2 (from Step 3): An error occurs while retrieving emission level data due to a data access or internal system failure. The system logs the error, displays an error message indicating that emission data could not be retrieved, and offers the urban mobility planner the option to retry Step 3 or return to the main analysis or planning interface, thereby terminating the current execution of this use case.",
    "EF-3 (from Step 5): The selected traffic sensor has no stored traffic data for the specified date and time range. The system informs the urban mobility planner that no traffic data is available for the selected sensor and period, offers the option to select another date and time range or another traffic sensor, and then returns to Step 5 or ends the use case if the urban mobility planner cancels the operation.",
    "EF-4 (from Step 6): An error occurs while retrieving traffic level data due to a data access or internal system failure. The system logs the error, displays an error message indicating that traffic data could not be retrieved, and offers the urban mobility planner the option to retry Step 6 or return to the main analysis or planning interface, thereby terminating the current execution of this use case.",
    "EF-5 (from Step 1): The urban mobility planner loses authorization or the session expires before or during sensor selection. The system prompts the urban mobility planner to re-authenticate, and if re-authentication succeeds, returns to Step 1; if re-authentication fails or is canceled, the system terminates the use case without displaying sensor data."
  ],
  "information_for_steps": [
    "1. Sensor list, sensor search criteria, sensor identifiers, sensor type (pollution or traffic).",
    "2. Selected pollution sensor ID, sensor name, sensor location, sensor type metadata.",
    "3. Date and time range parameters for emission level retrieval, time zone context, emission data query parameters.",
    "4. Emission level readings, timestamps, aggregated emission metrics, tabular data structures, chart or visualization configuration.",
    "5. Selected traffic sensor ID, sensor name, sensor location, sensor type metadata.",
    "6. Date and time range parameters for traffic level retrieval, time zone context, traffic data query parameters.",
    "7. Traffic level readings, timestamps, aggregated traffic metrics, tabular data structures, chart or visualization configuration.",
    "8. Current session context, last viewed sensor data sets, navigation state back to main analysis or planning interface."
  ]
}