{
  "use_case_name": "Manage Record Access",
  "unique_id": "UC-001",
  "area": "Medical Record Access Control",
  "context_of_use": "The use case is executed when a patient or doctor manages which doctors are linked to a patient’s medical profile so that only assigned doctors can view the corresponding medical records and patient confidentiality is maintained.",
  "scope": "Digital Medical Record Management System",
  "level": "User-goal",
  "primary_actors": [
    "patient",
    "doctor"
  ],
  "supporting_actors": [
    "doctor"
  ],
  "stakeholders_and_interests": [
    "patient: Ensure that only explicitly assigned doctors can access the patient’s medical profile and medical records in order to maintain confidentiality.",
    "doctor: Access only those patient medical records for which the doctor is explicitly assigned, and manage assignment of additional doctors when multiple specialties are required.",
    "organization: Ensure that access to medical records complies with confidentiality and privacy expectations by enforcing access control based on explicit assignments."
  ],
  "description": "This use case describes how a patient assigns a doctor to their medical profile and how doctors manage access to a patient’s medical record by restricting their view to assigned records and assigning additional doctors when multiple specialties are needed.",
  "triggering_event": "A patient or doctor decides to manage which doctors are assigned to a patient’s medical profile or medical record.",
  "trigger_type": "External",
  "preconditions": [
    "The patient has an existing medical profile in the Digital Medical Record Management System.",
    "The doctor exists as a registered user within the Digital Medical Record Management System.",
    "The initiating actor (patient or doctor) is successfully authenticated in the Digital Medical Record Management System.",
    "The initiating doctor, when assigning another doctor, is already assigned to the patient’s medical record."
  ],
  "postconditions": [
    "The set of doctors assigned to the patient’s medical profile and medical record is updated to reflect the performed assignments.",
    "The system enforces that doctors can view only the medical records of patients to whom they are assigned.",
    "An assignment history entry is stored that reflects the change in doctor–patient linkages for the concerned medical profile."
  ],
  "assumptions": [
    "It is assumed that the Digital Medical Record Management System already supports user authentication for both patients and doctors, because the requirements mention users accessing the system and logging in.",
    "It is assumed that a patient’s medical profile and the associated medical records are already created before managing doctor access, because the use case focuses only on assigning and controlling access.",
    "It is assumed that only a patient or an already assigned doctor is allowed to manage the assignment of doctors to that patient’s medical profile or medical record, as implied by the user stories describing these actions for patients and doctors respectively.",
    "It is assumed that each doctor can be uniquely identified within the system so that assignment to a patient’s medical profile or record is unambiguous.",
    "It is assumed that the system persists and applies access control rules derived from the doctor–patient assignments so that unassigned doctors cannot view the patient’s medical records.",
    "It is assumed that when a doctor restricts their view to only assigned patient medical records, this configuration is system-enforced and not optional per record, because the goal is to maintain patient confidentiality.",
    "It is assumed that assigning another doctor to the medical record grants that doctor the same record-viewing rights as other assigned doctors, since the purpose is to involve multiple doctors of different specialties.",
    "It is assumed that the assignment and restriction actions are performed through an existing user interface of the Digital Medical Record Management System, even though the requirements do not describe the specific interface elements."
  ],
  "requirements_met": [
    "The system shall allow a patient to assign one or more doctors to the patient’s medical profile so that those doctors can access the profile and related medical records.",
    "The system shall restrict a doctor’s view to only those patient medical records for which the doctor is assigned, in order to maintain patient confidentiality.",
    "The system shall allow an assigned doctor to assign another doctor to a patient’s medical record so that multiple doctors of different specialties can be involved with that record.",
    "The system shall update access permissions immediately after a doctor is assigned or unassigned to ensure that only currently assigned doctors retain access to the patient’s medical records.",
    "The system shall maintain a persistent record of doctor–patient assignments for each medical profile to support consistent access control."
  ],
  "priority": "High",
  "risk": "High",
  "outstanding_issues": [
    "The rules for unassigning a doctor from a patient’s medical profile or medical record are not described and need to be defined.",
    "The approval workflow, if any, for a doctor assigning another doctor to a patient’s medical record is not specified.",
    "The maximum number of doctors that may be simultaneously assigned to a single patient’s medical profile or medical record has not been determined.",
    "The required level of audit logging for doctor–patient assignment changes (e.g., who performed the change and when) has not been clarified.",
    "Policies for handling access when a doctor changes role, department, or leaves the organization are not specified in connection with existing assignments."
  ],
  "main_flow": [
    "1. Patient initiates management of assigned doctors for their medical profile → System displays the patient’s medical profile along with the current list of assigned doctors.",
    "2. Patient selects the option to add a doctor to their medical profile and identifies the doctor to be assigned → System validates that the identified doctor exists and is eligible to be assigned.",
    "3. Patient confirms the assignment of the selected doctor to their medical profile → System links the selected doctor to the patient’s medical profile and updates the assignment list.",
    "4. Doctor authenticates and requests access to patient medical records through the system → System evaluates the doctor’s assignments and displays only medical records for patients to whom the doctor is assigned.",
    "5. Assigned doctor opens a specific patient’s medical record for which the doctor is already assigned → System displays the detailed medical record for that patient.",
    "6. Assigned doctor initiates the action to assign another doctor to the currently viewed patient medical record → System displays a mechanism to search or select another doctor to be added to the patient’s medical record.",
    "7. Assigned doctor selects another doctor and confirms the assignment to the patient’s medical record → System validates the selected doctor and adds the doctor to the set of doctors assigned to that patient’s medical record.",
    "8. System updates internal access control rules so that all assigned doctors, including the newly added doctor, can access the patient’s medical record while unassigned doctors cannot view it."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): Patient selects multiple doctors to assign in one operation → System validates each selected doctor, identifies all valid doctors, and upon patient confirmation in Step 3, links all validated doctors to the patient’s medical profile and updates the assignment list before continuing with Step 4.",
    "AF-2 (from Step 4): Doctor chooses to view the list of assigned patients instead of directly opening a specific record → System displays a list of patients whose records are assigned to the doctor, from which the doctor may select a patient record and proceed at Step 5."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): The identified doctor does not exist or is not eligible to be assigned → System rejects the assignment request, displays an error message indicating that the doctor cannot be assigned, and returns the patient to the list of existing assigned doctors without changing any assignments.",
    "EF-2 (from Step 4): Doctor has no assigned patients in the system → System displays a notification indicating that there are no accessible medical records for the doctor and does not display any patient medical records.",
    "EF-3 (from Step 7): The selected additional doctor fails validation due to a system validation error or conflict with assignment rules → System does not add the new doctor to the patient’s medical record, informs the assigning doctor of the failure, and retains the previous set of assigned doctors unchanged."
  ],
  "information_for_steps": [
    "1. Patient identifier, patient authentication status, existing doctor assignment list for the patient’s medical profile.",
    "2. Selected doctor identifier, doctor catalog data, doctor eligibility status.",
    "3. Patient confirmation flag, doctor–patient linkage record for the medical profile, updated assignment list.",
    "4. Doctor identifier, doctor authentication status, list of patient identifiers assigned to the doctor, filtered medical record list.",
    "5. Patient medical record identifier, detailed medical record data visible only to the assigned doctor.",
    "6. Current doctor–patient assignment context, search criteria for additional doctor, candidate doctor list.",
    "7. Selected additional doctor identifier, assignment confirmation flag, updated doctor–patient assignment set for the medical record.",
    "8. Access control rules for doctor–patient relationships, updated permission set for all doctors assigned to the patient’s medical record."
  ]
}