{
  "use_case_name": "View Match Statistics",
  "unique_id": "UC-007",
  "area": "Match and Player Statistics",
  "context_of_use": "The use case enables interested parties to obtain player and match statistics that are automatically derived from previously reported match events, allowing information consumers to review statistics without requiring additional manual data processing.",
  "scope": "IFA League Management System",
  "level": "User-goal",
  "primary_actors": [
    "fan",
    "ifa"
  ],
  "supporting_actors": [
    "match official"
  ],
  "stakeholders_and_interests": [
    "fan: Wants to view statistics of different matches and players to increase engagement with the league.",
    "ifa: Wants statistics to be derived directly from reported match events so that no extra work is needed and to prevent unauthorized data sources being relevant.",
    "match official: Wants their reported match events to be used as the authoritative basis for statistics so that they do not have to register events twice.",
    "team manager: Wants accurate statistics derived from official events to support fair assessment of team and player performance.",
    "team staff member: Wants reliable statistics for analysis and strategizing based on official match events.",
    "IFA budget auditor: Wants trustworthy, event-based statistics that can be cross-checked with financial and compliance data if needed."
  ],
  "description": "This use case describes how the system generates and presents player and match statistics that are automatically derived from officially reported match events, allowing the fan and the IFA to access accurate, up-to-date statistical information without additional manual data entry.",
  "triggering_event": "The fan or the IFA initiates a request to view statistics for a specific match and its participating players.",
  "trigger_type": "External",
  "preconditions": [
    "The IFA League Management System is operational and accessible to the primary actor.",
    "Match events for the target match have been reported into the system by authorized match officials.",
    "The primary actor is authenticated and authorized to access the requested statistical information according to their role.",
    "The match and player records associated with the requested statistics exist in the system."
  ],
  "postconditions": [
    "The system has generated player and match statistics based solely on the stored, officially reported match events for the selected match.",
    "The requested statistics have been successfully displayed to the primary actor.",
    "No manual modification of the underlying match events has been performed as part of this use case execution.",
    "The system has logged the statistics access request for auditing and monitoring purposes."
  ],
  "assumptions": [
    "It is assumed that a separate use case \"manage match events\" exists and is responsible for capturing and storing match events reported by match officials before this use case is executed.",
    "It is assumed that fans have read-only access to match and player statistics but cannot modify any underlying event or statistics data.",
    "It is assumed that the IFA actor in this use case represents an authorized IFA user role with permission to access statistical information for matches within the system.",
    "It is assumed that statistics are derived automatically by deterministic rules from stored match events without requiring manual calculations at the time of viewing.",
    "It is assumed that the system maintains data integrity so that reported match events used for statistics are complete and consistent at the time of statistics generation.",
    "It is assumed that the request to view statistics concerns one match context at a time, even if the user may navigate to other matches subsequently.",
    "It is assumed that localization (such as multiple languages or formats) does not alter the underlying statistical values but only their presentation."
  ],
  "requirements_met": [
    "The system shall derive player statistics directly from reported match events so that no extra work needs to be done by IFA users.",
    "The system shall derive match statistics directly from reported match events so that no extra work needs to be done by IFA users.",
    "The system shall allow a fan to view statistics of different matches to increase their engagement in the league.",
    "The system shall allow a fan to view statistics of different players to increase their engagement in the league.",
    "The system shall use only game event reports received directly from authorized match officials as the basis for match and player statistics.",
    "The system shall display generated statistics in a form that is readable on devices supported by the system, including at least mobile phones for fans.",
    "The system shall generate statistics automatically at request time or in advance using only stored, reported match events, without requiring users to manually re-enter match data."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The exact set of statistical metrics to be generated for matches and players (e.g., goals, assists, cards, minutes played) has not been specified and requires definition.",
    "The required performance criteria for generating and displaying statistics (e.g., maximum acceptable response time under 50,000 concurrent users) need to be defined.",
    "The detailed authorization rules for which IFA roles may access which levels of statistical detail are not specified.",
    "The formatting and localization requirements for presenting statistics (e.g., language, numeric formats, time zones) need to be clarified.",
    "The retention period and versioning policy for statistics derived from corrected or updated match events are not defined."
  ],
  "main_flow": [
    "1. fan or ifa initiates a request to view statistics for a specific match → System accepts the request and prompts the actor to select the desired match for which statistics are to be viewed.",
    "2. fan or ifa selects the target match from the list or by search → System validates the selection and retrieves the stored match identifier and associated competition context.",
    "3. fan or ifa confirms the intention to view official statistics for the selected match → System includes the \"manage match events\" functionality by retrieving all officially reported match events for the selected match that were submitted by authorized match officials.",
    "4. fan or ifa waits while statistics are being prepared → System derives match-level statistics from the retrieved match events according to predefined calculation rules.",
    "5. fan or ifa waits while player-related information is processed → System derives player-level statistics from the retrieved match events for all players who participated in the selected match according to predefined calculation rules.",
    "6. fan or ifa receives the generated results on the statistics view → System compiles the match-level and player-level statistics into a structured statistics view suitable for the actor's device.",
    "7. fan or ifa reviews the displayed statistics → System renders the compiled statistics to the actor and maintains the view for further navigation or closure by the actor."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): If the fan or ifa searches for a match by criteria instead of selecting from a predefined list, the actor enters search criteria for the desired match, the system filters and displays matching matches, the actor selects the target match from the filtered results, and the flow resumes at Step 3.",
    "AF-2 (from Step 6): If the actor chooses to adjust the scope of the statistics (for example, to switch from viewing only the selected match statistics to viewing statistics for another match), the actor selects a different match from within the statistics view, the system updates the internal selection to the newly chosen match, and the flow continues by repeating Steps 3 through 7 for the newly selected match."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): If the system determines that the selected match record does not exist or is no longer available, the system informs the actor that the match cannot be found and offers the option to return to match selection; the use case ends without statistics being displayed.",
    "EF-2 (from Step 3): If the system cannot retrieve any reported match events for the selected match, the system notifies the actor that no official event data is available for that match and displays a message indicating that statistics cannot be generated; the use case ends without statistics being displayed.",
    "EF-3 (from Step 4): If an internal error occurs during the derivation of match-level statistics, the system logs the error, informs the actor that statistics generation has failed, and stops further processing; the use case ends without displaying statistics.",
    "EF-4 (from Step 5): If an internal error occurs while calculating player-level statistics, the system logs the error, informs the actor that statistics generation has failed, and stops further processing; the use case ends without displaying statistics.",
    "EF-5 (from Step 1): If the actor is not authenticated or does not have sufficient authorization to access match statistics, the system denies the request, displays an authorization error message, and does not proceed with subsequent steps."
  ],
  "information_for_steps": [
    "1. Match view request parameters, actor identity, device context.",
    "2. Match identifier, competition identifier, match metadata, actor selection input.",
    "3. Match events list, event types, event timestamps, involved players, reporting match officials, event status.",
    "4. Match-level statistics data elements such as total goals, cards, substitutions, and other derived aggregates based on events.",
    "5. Player-level statistics data elements such as goals per player, cards per player, minutes involved, and other derived aggregates based on events.",
    "6. Compiled statistics view model including match statistics, player statistics, headings, labels, and layout metadata appropriate for the actor's device.",
    "7. Displayed statistics content, navigation options, logging metadata for statistics access (timestamp, actor, match identifier)."
  ]
}