{
  "use_case_name": "Authenticate Users",
  "unique_id": "UC-005",
  "area": "User Authentication and Access Control",
  "context_of_use": "This use case describes how users authenticate to the hospital management system using a unique identification number, password, and, where required, two-factor authentication with a phone in order to access system functionality and personal or work-related information.",
  "scope": "Hospital Management System",
  "level": "User-goal",
  "primary_actors": [
    "patient",
    "user",
    "uhope employee"
  ],
  "supporting_actors": [
    "system administrator"
  ],
  "stakeholders_and_interests": [
    "patient: Wants to authenticate securely so that only they can access their personal and their underage children’s medical information.",
    "user: Wants to authenticate with a unique identification number and password so that they can access the system.",
    "uhope employee: Wants to authenticate efficiently with reduced two-factor prompts after initial daily login so that they can perform their job with minimal delay.",
    "system administrator: Wants users to authenticate using assigned credentials so that access rights and security policies are enforceable.",
    "UHOPE: Wants the hospital management system to authenticate users reliably and securely so that GDPR compliance and data protection requirements are supported."
  ],
  "description": "This use case specifies the process by which patients, UHOPE employees, and other users authenticate to the hospital management system using a unique identification number, password, and, where applicable, two-factor authentication via phone, in order to gain authorized access to system services.",
  "triggering_event": "The user initiates a login request to the hospital management system.",
  "trigger_type": "External",
  "preconditions": [
    "The hospital management system is available online 24 hours per day and 7 days per week.",
    "The user has been registered in the system and has been assigned a unique identification number.",
    "The user has a valid password associated with their unique identification number.",
    "For users required to use two-factor authentication, a valid phone capable of receiving or generating the second factor is associated with their account.",
    "Access rights and user or user-group configurations have been defined by the system administrator."
  ],
  "postconditions": [
    "The user is authenticated and an active session is established with the hospital management system.",
    "The system records that the user has successfully logged in, including timestamp and actor type.",
    "For UHOPE employees, the system records whether two-factor authentication has been completed for the current day to determine subsequent two-factor requirements.",
    "The authenticated user can access only the system functions and data permitted by their access rights."
  ],
  "assumptions": [
    "The term \"user\" in the requirements includes patients and UHOPE employees who require access to the hospital management system.",
    "The unique identification number is created and assigned during a separate user registration or administration process that is outside the scope of this use case; this use case assumes the identifier already exists.",
    "Two-factor authentication uses a phone as the second factor as stated, but the exact mechanism (e.g., SMS, app-based code, push notification) is handled by underlying infrastructure and is not detailed in this use case.",
    "The system can distinguish between user roles (such as patient and UHOPE employee) in order to apply the correct authentication policy, including different two-factor authentication rules.",
    "For UHOPE employees, the phrase \"only the first time I want to log into the system each day\" is interpreted as the system tracking daily two-factor completion per employee account based on calendar date and login history.",
    "Failed login attempts and account lockout policies are handled, but only basic failure handling is described in this use case without defining specific thresholds or security policies.",
    "The system clock and date are accurate and synchronized so that daily two-factor authentication rules for UHOPE employees can be reliably enforced."
  ],
  "requirements_met": [
    "The system shall maintain a unique identification number for each user so that the user can identify themselves to the system.",
    "The system shall allow a user to log in by entering their unique identification number and password in order to access the system.",
    "The system shall require a UHOPE employee to log in with two-factor authentication using their phone the first time they successfully log in to the system each calendar day in order to minimize login time for subsequent logins that day.",
    "The system shall allow a UHOPE employee, after successful two-factor authentication on the first login of the day, to log in again during the same calendar day using only their unique identification number and password, unless security policies require two-factor authentication again.",
    "The system shall require a patient to always log in with two-factor authentication using their phone in addition to their unique identification number and password so that nobody other than the patient can access their personal information.",
    "The system shall authenticate users only if the provided unique identification number and password match a valid, active user account.",
    "The system shall enforce access rights such that an authenticated user can access only the data and functions permitted for their role and configuration defined by the system administrator.",
    "The system shall support continuous availability of the authentication function 24 hours per day and 7 days per week to allow UHOPE employees and patients to always do their job or access their information."
  ],
  "priority": "High",
  "risk": "High",
  "outstanding_issues": [
    "The specific technical method for two-factor authentication using a phone (e.g., SMS code, mobile app, phone call) has not been defined and must be decided.",
    "The exact time boundaries and timezone rules determining what constitutes a \"day\" for enforcing first daily two-factor authentication for UHOPE employees are not specified and must be clarified.",
    "Policies regarding the maximum number of failed login attempts before account lockout or additional verification are not defined and must be established.",
    "Password complexity, expiration, and reset policies are not described and must be determined to ensure compliance with security and GDPR regulations.",
    "It is not specified whether certain categories of UHOPE employees or other users may be exempt from two-factor authentication under emergency or special circumstances.",
    "Session timeout duration and re-authentication requirements after periods of inactivity are not specified and must be agreed upon."
  ],
  "main_flow": [
    "1. User → The user navigates to the hospital management system login interface.",
    "2. User → The user enters their unique identification number into the login interface and submits it to the system.",
    "3. System → The system validates that the provided unique identification number corresponds to an existing user account and determines the user’s role and applicable authentication policy.",
    "4. User → The user enters their password associated with the unique identification number and submits the credentials to the system.",
    "5. System → The system verifies that the password matches the stored credentials for the identified user account.",
    "6. System → The system evaluates whether two-factor authentication is required for this login attempt based on the user’s role, daily login history, and two-factor configuration.",
    "7. System → If two-factor authentication is required, the system initiates the two-factor authentication process using the user’s registered phone and prompts the user to provide the second factor.",
    "8. User → The user completes the two-factor authentication step using their phone and submits the required second factor information to the system.",
    "9. System → The system verifies the provided second factor and confirms successful completion of two-factor authentication when required.",
    "10. System → The system establishes an authenticated session for the user, records the successful login event, updates the daily two-factor status where applicable, and presents the appropriate post-login start page according to the user’s role and access rights."
  ],
  "alternative_flows": [
    "AF-1 (from Step 6): Two-factor authentication not required for this login for a UHOPE employee who has already completed two-factor authentication earlier the same day. Condition: The user is identified as a UHOPE employee and the system determines, based on daily login history and policy, that two-factor authentication has already been successfully completed for the current calendar day. Flow: The system skips Steps 7 and 8, proceeds directly to Step 9 by treating two-factor authentication as already satisfied for this session, and then continues with Step 10 to establish the authenticated session.",
    "AF-2 (from Step 1): User is already authenticated in an active session. Condition: The user accesses the system while an existing active authenticated session for that user is still valid according to session management rules. Flow: The system recognizes the active session, bypasses Steps 2 through 9, and directly performs the equivalent of Step 10 by refreshing or continuing the authenticated session and displaying the appropriate post-login start page."
  ],
  "exception_flows": [
    "EF-1 (from Step 3): Invalid unique identification number. Condition: The system cannot find a user account matching the entered unique identification number. Flow: The system rejects the login attempt, informs the user that the identification number is invalid or the account does not exist, logs the failed attempt, and returns to Step 2 to allow re-entry of the unique identification number.",
    "EF-2 (from Step 5): Invalid password. Condition: The password does not match the stored credentials for the identified user account. Flow: The system rejects the credentials, increments a failed login counter, informs the user of an incorrect password without revealing which credential is incorrect, and returns to Step 4 to allow re-entry of the password, subject to security policies for failed attempts.",
    "EF-3 (from Step 7): Two-factor authentication delivery failure. Condition: The system is unable to deliver the two-factor authentication challenge to the user’s registered phone. Flow: The system informs the user that two-factor authentication could not be initiated, records the failure, and allows the user to retry the two-factor initiation from Step 7 or to cancel the login attempt, in which case the use case terminates without authentication.",
    "EF-4 (from Step 9): Two-factor authentication verification failure. Condition: The user provides an incorrect or expired second factor, or the verification process fails. Flow: The system rejects the two-factor authentication attempt, logs the failed attempt, informs the user of the failure without disclosing sensitive details, and returns to Step 7 to allow the user to attempt two-factor authentication again, subject to security policies for repeated failures; if limits are exceeded, the system terminates the login attempt and may temporarily block further attempts according to configured policies.",
    "EF-5 (from Step 1): System unavailable. Condition: The hospital management system or authentication component is not available. Flow: The system does not present a functional login interface, displays an error message indicating temporary unavailability, logs the incident if possible, and terminates the use case without authentication."
  ],
  "information_for_steps": [
    "1. Login interface URL, user access device type (e.g., web browser or app), system availability status.",
    "2. Unique identification number entered by the user.",
    "3. User account record associated with the unique identification number, user role information, authentication policy configuration.",
    "4. Password associated with the unique identification number entered by the user.",
    "5. Stored password hash or equivalent credential data and credential validation result.",
    "6. Two-factor authentication requirement flag, user role (patient or UHOPE employee or other), daily login history for the user, two-factor policy parameters.",
    "7. Two-factor authentication challenge data sent to the user’s phone, phone contact information registered for the user.",
    "8. Two-factor code or confirmation response provided by the user via their phone.",
    "9. Two-factor verification result, updated two-factor status for the current day where applicable.",
    "10. Session identifier, authenticated user identity and role, login timestamp, access rights profile, post-login start page content."
  ]
}