{
  "use_case_name": "Report Match Events",
  "unique_id": "UC-008",
  "area": "Match Event Reporting and Statistics Derivation",
  "context_of_use": "During a live match, the Match Official records official match events in real time into the IFA League Management System so that the IFA can derive player and match statistics directly from these reported match events without additional manual work.",
  "scope": "IFA League Management System",
  "level": "User-goal",
  "primary_actors": [
    "match official"
  ],
  "supporting_actors": [
    "ifa"
  ],
  "stakeholders_and_interests": [
    "ifa: Wants player and match statistics to be derived directly from officially reported match events so that no extra manual work is required and unofficial data sources are avoided.",
    "match official: Wants to report match events live during the match so that events are only registered once and their reports are treated as the authoritative source.",
    "fan: Wants to view live game event reports and statistics derived from those reports so that they can closely follow what is happening in the match and the league.",
    "team manager: Wants accurate, up-to-date statistics and records based on official match events to support team management and decision making.",
    "team staff member: Wants reliable, event-based statistics to support tactical and training decisions.",
    "ifa budget auditor: Wants statistics and records that are directly traceable to official match events to support auditing of financial transactions related to appearances and performance.",
    "ifa manager: Wants official match data and derived statistics to be consistent, traceable and defensible in case of disputes about performance or integrity."
  ],
  "description": "This use case describes how the Match Official records official match events live during a match in the IFA League Management System. As the Match Official reports events such as goals, fouls and substitutions, the system stores these events as the authoritative match record and, as a consequence, updates the underlying data from which player and match statistics are derived so that the IFA does not have to perform extra manual work.",
  "triggering_event": "A live match starts and the Match Official begins using the system to record match events in real time.",
  "trigger_type": "External",
  "preconditions": [
    "The IFA League Management System is operational and accessible to the Match Official for the relevant match.",
    "The Match Official is authenticated and authorized in the system to report match events for the assigned match.",
    "The match, participating teams and players are already registered in the system for the relevant competition.",
    "League rules and data structures necessary to interpret reported match events into statistics are configured in the system.",
    "The Match Official has a functioning device with network connectivity suitable for live event reporting during the match."
  ],
  "postconditions": [
    "All match events reported by the Match Official during the match are stored in the system as the official match event record.",
    "Player-related statistics data maintained by the system are updated in accordance with the reported match events and configured league rules.",
    "Match-related statistics data maintained by the system are updated in accordance with the reported match events and configured league rules.",
    "The IFA can subsequently access player and match statistics without performing additional manual data processing beyond the live reporting performed by the Match Official."
  ],
  "assumptions": [
    "It is assumed that the Match Official is the sole or primary official source of match events used by the system for statistics derivation, consistent with the IFA’s intent to receive game event reports directly from match officials and to prevent unauthorized data sources from being relevant.",
    "It is assumed that match events are reported in real time or near real time during the match, because the requirement specifies live reporting and live viewing of game event reports.",
    "It is assumed that the system has predefined mappings between types of match events and the statistics that must be updated (for example, goals, cards and substitutions), because statistics are to be derived automatically without extra work by the IFA.",
    "It is assumed that late corrections or adjustments to previously reported match events, if needed, are handled using the same event reporting mechanism by the Match Official or by another authorized IFA role, and that statistics are updated accordingly as a consequence.",
    "It is assumed that any necessary validation and authorization of the Match Official’s identity and assignment to the match are handled before the use case begins, and that this use case operates only with an already authenticated and assigned Match Official.",
    "It is assumed that the system processes the impact of each reported event on statistics immediately or in a timely manner such that live views and later reports remain consistent with the official match events.",
    "It is assumed that the fan-facing and staff-facing views of live events and statistics are provided by other use cases that consume the stored match event and statistics data generated as a result of this use case."
  ],
  "requirements_met": [
    "The system shall allow the Match Official to report match events live during the match so that events do not have to be registered twice.",
    "The system shall record each reported match event as part of the official match record associated with the corresponding match, teams and players.",
    "The system shall derive player statistics directly from the reported match events so that no extra manual work is required by the IFA.",
    "The system shall derive match statistics directly from the reported match events so that no extra manual work is required by the IFA.",
    "The system shall treat game event reports received directly from Match Officials as the authoritative input for statistics derivation, thereby preventing unauthorized data sources from affecting official statistics.",
    "The system shall apply configured league rules when interpreting reported match events to update player and match statistics.",
    "The system shall make updated statistics data, derived from the recorded match events, available for subsequent viewing and reporting by authorized IFA stakeholders.",
    "The system shall complete the updating of statistics as a consequence of event reporting without requiring the IFA to re-enter or duplicate match event data."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The exact set of match event types that must be reportable by the Match Official (for example, goals, assists, cards, substitutions, offsides, penalties) needs to be formally defined.",
    "The precise mapping between each event type and the statistics to be updated has not been fully specified.",
    "The required latency for propagating reported events into derived statistics and live views has not been defined.",
    "The procedure and authorization rules for correcting or annulling previously reported events after they have affected statistics remain to be specified.",
    "Error handling and offline behavior when the Match Official temporarily loses connectivity during the match need to be clarified.",
    "The user interface detail and interaction paradigm for rapid event entry by the Match Official during live play have not been described."
  ],
  "main_flow": [
    "1. match official opens the assigned live match in the system at or before kick-off → System displays the match context including participating teams, players and current match status ready for event reporting.",
    "2. match official reports the first in-match event by selecting the appropriate event type and associated participants (for example, scoring player, fouling player, affected team) and confirms the entry → System validates the input, timestamps the event, associates it with the match, teams and players, and stores it as part of the official match event record.",
    "3. match official continues to report subsequent in-match events as they occur by selecting event type and involved participants and confirming each event → System repeats validation and storage, appends each new event to the official match event record and updates internal structures used for statistics derivation.",
    "4. match official optionally reviews the list of reported events during natural breaks in play → System displays the ordered list of recorded events for the current match with key details such as time, type and involved players.",
    "5. match official corrects or supplements event information when noticing a necessary adjustment during the match (for example, updating the identity of a scoring player) → System records the correction as an updated event state or as a corrective entry linked to the original event and adjusts the stored match event record accordingly.",
    "6. match official continues to report events through to the end of the match, including final whistle and other closing events as needed → System finalizes storage of the full sequence of match events for the match as the complete official record.",
    "7. match official confirms that live event reporting for the match is complete → System marks event reporting for the match as complete while retaining the full official event record and maintains all corresponding player and match statistics derived from these reported events."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): match official needs to report a complex event involving multiple players or sequential sub-events (for example, a penalty resulting in a rebound goal) → System allows the match official to enter the necessary sequence of related events (such as penalty awarded, penalty taken, save, rebound goal) as individual but linked entries; once confirmed, the flow continues with Step 3 with all related events stored in the official match event record.",
    "AF-2 (from Step 4): match official identifies a minor non-critical discrepancy while reviewing the event list but decides to postpone correction until a later break → System keeps the current event list unchanged, allows further events to be reported normally through Step 3, and the match official later returns to Step 5 to perform the correction when convenient."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): System detects invalid or incomplete event data (for example, missing required player, invalid team association or unsupported event type) → System rejects the event entry, informs the match official of the problem, allows the match official to correct the data and resubmit, and does not store the invalid event in the official match event record.",
    "EF-2 (from Step 3): System temporarily loses connectivity or becomes unavailable while the match official attempts to report an event → System indicates that the event could not be stored, preserves any locally entered data if possible, and instructs the match official to retry submission once connectivity or availability is restored; until successful storage, the event is not included in the official match event record or derived statistics.",
    "EF-3 (from Step 5): System cannot apply a requested correction because the referenced event cannot be found or is locked due to integrity constraints → System informs the match official that the correction cannot be directly applied, logs the issue, and advises that the matter must be handled through an authorized post-match correction process outside this live reporting flow; the original statistics based on the uncorrected events remain in effect until resolved."
  ],
  "information_for_steps": [
    "1. Match identifier, competition identifier, participating team identifiers, player rosters and initial match status.",
    "2. Event type, event timestamp, involved player identifiers, involved team identifiers, match identifier and match period.",
    "3. Sequence of reported events including event identifiers, timestamps, event types, participants and any contextual attributes required by league rules.",
    "4. Ordered event list for the current match, including event identifiers, times, types, participants and brief descriptions.",
    "5. Original event identifiers, corrected event attributes (such as corrected player or time) and linkage between original and corrected records.",
    "6. Complete set of match events for the match, including all reported and corrected events, forming the official match event record.",
    "7. Confirmation status that event reporting is complete, along with the final official match event record and the internally updated player and match statistics derived from those events."
  ]
}