{
  "use_case_name": "Estimate Measure Impacts",
  "unique_id": "UC-005",
  "area": "Urban Mobility Planning and Impact Assessment",
  "context_of_use": "The use case is executed when an urban mobility planner needs quantitative estimations of a proposed traffic-related measure’s financial cost, congestion-related emissions, and traffic noise levels in order to assess its consequences for decision making.",
  "scope": "Urban Mobility Planning Decision Support System",
  "level": "User-goal",
  "primary_actors": [
    "urban mobility planner"
  ],
  "supporting_actors": [
    "Urban Mobility Planning Department",
    "Municipal Administration"
  ],
  "stakeholders_and_interests": [
    "Urban mobility planner: Wants accurate and explainable estimations of cost, congestion-related emissions, and traffic noise levels to review the consequences of a measure or event.",
    "Urban Mobility Planning Department: Wants consistent, reproducible impact estimations to support professional planning work and internal reviews.",
    "Municipal Administration: Wants reliable impact information to support policy and investment decisions based on the planner’s analyses.",
    "Citizens and neighborhoods: Want mobility measures that are evaluated for environmental and financial impacts, ensuring that negative consequences are understood before implementation.",
    "Environmental oversight bodies: Want that emission and noise impacts of measures are quantified to support environmental protection and regulatory compliance.",
    "Financial oversight bodies: Want that estimated costs of measures are known in advance to support budgeting and financial planning."
  ],
  "description": "This use case allows an urban mobility planner to request and obtain system-generated estimations of a proposed or analyzed traffic-related measure’s financial cost, congestion-related emissions, and traffic noise levels, in order to review the measure’s financial and environmental consequences.",
  "triggering_event": "The urban mobility planner decides to review the financial and environmental consequences of a specific mobility measure or traffic situation and requests impact estimations in the system.",
  "trigger_type": "External",
  "preconditions": [
    "The urban mobility planner has access rights to use the Urban Mobility Planning Decision Support System.",
    "The urban mobility planner is authenticated in the system.",
    "A specific measure or traffic situation to be evaluated is already defined or selected in the system.",
    "Required baseline data and models for cost, congestion-related emissions, and noise estimation are available and initialized in the system."
  ],
  "postconditions": [
    "The system has generated and stored an estimation of the financial cost of the selected measure.",
    "The system has generated and stored an estimation of congestion-related emissions associated with the selected measure or traffic situation.",
    "The system has generated and stored an estimation of traffic noise levels associated with the selected measure or traffic situation.",
    "The estimated cost, congestion-related emissions, and traffic noise levels are presented to the urban mobility planner for review."
  ],
  "assumptions": [
    "It is assumed that the Urban Mobility Planning Decision Support System already contains or has access to a defined representation of a measure or traffic situation that can be evaluated without requiring additional functionality beyond what is described in the requirements.",
    "It is assumed that models or calculation rules for estimating financial cost, congestion-related emissions, and traffic noise levels are pre-configured within the system and are outside the scope of this use case’s functional description.",
    "It is assumed that the urban mobility planner can identify and select the measure or traffic situation to be evaluated using existing selection or configuration capabilities of the system implied by other use cases.",
    "It is assumed that the estimations for cost, congestion-related emissions, and noise levels can be produced independently and that the use case does not mandate simultaneous calculation of all three if the planner does not request all of them.",
    "It is assumed that time required for performing estimations is acceptable to the urban mobility planner as long as results are eventually provided without system failure.",
    "It is assumed that only the actor \"urban mobility planner\" directly interacts with the user interface for this use case, and that other listed stakeholders do not directly operate the system in this context."
  ],
  "requirements_met": [
    "The system shall allow the urban mobility planner to request an estimation of the cost of a selected measure so that the financial consequences of the measure can be reviewed.",
    "The system shall calculate and present an estimation of the financial cost of the selected measure to the urban mobility planner.",
    "The system shall allow the urban mobility planner to request an estimation of emissions associated with congestion for a selected measure or event so that the pollution effects can be reviewed.",
    "The system shall calculate and present an estimation of congestion-related emissions for the selected measure or event to the urban mobility planner.",
    "The system shall allow the urban mobility planner to request an estimation of traffic noise levels for a selected traffic situation or measure so that the environmental effects can be reviewed.",
    "The system shall calculate and present an estimation of traffic noise levels for the selected traffic situation or measure to the urban mobility planner.",
    "The system should store the generated estimations together with the evaluated measure or traffic situation so that the urban mobility planner can review them during analysis."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The acceptable accuracy or error margins for cost, congestion-related emission, and noise estimations have not been defined.",
    "The required time constraints for producing estimations (e.g., maximum response time) have not been specified.",
    "The units and formats for presenting cost, emission, and noise estimations (e.g., currency, time horizon, pollutant types, decibel scales) have not been specified.",
    "The policy on how to handle outdated or incomplete underlying data for estimation (e.g., missing sensor data or obsolete cost parameters) has not been determined.",
    "The rules for versioning or tracking changes in estimation models used by the system have not been clarified."
  ],
  "main_flow": [
    "1. Urban mobility planner selects an existing measure or traffic situation to be evaluated → System retrieves the selected measure or traffic situation and prepares it for impact estimation.",
    "2. Urban mobility planner requests estimation of the financial cost of the selected measure → System applies the configured cost estimation model to the selected measure.",
    "3. Urban mobility planner requests estimation of congestion-related emissions for the selected measure or traffic situation → System applies the configured congestion-related emissions estimation model to the selected measure or traffic situation.",
    "4. Urban mobility planner requests estimation of traffic noise levels for the selected traffic situation or measure → System applies the configured traffic noise estimation model to the selected traffic situation or measure.",
    "5. Urban mobility planner confirms completion of the requested estimations → System compiles the cost, congestion-related emissions, and traffic noise estimations and associates them with the selected measure or traffic situation.",
    "6. Urban mobility planner views the compiled estimation results → System presents the estimated financial cost, congestion-related emissions, and traffic noise levels for the selected measure or traffic situation in a structured format."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): The urban mobility planner decides not to request a financial cost estimation for the selected measure. Condition: The planner is only interested in environmental impacts. The planner skips the action in Step 2 and proceeds directly to Step 3 to request congestion-related emissions estimations. The flow then continues with Steps 3 to 6, and the compiled results in Step 6 omit cost estimations.",
    "AF-2 (from Step 3): The urban mobility planner decides not to request a congestion-related emissions estimation. Condition: The planner is only interested in financial or noise impacts. The planner skips the action in Step 3 and proceeds directly to Step 4 to request traffic noise level estimations. The flow then continues with Steps 4 to 6, and the compiled results in Step 6 omit congestion-related emissions estimations.",
    "AF-3 (from Step 4): The urban mobility planner decides not to request a traffic noise level estimation. Condition: The planner is only interested in financial cost or congestion-related emissions. The planner skips the action in Step 4 and proceeds directly to Step 5 to confirm completion of requested estimations. The flow then continues with Steps 5 and 6, and the compiled results in Step 6 omit traffic noise estimations."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): The system cannot retrieve the selected measure or traffic situation due to missing or corrupted data. The system informs the urban mobility planner that the selected measure or traffic situation cannot be evaluated and instructs the planner to select a different measure or to correct the data using existing capabilities outside this use case. The use case is terminated without generating estimations.",
    "EF-2 (from Step 2): The cost estimation model fails to execute or required cost parameters are unavailable. The system records the failure, notifies the urban mobility planner that financial cost estimation cannot be completed, and allows the planner to continue with Steps 3 and 4 to request other estimations. The compiled results in Step 6 exclude financial cost estimations.",
    "EF-3 (from Step 3): The congestion-related emissions estimation model fails to execute or required emission data is unavailable. The system records the failure, notifies the urban mobility planner that congestion-related emissions estimation cannot be completed, and allows the planner to continue with Step 4 and subsequent steps. The compiled results in Step 6 exclude congestion-related emissions estimations.",
    "EF-4 (from Step 4): The traffic noise estimation model fails to execute or required noise-related data is unavailable. The system records the failure, notifies the urban mobility planner that traffic noise estimation cannot be completed, and allows the planner to proceed to Step 5 and 6 with available results. The compiled results in Step 6 exclude traffic noise estimations."
  ],
  "information_for_steps": [
    "1. Measure identifier, measure configuration parameters, traffic situation identifier, existing measure metadata.",
    "2. Cost model parameters, infrastructure modification parameters, operational cost factors, time horizon for cost estimation.",
    "3. Congestion level indicators, traffic volume data, emission factors, time period for emission estimation.",
    "4. Traffic flow characteristics, speed distributions, road type and geometry indicators, noise emission factors, time period for noise estimation.",
    "5. Estimation status flags for cost, emission, and noise; linkage between estimation results and the selected measure or traffic situation.",
    "6. Estimated total cost values, estimated congestion-related emission values, estimated traffic noise level values, presentation layout parameters."
  ]
}