{
  "use_case_name": "Migrate and Synchronize Medical Data",
  "unique_id": "UC-012",
  "area": "Electronic Medical Record Data Management",
  "context_of_use": "Doctors and nurses migrate existing medical data from legacy management systems and synchronize data collected on mobile devices with the central electronic medical record system to ensure that all medically relevant information is centrally stored and up to date.",
  "scope": "Hospital Management System including Electronic Medical Records",
  "level": "User-goal",
  "primary_actors": [
    "doctor",
    "nurse"
  ],
  "supporting_actors": [
    "legacy management system",
    "mobile device"
  ],
  "stakeholders_and_interests": [
    "doctor: Ensures that historical and mobile-collected medical data are preserved and centrally available for clinical decision making.",
    "nurse: Ensures that historical and mobile-collected medical data are preserved and centrally available for supporting patient care.",
    "patient: Expects that no medical data is lost during system transition and that care is based on complete and accurate records.",
    "system administrator: Requires that data migration and synchronization operate reliably within the central database and integrated electronic medical records.",
    "systems analyst: Relies on complete and centrally stored clinical data for prescriptive and predictive analytics.",
    "hospital management: Requires continuity of care and compliance by ensuring that medical records remain complete across system changes."
  ],
  "description": "This use case describes how a doctor or nurse migrates medical data from old management systems to the new hospital management system and synchronizes data collected on mobile devices with the central electronic medical records, using the system’s medical data management capabilities as an included function.",
  "triggering_event": "A doctor or nurse initiates a request to migrate legacy medical data or to synchronize mobile-collected data with the electronic medical records.",
  "trigger_type": "External",
  "preconditions": [
    "The doctor or nurse is an authorized user of the hospital management system.",
    "The doctor or nurse is successfully authenticated in the hospital management system.",
    "The hospital management system is connected to the central database.",
    "At least one legacy management system containing medical data is accessible to the hospital management system for migration.",
    "At least one mobile device containing medical data relevant to patients is available for synchronization with the electronic medical records.",
    "The included \"manage medical data\" functionality is available within the hospital management system."
  ],
  "postconditions": [
    "Selected medical data from the legacy management system have been stored in the central electronic medical records without loss as far as the system can determine.",
    "Selected medical data from the mobile device have been stored in the central electronic medical records.",
    "The migrated and synchronized data are available through the system’s medical data management functions to authorized users.",
    "The system maintains an internal record of completed migration and synchronization operations."
  ],
  "assumptions": [
    "It is assumed that access to legacy management systems is technically possible and that those systems expose medical data in a format that can be processed by the hospital management system without introducing new transformation capabilities beyond basic import operations.",
    "It is assumed that mobile devices are already associated with the hospital management system user accounts and can provide medical data to the system upon request.",
    "It is assumed that conflict resolution rules for overlapping or duplicate medical data are defined within the existing \"manage medical data\" functionality and are not specific to this use case.",
    "It is assumed that data anonymization and GDPR-related controls are handled by existing system-wide security and privacy mechanisms and are not implemented specifically within this use case.",
    "It is assumed that only doctors and nurses initiate migration of medical data from old management systems and synchronization of mobile-collected medical data, as these are the only participating actors described.",
    "It is assumed that the included use case \"manage medical data\" provides the capabilities to create, update, and store medical records in the central database and that this use case merely invokes those capabilities without extending them."
  ],
  "requirements_met": [
    "The system shall allow a doctor to synchronize data from mobile devices with electronic medical records so that data collected on mobile devices is stored centrally.",
    "The system shall allow a doctor to migrate medical data from old management systems to the new system so that no medical data is lost during transition as far as the system can determine.",
    "The system shall allow a nurse to migrate medical data from old management systems to the new system so that no medical data is lost during transition as far as the system can determine.",
    "The system shall store migrated and synchronized medical data in a central database as part of the electronic medical records.",
    "The system shall use its existing medical data management functionality when storing migrated or synchronized data.",
    "The system shall make migrated and synchronized medical data available to authorized users through the existing electronic medical record management functions."
  ],
  "priority": "High",
  "risk": "High",
  "outstanding_issues": [
    "The exact mapping rules between data fields in legacy management systems and fields in the new electronic medical records have not been specified.",
    "The criteria and process for selecting which subsets of legacy data are to be migrated have not been defined.",
    "The frequency, timing, and triggering policy for mobile data synchronization have not been specified.",
    "Error-handling policies for partially migrated or partially synchronized data, including rollback or retry strategies, have not been defined.",
    "The extent to which historical audit trails from legacy systems must be preserved in the new system has not been clarified."
  ],
  "main_flow": [
    "1. Doctor or nurse selects the data migration and synchronization function in the hospital management system → System displays options for legacy data migration and mobile data synchronization available to the authenticated user.",
    "2. Doctor or nurse chooses to perform legacy data migration and selects the source legacy management system and desired patient or data scope → System connects to the specified legacy management system and retrieves a structured list of available medical data for the selected scope.",
    "3. Doctor or nurse reviews the listed legacy medical data and confirms the data set to be migrated → System validates the selected medical data set for migration readiness and prepares it for storage in the central electronic medical records.",
    "4. Doctor or nurse initiates the migration of the confirmed legacy medical data set → System invokes the included \"manage medical data\" functionality to store the migrated data in the central electronic medical records and central database.",
    "5. System completes the storage of the legacy medical data using the medical data management functions → System records the successful completion status of the legacy data migration operation and makes the migrated data available through standard medical record access functions.",
    "6. Doctor or nurse chooses to perform mobile data synchronization and selects the mobile device or associated data source for synchronization → System connects to the selected mobile device or associated data source and retrieves a structured list of available medical data for synchronization.",
    "7. Doctor or nurse reviews the listed mobile-collected medical data and confirms the data set to be synchronized → System validates the selected mobile-collected data set for synchronization readiness and prepares it for storage in the central electronic medical records.",
    "8. Doctor or nurse initiates the synchronization of the confirmed mobile-collected medical data set → System invokes the included \"manage medical data\" functionality to store the synchronized data in the central electronic medical records and central database.",
    "9. System completes the storage of the mobile-collected medical data using the medical data management functions → System records the successful completion status of the mobile data synchronization operation and makes the synchronized data available through standard medical record access functions.",
    "10. Doctor or nurse views a summary of completed migration and synchronization operations → System presents a confirmation summary indicating that legacy and mobile-collected medical data have been centrally stored in the electronic medical records."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): Doctor or nurse chooses a different legacy management system than initially intended before confirming data scope → System refreshes the list of available medical data for the newly selected legacy management system, after which the flow continues with Step 3.",
    "AF-2 (from Step 3): Doctor or nurse decides to exclude certain items from the legacy data set before initiating migration → System updates the prepared migration data set to reflect the exclusions and then proceeds with Step 4.",
    "AF-3 (from Step 6): Doctor or nurse chooses to synchronize only a subset of mobile-collected data types (for example, vital signs or notes) instead of all available mobile data → System filters the retrieved mobile-collected medical data accordingly and then continues with Step 7.",
    "AF-4 (from Step 7): Doctor or nurse adjusts the selected mobile-collected data set by deselecting certain entries before initiating synchronization → System updates the prepared synchronization data set and then proceeds with Step 8."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): The system cannot connect to the selected legacy management system due to connectivity or access issues → System displays an error message indicating that the legacy system is unavailable, logs the failure, and terminates the legacy data migration portion of the use case while allowing the user to return to the main menu.",
    "EF-2 (from Step 4): The system encounters a validation or storage error while invoking the \"manage medical data\" functionality for legacy data migration → System stops the migration operation for the affected data set, records the failure status, notifies the doctor or nurse of the error, and does not mark the legacy data as migrated.",
    "EF-3 (from Step 6): The system cannot connect to the selected mobile device or associated data source → System displays an error message indicating that the mobile data source is unavailable, logs the failure, and terminates the mobile data synchronization portion of the use case while allowing the user to return to the main menu.",
    "EF-4 (from Step 8): The system encounters a validation or storage error while invoking the \"manage medical data\" functionality for mobile data synchronization → System stops the synchronization operation for the affected data set, records the failure status, notifies the doctor or nurse of the error, and does not mark the mobile data as synchronized."
  ],
  "information_for_steps": [
    "1. User identity, user role (doctor or nurse), session information, available migration and synchronization options.",
    "2. Legacy system identifier, access credentials or connection parameters, patient identifiers, data scope selection criteria.",
    "3. Structured list of legacy medical data items, selected data set flags, validation rules and constraints for migration.",
    "4. Prepared legacy medical data set, mapping to electronic medical record fields, invocation parameters for medical data management functions.",
    "5. Migration result status, internal migration log entries, references to newly created or updated electronic medical record entries.",
    "6. Mobile device identifier or associated data source reference, connection parameters, list of available mobile-collected medical data items.",
    "7. Structured list of mobile-collected medical data items, selected data set flags, validation rules and constraints for synchronization.",
    "8. Prepared mobile-collected medical data set, mapping to electronic medical record fields, invocation parameters for medical data management functions.",
    "9. Synchronization result status, internal synchronization log entries, references to newly created or updated electronic medical record entries.",
    "10. Summary report data including counts of migrated and synchronized records, operation timestamps, overall completion status."
  ]
}