{
  "use_case_name": "Manage Traffic Data Sources",
  "unique_id": "UC-003",
  "area": "Traffic Simulation Data Management",
  "context_of_use": "The use case enables a UMD employee to add, configure, and persist traffic-related data sources and time-based snapshots so that the Wonderland traffic simulator operates on complete and up-to-date information.",
  "scope": "Wonderland Traffic Simulation Platform",
  "level": "User-goal",
  "primary_actors": [
    "umd employee"
  ],
  "supporting_actors": [
    "existing data storage infrastructure"
  ],
  "stakeholders_and_interests": [
    "UMD employee: Wants to maintain accurate and complete traffic and environmental data sources to support monitoring, analysis, and simulations.",
    "UMD operations management: Wants the simulator to rely on trustworthy and consistently maintained data for decision-making.",
    "UMD IT department: Wants data management functions to be robust, maintainable, and not require expert intervention by end users.",
    "Environmental regulatory bodies: Want environmental and noise data to be stored accurately for potential verification and reporting.",
    "Urban planners: Want historical and snapshot data to be available to support planning, comparison of scenarios, and evaluation of solutions."
  ],
  "description": "This use case describes how a UMD employee adds new sensor measurements to the map, configures and registers additional traffic-related data sources, stores historical data including simulator snapshots and environmental measurements, and creates time-based snapshots so that the Wonderland traffic simulator can use accurate and complete data sets for current and future analyses.",
  "triggering_event": "A UMD employee decides to register or update traffic-related data sources or to persist time-based data or snapshots for later use in the simulator.",
  "trigger_type": "External",
  "preconditions": [
    "The UMD employee has access credentials that permit management of traffic data sources within the Wonderland Traffic Simulation Platform.",
    "The Wonderland Traffic Simulation Platform is operational and connected to the existing data storage infrastructure.",
    "Relevant raw sensor measurements, environmental data, or other data source endpoints are available to the UMD employee for configuration within the system."
  ],
  "postconditions": [
    "Newly added sensor measurements are registered in the system and associated with their locations on the Wonderland map.",
    "Newly added data sources are configured and stored in the system so that they can be used by the simulator when data is available.",
    "Historical traffic-related data, including simulator data and environmental measurements, is stored with an associated time reference for later retrieval and analysis.",
    "Requested time-based snapshots of simulator data are created and stored with their corresponding time ranges for future simulations and comparisons.",
    "The simulator can access all configured and stored data sources and snapshots when needed for later operations."
  ],
  "assumptions": [
    "It is assumed that the Wonderland Traffic Simulation Platform already supports authentication and authorization of UMD employees and that this use case starts after the employee is authenticated.",
    "It is assumed that the system already has a digital base map of Wonderland onto which sensor measurements and environmental data can be mapped.",
    "It is assumed that the mechanisms for physically collecting sensor and environmental measurements (e.g., field sensors) exist outside the system and that this use case only covers registration and storage of the received data.",
    "It is assumed that the system’s data storage infrastructure is capable of storing time-stamped data and that this use case configures and uses that capability without modifying its underlying implementation.",
    "It is assumed that a 'data source' in this context refers to any external or internal feed of traffic or environmental data that is consumable by the simulator and that the UMD employee can only add data sources that the platform is already technically capable of connecting to.",
    "It is assumed that the UMD employee has sufficient domain knowledge to supply required configuration details for new data sources and to select appropriate time periods for snapshots.",
    "It is assumed that the process of using newly added data sources in simulations is covered by separate use cases and that this use case only ensures that the data sources and snapshots are made available for such use.",
    "It is assumed that the system automatically maintains historical records once configured to store simulator data and environmental measurements and that the employee’s actions in this use case enable and manage that storage behavior."
  ],
  "requirements_met": [
    "The system shall allow a UMD employee to add new sensor measurements to the map when they become available so that the simulator representation is as accurate as possible.",
    "The system shall store all traffic-related historical data so that a UMD employee is able to create meaningful insights about this data at a later moment.",
    "The system shall store the simulator data, including map, traffic, and heat map, for each moment together with its corresponding time reference so that a UMD employee can review it later.",
    "The system shall store environmental measurements for each moment together with their corresponding time reference so that a UMD employee can review them later.",
    "The system shall allow a UMD employee to independently add additional traffic-related data sources at a later time so that the simulator can use the most complete data available.",
    "The system shall allow a UMD employee to configure the use of newly added data sources by the simulator so that these data sources are included in simulations when data is available.",
    "The system shall allow a UMD employee to create snapshots of specific days or parts of days based on stored simulator data so that simulations can be executed against those scenarios."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The required validation rules and quality checks for newly added sensor measurements and data sources have not been specified.",
    "The maximum supported volume and retention period for historical data and snapshots have not been defined.",
    "The required granularity of time references for stored data and snapshots (e.g., seconds, minutes) has not been clarified.",
    "The access control policies determining which UMD employees may manage specific categories of data sources have not been defined.",
    "The expected behavior when an external data source becomes unavailable or changes its format has not been specified."
  ],
  "main_flow": [
    "1. UMD employee selects the traffic data management function in the platform → System displays available options for managing sensor measurements, data sources, historical storage, and snapshots.",
    "2. UMD employee chooses to register new sensor measurements on the map → System prompts the employee to provide sensor identification, location, and measurement type details.",
    "3. UMD employee enters sensor identification, location, and measurement type details and confirms registration → System validates the provided details and registers the sensor measurements, associating them with the corresponding positions on the Wonderland map.",
    "4. UMD employee chooses to add a new traffic-related data source → System prompts the employee to provide data source metadata, access parameters, and data type information.",
    "5. UMD employee provides the required data source configuration information and confirms addition → System validates the configuration and stores the new data source definition for use by the simulator when data becomes available.",
    "6. UMD employee enables storage of historical simulator data, including map, traffic, and heat map information → System confirms that the simulator data will be continuously stored with associated time references for each moment.",
    "7. UMD employee enables storage of historical environmental measurements → System confirms that environmental measurements will be continuously stored with associated time references for each moment.",
    "8. UMD employee selects the option to create a time-based snapshot → System prompts the employee to specify a day or part of a day for which the snapshot should be created.",
    "9. UMD employee specifies the desired date and time range for the snapshot and confirms creation → System retrieves the corresponding stored simulator data for the specified period and creates a named snapshot coupled to that time range.",
    "10. UMD employee reviews the list of configured data sources, registered sensor measurements, and created snapshots → System displays an updated overview indicating that the new data sources, measurements, and snapshots are available for later simulations and analyses, and the use case ends successfully."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): UMD employee decides to skip registering new sensor measurements and only manage other data sources. Condition: The employee does not currently have new sensor measurements to add. The employee cancels the sensor registration action → System returns to the traffic data management options menu and the flow continues at Step 4.",
    "AF-2 (from Step 4): UMD employee decides to modify an existing data source instead of adding a new one. Condition: The employee selects an existing data source from the list. The employee edits configuration parameters and confirms the update → System validates and stores the updated configuration, marks the data source as updated, and returns to Step 6.",
    "AF-3 (from Step 6): Historical simulator data storage is already enabled. Condition: The system indicates that storage is already active. UMD employee reviews the status and chooses not to change the configuration → System retains the existing storage configuration and the flow continues at Step 7.",
    "AF-4 (from Step 7): Historical environmental measurement storage is already enabled. Condition: The system indicates that storage is already active. UMD employee reviews the status and chooses not to change the configuration → System retains the existing storage configuration and the flow continues at Step 8.",
    "AF-5 (from Step 8): UMD employee decides to review existing snapshots instead of creating a new one. Condition: The employee selects the list of existing snapshots. System displays existing snapshots with their associated date and time ranges → UMD employee exits the snapshot function and the flow continues at Step 10."
  ],
  "exception_flows": [
    "EF-1 (from Step 3): Sensor measurement registration fails due to invalid or incomplete data. Condition: Required sensor identification, location, or measurement type details are missing or invalid. System displays an error message indicating which fields must be corrected and does not register the sensor measurements → UMD employee may correct the data and repeat Step 3, or cancel the action and return to the traffic data management options menu.",
    "EF-2 (from Step 5): New data source configuration fails validation or cannot be stored. Condition: Provided access parameters are invalid or the system cannot connect to the data source definition. System notifies the employee of the configuration problem and does not add the data source → UMD employee may adjust the configuration and repeat Step 5, or cancel the action and return to the traffic data management options menu.",
    "EF-3 (from Step 9): Snapshot creation fails because required historical data is unavailable for the specified period. Condition: Stored data for the selected date and time range is missing or incomplete. System informs the employee that the snapshot cannot be fully created for the specified period and does not create a partial snapshot → UMD employee may adjust the time range and repeat Step 9, or cancel snapshot creation and return to Step 10.",
    "EF-4 (from Steps 6 and 7): Enabling historical storage fails due to data storage infrastructure problems. Condition: The system cannot confirm activation of historical storage. System displays an error indicating that storage activation failed and keeps previous storage settings unchanged → UMD employee may retry enabling storage later or contact system support outside of this use case, and the current execution of the use case ends without changing storage behavior."
  ],
  "information_for_steps": [
    "1. Traffic data management menu options; user session context.",
    "2. Sensor registration option; sensor identification prompt; location selection controls; measurement type options.",
    "3. Sensor identification values; geographic location coordinates or map positions; measurement type classification; registration confirmation flag.",
    "4. Data source management option; prompts for data source name, type, endpoint, authentication method, and data category.",
    "5. Data source name; endpoint URL or connection string; authentication credentials or tokens; data type and update frequency parameters; configuration validation result.",
    "6. Historical simulator data storage settings; flags indicating capture of map, traffic, and heat map data; temporal indexing configuration.",
    "7. Historical environmental measurement storage settings; list of environmental measurement types; temporal indexing configuration for environmental data.",
    "8. Snapshot creation option; prompts for selection of date and time range; available time periods derived from historical data.",
    "9. Selected date; selected time range; identifiers of retrieved simulator data records; snapshot name or identifier; association between snapshot and time range.",
    "10. Overview list of registered sensor measurements; list of configured data sources; list of created snapshots with their identifiers and time ranges; status indicators showing that these items are available for later simulations and analyses."
  ]
}