{
  "use_case_name": "Export Archived Data to External System",
  "unique_id": "UC-003",
  "area": "Research Data Archiving and Infrastructure",
  "context_of_use": "The University IT service exports all archived research data from the Bath Data Archive to an external or replacement system in order to avoid dependency on a single archival system and to preserve future access.",
  "scope": "Bath Data Archive System",
  "level": "User-goal",
  "primary_actors": [
    "univitservice"
  ],
  "supporting_actors": [
    "External Archival System"
  ],
  "stakeholders_and_interests": [
    "univitservice: Wants to be able to export all archived data to a different system so that the University is not tied into one system which may become inappropriate in the future.",
    "Researchers and Depositors: Want their archived datasets to remain accessible and intact even if the underlying archive system is replaced.",
    "Bath Data Archive administrator: Wants assurance that exported data remains consistent with archival policies and is not lost during system transitions.",
    "Research Information manager: Wants longitudinal continuity of data and associated metrics across system changes for impact analysis.",
    "Fundingbody: Wants reassurance that there are robust archival plans, including the ability to move data to future systems while preserving integrity.",
    "academicpublisher: Wants persistent access paths between publications and underlying datasets to remain valid after export.",
    "data reuser: Wants continued accessibility to archived datasets even if the archive platform changes."
  ],
  "description": "This use case describes how the University IT service initiates and performs a complete export of all archived data from the Bath Data Archive to an external or replacement system in order to mitigate vendor lock-in while preserving data integrity and accessibility.",
  "triggering_event": "The univitservice decides to transfer all archived data from the Bath Data Archive to an external or replacement system.",
  "trigger_type": "External",
  "preconditions": [
    "The Bath Data Archive System is operational and reachable by the univitservice.",
    "The univitservice is authenticated and authorized to perform a full data export operation.",
    "An external or replacement system or export target location has been provisioned and is reachable from the Bath Data Archive System.",
    "All archived data intended for export is present and logically consistent in the Bath Data Archive System."
  ],
  "postconditions": [
    "A complete export package containing all archived data and associated metadata has been generated by the Bath Data Archive System.",
    "The export package has been transferred to the specified external or replacement system or target location as requested by the univitservice.",
    "The Bath Data Archive System has recorded an auditable log entry for the export operation, including scope, time, and target details.",
    "No archived data within the Bath Data Archive System has been modified or deleted solely as a result of the export operation."
  ],
  "assumptions": [
    "It is assumed that the external or replacement system or target storage accepts data in the export formats provided by the Bath Data Archive System, because the requirement only states that data must be exportable, not how the target ingests it.",
    "It is assumed that the export operation does not change or remove any archived data from the Bath Data Archive System, because the requirement describes export to another system and does not state any migration or deletion behavior.",
    "It is assumed that the univitservice has sufficient storage capacity available on the external or replacement system to receive a complete export of all archived data, because the requirement implies exporting all data but does not address storage provisioning.",
    "It is assumed that the univitservice defines the destination connection parameters or location for the export prior to initiating the export, because the requirement does not describe how the target system is specified.",
    "It is assumed that export may be a long-running operation and that the Bath Data Archive System provides a way to monitor progress and final completion status, because exporting all archived data is likely to be time-consuming.",
    "It is assumed that research data integrity must be preserved during export and that the Bath Data Archive System includes integrity verification information (such as checksums or equivalent integrity metadata) in the export, because the broader requirements emphasise guarantees about data integrity for archival.",
    "It is assumed that access control policies associated with archived data are exported as part of metadata where possible, because the requirement to avoid being tied to one system implies that equivalent management of data should be possible in a future system.",
    "It is assumed that the scope of this use case is a complete export of all archived data and that partial or selective export is outside this use case, because the user story explicitly states the desire to export all data."
  ],
  "requirements_met": [
    "The system shall provide the univitservice with the capability to initiate an export of all archived data to a different system.",
    "The system shall export all archived data, including associated descriptive metadata, in a form that can be transferred to an external or replacement system.",
    "The system shall allow the univitservice to specify or select the external or replacement system or target location to which the archived data will be exported.",
    "The system shall preserve the integrity of archived data during the export process, such that the exported data matches the corresponding data stored in the Bath Data Archive System.",
    "The system shall maintain a log of each full export operation, including initiation time, initiating actor, scope of export, and specified target system or location.",
    "The system shall provide the univitservice with a final status of the export operation indicating whether the export completed successfully or failed.",
    "The system shall perform the export of all archived data without deleting or altering the original archived data as part of this use case."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The required file and metadata formats for the export are not defined and must be agreed (e.g. archival packaging standards, metadata schemas).",
    "The security requirements for transferring archived data to an external or replacement system, including encryption in transit and at rest, have not been specified.",
    "The maximum acceptable duration for completing a full export of all archived data and any associated performance targets have not been defined.",
    "The retention period and storage location for export logs and audit trails have not been specified.",
    "Policies for handling export failures, partial exports, and any necessary rollback or cleanup actions in the target system have not been defined.",
    "The approach to exporting and reconstructing access control and licensing information on the external or replacement system has not been clarified."
  ],
  "main_flow": [
    "1. univitservice reviews institutional needs for system migration or contingency planning and decides to export all archived data to an external or replacement system → Bath Data Archive System prepares to accept a full data export request from the univitservice.",
    "2. univitservice authenticates to the Bath Data Archive System and navigates to the archival data export function → Bath Data Archive System verifies the univitservice credentials and authorizations for performing a full export of archived data.",
    "3. univitservice initiates a request to export all archived data from the Bath Data Archive System → Bath Data Archive System records the initiation of a full export operation and displays configuration options for the export.",
    "4. univitservice specifies the external or replacement system or target location parameters required for the export (such as network destination or storage endpoint) and confirms the export scope as all archived data → Bath Data Archive System validates the provided target parameters and confirms that the requested scope covers all archived data.",
    "5. univitservice confirms and submits the full export request → Bath Data Archive System accepts the request, schedules the export operation, and presents an indication that the export has started.",
    "6. Bath Data Archive System gathers all archived data and associated metadata according to the full export scope → Bath Data Archive System packages the collected archived data and metadata into one or more exportable units while preserving associations between data and metadata.",
    "7. Bath Data Archive System transfers the export packages to the specified external or replacement system or target location → Bath Data Archive System monitors the transfer process and updates export progress information.",
    "8. Bath Data Archive System verifies completion of the export transfer and performs integrity checks on the exported data where possible → Bath Data Archive System records the results of the integrity checks and final outcome of the export operation.",
    "9. Bath Data Archive System finalizes the export operation and generates an export summary including time, scope, target, and status → Bath Data Archive System stores the export summary in an audit log and makes a completion notification available to the univitservice.",
    "10. univitservice views the export completion status and summary information → Bath Data Archive System displays confirmation that all archived data has been exported successfully to the specified external or replacement system."
  ],
  "alternative_flows": [
    "AF-1 (from Step 4): If the univitservice adjusts the export configuration to include descriptive metadata only (without file content) for a preliminary test before a full export, then the Bath Data Archive System shall validate the adjusted configuration, display the resulting scope as descriptive metadata only, and upon confirmation by the univitservice proceed with Steps 5 through 10 using the adjusted scope.",
    "AF-2 (from Step 7): If the export transfer is configured by the univitservice to write export packages to an intermediate staging location under the control of the univitservice instead of directly to a fully integrated external system, then the Bath Data Archive System shall transfer the export packages to the staging location, update the progress information accordingly, and continue with Steps 8 through 10 using the staging location as the export target."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): If the univitservice authentication fails or the univitservice does not have sufficient authorization to perform a full export, the Bath Data Archive System shall deny access to the export function, display an appropriate authorization failure message, not initiate any export operation, and log the failed access attempt; the use case then terminates without exporting data.",
    "EF-2 (from Step 4): If the specified external or replacement system or target location parameters cannot be validated by the Bath Data Archive System (for example, unreachable endpoint or invalid configuration), the Bath Data Archive System shall display an error message describing the configuration problem, request that the univitservice correct the target parameters, and not proceed to Step 5 until valid parameters are provided.",
    "EF-3 (from Step 7): If the transfer of export packages to the external or replacement system fails before completion (such as due to network interruption or insufficient target capacity), the Bath Data Archive System shall stop the export transfer, record the partial progress, mark the export operation as failed in the audit log with error details, and present an error notification and status to the univitservice indicating that the export did not complete; the use case then ends without a successful full export.",
    "EF-4 (from Step 8): If integrity verification of exported data indicates mismatch or corruption compared to the data stored in the Bath Data Archive System, the Bath Data Archive System shall flag the export operation as integrity-failed, record the integrity failure details in the export log, notify the univitservice of the failure and the affected scope, and not mark the export as successfully completed; the use case terminates with a failed export outcome."
  ],
  "information_for_steps": [
    "1. Export decision rationale, migration or contingency planning context.",
    "2. univitservice credentials, authorization roles, session information.",
    "3. Export request type, operation identifier, export scope definition (all archived data).",
    "4. Target system or location parameters (e.g., endpoint address, protocol, path), validation status, confirmed export scope.",
    "5. Export confirmation flag, scheduled start time, initial export status.",
    "6. Archived dataset files, archived dataset metadata records, internal identifiers linking data and metadata, export package identifiers.",
    "7. Export package files, transfer channel information, progress metrics such as bytes transferred and package counts.",
    "8. Integrity verification information such as checksums or equivalent integrity metadata, verification results per export package or dataset.",
    "9. Export summary details including export operation identifier, initiating actor, start and end timestamps, scope description, target description, final status, and logged messages.",
    "10. Export completion status display data, summary information presented to the univitservice, reference to the export log entry."
  ]
}