{
  "use_case_name": "Report Measure Impacts",
  "unique_id": "UC-004",
  "area": "Urban Mobility Planning and Impact Analysis",
  "context_of_use": "The use case supports an urban mobility planner in generating reports that describe the pollution, fairness, cost, and congestion impacts of a selected mobility measure based on previously estimated measure impacts.",
  "scope": "Urban Mobility Planning Decision Support System",
  "level": "User-goal",
  "primary_actors": [
    "urban mobility planner"
  ],
  "supporting_actors": [
    "Existing Impact Estimation Services"
  ],
  "stakeholders_and_interests": [
    "Urban mobility planner: Wants to obtain accurate and comprehensible reports on the impacts of a mobility measure to validate proposals.",
    "City administration (including the mayor): Wants evidence-based justification of mobility measures regarding pollution, fairness, cost, and congestion.",
    "Residents and neighborhoods: Are affected by pollution, congestion, and fairness impacts and expect that these are correctly represented in decision-making.",
    "Environmental agencies: Require transparent reporting of pollution and emissions related to measures.",
    "Financial oversight bodies: Require traceable and consistent reporting of the estimated costs of measures."
  ],
  "description": "This use case describes how an urban mobility planner produces formal reports on the pollution, fairness, cost, and congestion effects of a selected mobility measure using impact data that has already been estimated by the system.",
  "triggering_event": "The urban mobility planner decides to create a report describing the impacts of a specific mobility measure.",
  "trigger_type": "External",
  "preconditions": [
    "The urban mobility planner is authenticated and authorized to access measure impact information in the Urban Mobility Planning Decision Support System.",
    "At least one mobility measure has been defined and stored in the Urban Mobility Planning Decision Support System.",
    "Impact estimations for pollution, fairness, cost, and congestion for the selected measure are already available in the system as a result of previously executed estimation functionality."
  ],
  "postconditions": [
    "A report object describing the pollution, fairness, cost, and congestion impacts of the selected measure is generated by the system.",
    "The generated measure impact report is stored in the Urban Mobility Planning Decision Support System for later retrieval.",
    "The generated measure impact report is made available to the urban mobility planner for review and export."
  ],
  "assumptions": [
    "It is assumed that the Urban Mobility Planning Decision Support System already includes functionality to estimate the impacts of a measure on pollution, fairness, cost, and congestion, corresponding to the referenced \"estimate measure impacts\" included use case.",
    "It is assumed that the term \"report\" refers to a structured document or view generated by the system that summarizes the already estimated measure impacts without recalculating them.",
    "It is assumed that a single selected measure can have all four types of impacts (pollution, fairness, cost, congestion) estimated and that these can be presented together in a single report.",
    "It is assumed that the urban mobility planner can select only measures that have completed impact estimations; the use case does not introduce new capabilities to trigger or configure estimations.",
    "It is assumed that supporting actors such as existing impact estimation services operate as internal services within the system boundary and do not introduce additional external actors."
  ],
  "requirements_met": [
    "The system shall allow the urban mobility planner to generate a report describing the pollution effects of a selected mobility measure in order to support proposal validation.",
    "The system shall allow the urban mobility planner to generate a report describing the fairness effects of a selected mobility measure in order to support proposal validation.",
    "The system shall allow the urban mobility planner to generate a report describing the cost of a selected mobility measure in order to support proposal validation.",
    "The system shall allow the urban mobility planner to generate a report describing the congestion effects of a selected mobility measure in order to support proposal validation.",
    "The system shall use previously estimated measure impacts when generating the measure impact report and shall not modify the underlying estimation results.",
    "The system shall store each generated measure impact report so that it can be accessed later by the urban mobility planner."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "Required report format and layout (e.g., sections, charts, tables, level of detail) for measure impact reports have not been specified.",
    "Export and distribution mechanisms for the measure impact report (e.g., file formats, printing, sharing) are not defined in the requirements.",
    "Versioning and update behavior of reports when underlying impact estimations change have not been clarified.",
    "Localization requirements for report content (language, units, date formats) have not been defined."
  ],
  "main_flow": [
    "1. Urban mobility planner selects the option to create a measure impact report → System prompts the urban mobility planner to select a mobility measure for reporting.",
    "2. Urban mobility planner selects the desired mobility measure for which impacts shall be reported → System confirms the selected measure and prepares to retrieve existing impact estimations.",
    "3. Urban mobility planner confirms the intention to generate a report for the selected measure → System invokes the included \"estimate measure impacts\" functionality to obtain the latest available impact estimations for pollution, fairness, cost, and congestion associated with the selected measure.",
    "4. Urban mobility planner waits while the system gathers the impact data → System retrieves the pollution impact estimation data for the selected measure.",
    "5. Urban mobility planner continues the report generation process → System retrieves the fairness impact estimation data for the selected measure.",
    "6. Urban mobility planner continues the report generation process → System retrieves the cost impact estimation data for the selected measure.",
    "7. Urban mobility planner continues the report generation process → System retrieves the congestion impact estimation data for the selected measure.",
    "8. Urban mobility planner reviews an automatically created summary preview on screen → System compiles the retrieved pollution, fairness, cost, and congestion impact data into a unified measure impact report structure.",
    "9. Urban mobility planner confirms completion of the report generation → System finalizes the measure impact report, stores it in the Urban Mobility Planning Decision Support System, and makes it available for immediate viewing by the urban mobility planner."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): Urban mobility planner decides to change the selected mobility measure before confirming report generation. Condition: After initially selecting a measure, the planner wants to base the report on a different measure. The urban mobility planner selects a different mobility measure instead of the initially chosen one → System updates the displayed selection and uses the newly selected measure as the basis for subsequent impact retrieval and report generation, then the flow continues at Step 3.",
    "AF-2 (from Step 8): Urban mobility planner chooses to exclude one or more impact categories from the final report while still generating a valid report. Condition: The planner wants a report that contains only a subset of impact dimensions (e.g., pollution and cost only) based on already available estimations. The urban mobility planner adjusts report configuration options to include or exclude specific impact categories using the system’s available configuration controls → System updates the report structure to only include the selected impact categories and regenerates the preview accordingly, then the flow continues at Step 9."
  ],
  "exception_flows": [
    "EF-1 (from Step 3): No impact estimations are available for the selected measure. Condition: When invoking the included estimation functionality, the system detects that impact estimations for the selected measure do not exist or cannot be obtained. The system informs the urban mobility planner that the report cannot be generated because required impact estimations are not available for the selected measure and provides a message indicating which impact categories are missing → The system cancels the report generation process and returns the urban mobility planner to the measure selection interface without creating a report.",
    "EF-2 (from Step 4): Retrieval of pollution impact estimation data fails due to a system error. The system notifies the urban mobility planner that an internal error occurred while retrieving pollution impact estimations and that the report generation cannot proceed reliably → The system logs the error and aborts the report generation process, returning the urban mobility planner to the previous screen without saving a report.",
    "EF-3 (from Step 9): Storage of the generated report fails. The system attempts to store the finalized measure impact report and encounters a persistence failure → The system informs the urban mobility planner that the report could not be stored and that it must be regenerated later; the system does not mark the report as available and terminates the use case without a stored report."
  ],
  "information_for_steps": [
    "1. Report creation command, user session identifier, list of available mobility measures.",
    "2. Selected mobility measure identifier, measure name, measure description.",
    "3. Selected mobility measure identifier, request to included \"estimate measure impacts\" functionality, impact categories (pollution, fairness, cost, congestion).",
    "4. Pollution impact estimation data for the selected measure (e.g., estimated emissions, pollution indicators).",
    "5. Fairness impact estimation data for the selected measure (e.g., distribution of benefits and burdens across neighborhoods).",
    "6. Cost impact estimation data for the selected measure (e.g., estimated implementation and operational costs).",
    "7. Congestion impact estimation data for the selected measure (e.g., expected congestion levels or congestion indices).",
    "8. Aggregated impact data set, report structure template, calculated summaries and textual descriptions of impacts.",
    "9. Finalized report content, report identifier, storage status, timestamp, linkage between report and selected mobility measure."
  ]
}