{
  "use_case_name": "Manage Access Control",
  "unique_id": "UC-002",
  "area": "Access Management",
  "context_of_use": "This use case defines and enforces user access levels and restrictions to patient information and system components within the hospital management system.",
  "scope": "Hospital Management System",
  "level": "User-goal",
  "primary_actors": [
    "system administrator",
    "doctor"
  ],
  "supporting_actors": [],
  "stakeholders_and_interests": [
    "system administrator: Ensure patient data protection and compliance with access policies.",
    "doctor: Minimize security risks by restricting patient access to sensitive information."
  ],
  "description": "This use case allows system administrators and doctors to manage user access levels and restrict access to patient information and system components.",
  "triggering_event": "A user requests to manage access control settings.",
  "trigger_type": "External",
  "preconditions": [
    "The user is logged into the hospital management system.",
    "The user has the necessary permissions to manage access control."
  ],
  "postconditions": [
    "Access control settings are updated according to the defined restrictions.",
    "Patients are restricted from viewing information not intended for them."
  ],
  "assumptions": [
    "The system has a mechanism to define and enforce access levels.",
    "Users have been assigned roles that determine their access permissions."
  ],
  "requirements_met": [
    "The system shall allow doctors to restrict patient access to information not intended for them.",
    "The system shall allow system administrators to restrict access to system components for patients.",
    "The system shall allow system administrators to grant different access levels to users."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "Clarification on the specific access levels and restrictions that can be implemented."
  ],
  "main_flow": [
    "1. system administrator → The system displays the access control management interface.",
    "2. system administrator → The system allows the administrator to define access levels.",
    "3. system administrator → The system saves the defined access levels.",
    "4. doctor → The system allows the doctor to restrict patient access to specific information.",
    "5. doctor → The system saves the restrictions applied to patient access."
  ],
  "alternative_flows": [],
  "exception_flows": [],
  "information_for_steps": [
    "1. Access control settings",
    "2. User roles and permissions",
    "3. Patient information access restrictions"
  ]
}