{
  "use_case_name": "View Statistics and Reports",
  "unique_id": "UC-004",
  "area": "League Information and Reporting",
  "context_of_use": "Users access the league management system to view generated match, player, and live game statistics and reports based on authoritative match event data within managed leagues.",
  "scope": "IFA League Management System",
  "level": "User-goal",
  "primary_actors": [
    "fan",
    "ifa",
    "team staff member"
  ],
  "supporting_actors": [
    "match official"
  ],
  "stakeholders_and_interests": [
    "fan: Wants to check statistics of different matches and players and to view live game event reports in order to be more engaged in the league and closely track what is happening.",
    "ifa: Wants to manage leagues centrally and derive player and match statistics directly from reported match events so that no extra work is required and only authorized data sources are used.",
    "team staff member: Wants to access statistics about different matches and players so that they can strategize better.",
    "match official: Wants their live match event reports to be the authoritative source for statistics so that events are not registered twice and unauthorized data sources are prevented.",
    "team manager: Is indirectly interested in accurate statistics for managing team performance and assets within the system.",
    "ifa budget auditor: Is indirectly interested in reliable team, match, and player data that may be used for auditing related activities."
  ],
  "description": "This use case describes how fans, IFA users, and team staff members request and view match, player, and live game statistics and reports that are generated from match event reports within leagues and teams managed by the IFA league management system.",
  "triggering_event": "A fan, IFA user, or team staff member initiates a request to view statistics or reports within the IFA league management system.",
  "trigger_type": "External",
  "preconditions": [
    "The IFA league management system is operational and reachable by the user.",
    "The user has an active account and is authenticated according to the system’s access control rules.",
    "The user has been granted authorization to access statistics and reports relevant to their role within the system.",
    "Leagues and teams relevant to the requested statistics have been created and are managed within the system as part of league and team management.",
    "Match events have been reported by match officials and stored in the system for the matches for which statistics or reports are requested."
  ],
  "postconditions": [
    "The system has generated and presented match, player, or live game statistics and/or reports corresponding to the user’s request.",
    "Only data derived from authorized match event reports and managed league data has been used in the displayed statistics and reports.",
    "The user’s selection criteria for viewed statistics and reports are recorded in the system for subsequent retrieval and auditing."
  ],
  "assumptions": [
    "It is assumed that the \"ifa\" actor in the requirements corresponds to IFA personnel or IFA roles authorized to manage leagues and view statistics within the system.",
    "It is assumed that the \"manage leagues and teams\" included use case ensures that leagues and teams exist in the system with all data required to associate matches, players, and statistics.",
    "It is assumed that match officials report match events directly into the system in a separate use case, and those events are already available for statistics generation when this use case starts.",
    "It is assumed that the system enforces role-based access control so that each actor can only view statistics and reports appropriate to their role and authorization level.",
    "It is assumed that the system supports both historical statistics and ongoing live game statistics derived from reported match events without additional manual data entry.",
    "It is assumed that performance requirements for statistics generation (e.g., for 50,000 concurrent users) are handled by underlying non-functional requirements and do not change the steps of this use case.",
    "It is assumed that league management, including association of matches and players to leagues and teams, is completed and consistent before users request statistics.",
    "It is assumed that only data from match officials recognized by the IFA is treated as an authorized data source for generating player and match statistics."
  ],
  "requirements_met": [
    "The system shall allow fans to check statistics of different matches and statistics of different players to increase their engagement in the league.",
    "The system shall allow fans to view live game event reports in order to closely track what is happening in ongoing matches.",
    "The system shall allow team staff members to access statistics about different matches and different players to support strategic decision-making.",
    "The system shall manage leagues within the system so that all necessary data for matches, teams, and players is accessible from one place for statistics and reports.",
    "The system shall derive player statistics directly from reported match events so that no extra manual work is required.",
    "The system shall derive match statistics directly from reported match events so that no extra manual work is required.",
    "The system shall use game event reports received directly from match officials as the authoritative source for generating player and match statistics.",
    "The system shall restrict user access to statistics and reporting tools and data according to user roles so that users see only relevant tools and information."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The precise granularity and set of match and player statistics to be presented to different actor roles have not been defined.",
    "The required refresh rate and latency limits for live game event reports and live statistics have not been specified.",
    "The retention period and historical depth for accessible statistics and reports have not been stated.",
    "The specific access control rules governing which leagues, teams, and statistics each actor role may view remain to be defined.",
    "The required formats (e.g., tabular, graphical, exportable) for statistics and reports have not been clarified."
  ],
  "main_flow": [
    "1. fan / ifa / team staff member initiates statistics access by navigating to the statistics and reports section of the system → System displays the statistics and reports overview interface, showing available leagues, teams, matches, players, and report types that the user is authorized to access.",
    "2. fan / ifa / team staff member selects a league and optionally associated teams and competitions for which they want to view statistics → System retrieves and displays the selected league and competition context, including available matches and players associated with the managed leagues and teams.",
    "3. fan / ifa / team staff member selects the type of statistics or report to view, such as match statistics, player statistics, or live game reports → System validates the user’s authorization for the chosen statistics or report type and presents relevant filtering and selection options (for example, match, team, player, and time period).",
    "4. fan / ifa / team staff member specifies detailed selection criteria for the requested statistics or report using the provided filters (such as specific match identifiers, team identifiers, player identifiers, and time ranges) → System records the user’s selection criteria and prepares a statistics generation request based on the authorized league and team data and the chosen filters.",
    "5. System processes the statistics generation request by aggregating and deriving match and player statistics from stored match event reports associated with the selected leagues, teams, matches, and players → System computes the requested statistics and constructs a report data set derived solely from authorized match event data and managed league information.",
    "6. System renders the generated statistics and report data set into a human-readable presentation appropriate to the report type (for example, tabular or summary views) → System displays the statistics or report to the user within the statistics and reports interface, ensuring that only data for which the user is authorized is visible.",
    "7. fan / ifa / team staff member reviews the displayed statistics or report and may adjust filters or navigate between related match and player statistics within the same league context → System updates the display in real time according to the refined selection criteria while continuing to rely on underlying managed league and match event data.",
    "8. fan / ifa / team staff member optionally accesses live game reports for an ongoing or recently completed match from within the statistics and reports interface → System retrieves the latest match event data for the selected match and continuously updates the live game report view so that the user can closely track current or very recent events.",
    "9. fan / ifa / team staff member finishes viewing statistics and reports and exits the statistics and reports section → System records the completion of the viewing session and retains the generated statistics and selection parameters for future retrieval and auditing in accordance with system policies."
  ],
  "alternative_flows": [
    "AF-1 (from Step 3): User chooses to view only live game reports for ongoing matches. Condition: The user is specifically interested in live game event reports rather than general historical statistics. The user selects a live-report-specific option within the report type selection. The system immediately presents a list or overview of ongoing matches for which live event data is available and skips historical statistics filter options, then continues with live report retrieval as described in Step 8 and proceeds to Step 9 after the user finishes viewing.",
    "AF-2 (from Step 4): User refines criteria to compare multiple matches or players simultaneously. Condition: The user wants to compare statistics instead of viewing them for a single match or player. The user selects multiple matches or players in the filter interface. The system creates a combined statistics generation request, aggregates statistics for all selected entities, and proceeds with Steps 5 through 7, showing a comparative view instead of a single-entity view before proceeding to Step 9.",
    "AF-3 (from Step 7): User changes league or competition context without exiting the statistics section. Condition: While reviewing statistics, the user decides to switch to another league or competition. The user selects a different league or competition from within the statistics interface. The system updates the available matches, teams, and players according to the new league context and returns to Step 3 for the new context, maintaining the same statistics and reports interface session."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): No leagues or competitions available for the user’s role. Condition: The user’s account is valid but has no associated leagues or competitions managed within the system. The system displays an informative message indicating that no league data is available for this user and provides navigation options back to the main menu. The use case terminates without generating statistics or reports.",
    "EF-2 (from Step 3): User selects a statistics or report type for which they are not authorized. Condition: The user attempts to access a restricted statistics or report type. The system denies the selection, logs the unauthorized attempt, displays an access denied message, and remains on the statistics and reports overview interface, allowing the user to select an authorized report type before continuing with Step 3.",
    "EF-3 (from Step 5): Required match event data is missing or incomplete for the requested statistics. Condition: The system detects that there are insufficient reported match events to compute the requested statistics. The system displays a clear message indicating that statistics cannot be generated because underlying match event data are missing or incomplete and suggests that the user adjust filters or select different matches. The system returns to Step 4 to allow the user to modify the selection criteria or terminate the use case.",
    "EF-4 (from Step 8): Live game event data feed is temporarily unavailable. Condition: The system cannot retrieve up-to-date match event data for the requested live report. The system displays a notification that live updates are currently unavailable and shows the most recent successfully retrieved events if available. The system periodically retries retrieval in the background or allows the user to return to the statistics overview, after which the user may either attempt to reopen the live report (returning to Step 8) or exit the use case at Step 9.",
    "EF-5 (from any Step): System encounters an internal error during statistics or report generation. Condition: An unexpected system error occurs while processing the request. The system logs the error, displays a generic error message indicating that the requested statistics or report could not be generated, and provides navigation back to the statistics and reports overview or the main menu, terminating the current execution of the use case."
  ],
  "information_for_steps": [
    "1. User session identifier, user role, navigation selection, authorized leagues list, authorized competitions list, authorized report types.",
    "2. Selected league identifier, selected competition identifier, associated team identifiers, associated match identifiers, associated player identifiers.",
    "3. Selected report type (match statistics, player statistics, live game reports), user role-based permissions, available filter definitions per report type.",
    "4. Filter parameters including match identifiers, team identifiers, player identifiers, date and time ranges, competition identifiers, comparison selection flags.",
    "5. Match event records, match identifiers, player identifiers, team identifiers, league identifiers, derived metrics configuration, aggregation rules.",
    "6. Generated statistics data set, report layout definitions, formatting rules, user interface components for displaying statistics and reports.",
    "7. Updated filter parameters, navigation state, additional statistics data sets for related matches or players within the same league context.",
    "8. Live match identifier, latest match event records, event timestamps, incremental update state for live report presentation.",
    "9. Session end timestamp, viewed report identifiers, applied filter sets, audit log entries for statistics and reports access."
  ]
}