{
  "use_case_name": "View Appointment Slots",
  "unique_id": "UC-003",
  "area": "Scheduling and Appointment Management",
  "context_of_use": "A receptionist uses the hospital management system to view available appointment slots in provider and room schedules in order to schedule or reschedule patient appointments efficiently.",
  "scope": "Hospital Management System",
  "level": "User-goal",
  "primary_actors": [
    "receptionist"
  ],
  "supporting_actors": [
    "Doctor"
  ],
  "stakeholders_and_interests": [
    "Receptionist: Needs an accurate and up-to-date overview of available appointment slots for doctors, nurses, and rooms to manually schedule, reschedule, or cancel patient appointments.",
    "UHOPE: Requires efficient use of provider and room resources and a scheduling process that reduces manual effort and errors.",
    "Patient: Expects that the receptionist can quickly identify suitable available time slots when the patient calls or visits to schedule or reschedule an appointment.",
    "Doctor: Expects that only available time slots are offered to patients and that displayed schedules accurately reflect existing appointments and availability.",
    "System administrator: Needs the system to enforce appropriate access control so that only authorized receptionists can view provider and room schedules."
  ],
  "description": "This use case describes how a receptionist views the current schedules of doctors, nurses, and rooms in order to identify and review available appointment slots that can be used for scheduling or rescheduling patient appointments.",
  "triggering_event": "The receptionist decides to check the schedules to identify available appointment slots for a patient appointment request.",
  "trigger_type": "External",
  "preconditions": [
    "The receptionist has an active user account with permission to access provider and room schedules in the Hospital Management System.",
    "The receptionist is successfully authenticated in the Hospital Management System.",
    "Schedules for doctors, nurses, and rooms, including existing appointments and blocked times, are stored and up to date in the system.",
    "The system maintains availability rules that determine which time intervals are considered available appointment slots based on existing appointments and provider schedules."
  ],
  "postconditions": [
    "The receptionist has viewed a current schedule that includes the available appointment slots for the selected provider, room, and/or nurse for the specified date or date range.",
    "The receptionist can identify at least one open appointment slot that can be used for scheduling or rescheduling a patient appointment, if such a slot exists.",
    "The system has not modified any schedule or appointment data as a result of this use case; all actions are read-only.",
    "If supported by configuration, the receptionist’s most recently used filter options (such as provider, room, and date range) are stored in the user session for reuse during the same login session."
  ],
  "assumptions": [
    "It is assumed that the receptionist has already performed any required authentication steps, including two-factor authentication where applicable, before initiating this use case, even though the requirement text focuses on scheduling needs rather than login steps.",
    "It is assumed that the hospital management system can compute availability from existing schedules and appointments in order to distinguish between occupied and free time slots, although the exact algorithm for determining availability is not described in the requirement text.",
    "It is assumed that provider (doctor and nurse) schedules and room schedules are integrated into a single scheduling system that the receptionist can access, because the requirement text states that the receptionist wants a scheduling system that shows schedules of doctors, nurses, and rooms.",
    "It is assumed that the system provides basic filtering options such as provider selection, date selection, and room selection to allow the receptionist to focus on relevant time slots, even though the precise filtering fields are not enumerated in the requirement text.",
    "It is assumed that the information presented in the schedules is read-only for the receptionist during this use case and that any modification of appointments is handled by separate use cases, since the requirement text only refers to viewing schedules and choosing timeslots here."
  ],
  "requirements_met": [
    "The system shall allow a receptionist to view a doctor’s schedule so that the receptionist can check the doctor’s availability when scheduling or rescheduling appointments.",
    "The system shall allow a receptionist to view the schedule of all doctors through the scheduling system so that the receptionist can reschedule appointments if needed.",
    "The system shall allow a receptionist to view the schedule of all nurses through the scheduling system so that the receptionist can assign a nurse to an appointment.",
    "The system shall allow a receptionist to view the room schedule through the scheduling system so that the receptionist can assign appointments to specific rooms.",
    "The system shall visually distinguish available appointment slots from occupied or blocked times in provider and room schedules that are displayed to the receptionist.",
    "The system shall allow a receptionist to apply selection criteria such as provider and date to view the corresponding available appointment slots.",
    "The system shall restrict the receptionist to read-only access when viewing schedules and available appointment slots within this use case."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The exact time granularity of appointment slots (for example, 10 minutes, 15 minutes, or 30 minutes) is not specified and requires definition.",
    "The rules for determining availability (such as handling provider breaks, administrative time, or overlapping appointments) are not fully specified and require clarification.",
    "The required maximum period into the future or past for which the receptionist must be able to view schedules and available slots has not been defined.",
    "It is unclear whether the receptionist should be able to apply advanced filters such as specialty, type of appointment, or patient-specific constraints when viewing available appointment slots.",
    "Performance requirements, such as maximum acceptable response time for loading complex multi-provider schedules, have not been specified."
  ],
  "main_flow": [
    "1. Receptionist selects the scheduling function to view provider and room schedules in the Hospital Management System → System displays the scheduling interface with options to select providers, rooms, and date or date range.",
    "2. Receptionist specifies selection criteria for viewing availability (such as one or more doctors, nurses, rooms, and a date or date range) → System validates the provided selection criteria and prepares to retrieve corresponding schedule data.",
    "3. Receptionist confirms the request to view schedules using the chosen selection criteria → System retrieves the schedules for the selected providers and rooms for the specified date or date range, including all existing appointments and blocked times.",
    "4. Receptionist waits while the system processes the request → System computes which time intervals are available appointment slots based on existing appointments and availability rules for the selected providers and rooms.",
    "5. Receptionist views the resulting schedule display → System presents the schedules for the selected providers and rooms, clearly indicating occupied times and highlighting available appointment slots.",
    "6. Receptionist reviews the available appointment slots for suitability (for example, time of day and duration) → System maintains the current view and allows the receptionist to continue examining different time slots within the displayed schedule.",
    "7. Receptionist decides whether additional schedule information is needed → System keeps the current selection criteria active for the session and waits for further actions such as adjusting filters, scrolling through dates, or closing the scheduling view."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): If the receptionist does not specify any provider but selects only a room and date range, the system retrieves and displays the room schedule with occupied times and available appointment slots for that room only; the use case then continues at Step 5.",
    "AF-2 (from Step 2): If the receptionist selects multiple doctors and a shared room for a specific date, the system retrieves and displays combined schedules for all selected doctors and the room on that date, showing overlapping and available slots; the use case then continues at Step 5.",
    "AF-3 (from Step 5): If the receptionist changes the selection criteria (for example, selects a different doctor or adjusts the date range) while viewing the schedule, the system applies the new criteria, repeats retrieval and availability computation as in Steps 3 and 4, and updates the schedule view before continuing again at Step 5."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): If the receptionist enters invalid selection criteria (such as an invalid date format or a non-existent provider identifier), the system informs the receptionist of the invalid input, highlights the erroneous fields, and prompts for correction before allowing the use case to continue from Step 2.",
    "EF-2 (from Step 3): If the system cannot retrieve the schedule data due to a data access or connectivity error, the system logs the error, informs the receptionist that schedules are temporarily unavailable, and terminates the current execution of the use case without displaying incomplete schedule information.",
    "EF-3 (from Step 5): If the receptionist’s session expires while viewing the schedule, the system hides schedule details, informs the receptionist that the session has expired, and requires re-authentication; after successful login, the receptionist may restart the use case from Step 1.",
    "EF-4 (from Step 1): If the receptionist does not have sufficient access rights to view provider or room schedules, the system denies access to the scheduling view, informs the receptionist that permissions are insufficient, and terminates the use case without revealing any schedule information."
  ],
  "information_for_steps": [
    "1. User role, user session, scheduling function identifier.",
    "2. Selected doctor identifiers, selected nurse identifiers, selected room identifiers, selected date or date range.",
    "3. Provider schedule records, room schedule records, existing appointments and blocked time intervals for the specified selection.",
    "4. Availability rules, computed free time intervals for each selected provider and room.",
    "5. Schedule view configuration, visual indicators for occupied times, visual indicators for available appointment slots.",
    "6. Displayed appointment slot list or grid, time-of-day and duration for each available slot, scrolling or navigation state.",
    "7. Current filter criteria, session-level storage of most recent provider and date selections, scheduling view state."
  ]
}