{
  "use_case_name": "Manage Traffic Data",
  "unique_id": "UC-003",
  "area": "Traffic Data Management and Persistence",
  "context_of_use": "UMD employees manage traffic-related data within the simulation platform in order to keep the simulator and analyses based on it accurate and complete over time.",
  "scope": "Wonderland Traffic Simulation Platform",
  "level": "User-goal",
  "primary_actors": [
    "umd employee"
  ],
  "supporting_actors": [
    "time source"
  ],
  "stakeholders_and_interests": [
    "UMD employee: Wants accurate, complete, and timely traffic and environmental data to support monitoring, simulation, and decision making.",
    "UMD management: Wants reliable, durable data storage to enable long-term analyses and evidence-based urban planning decisions.",
    "Urban planners: Want trustworthy historical and snapshot data to compare different planning and solution scenarios.",
    "IT operations: Wants predictable data growth and robust data handling to ensure system availability and performance."
  ],
  "description": "This use case describes how a UMD employee uses the traffic simulation platform to access the platform, add new sensor measurements and data sources, and persist simulator and environmental data over time (including time-coupled states and snapshots) so that the simulator remains accurate and historical data is available for later analysis and simulations.",
  "triggering_event": "A UMD employee decides to manage traffic-related data within the simulation platform, such as adding new sensor measurements, adding a new data source, or persisting simulator or environmental data for later use.",
  "trigger_type": "External",
  "preconditions": [
    "The Wonderland Traffic Simulation Platform is deployed and operational.",
    "The UMD employee has valid access rights to use the simulation platform.",
    "Required connectivity to underlying data storage is available.",
    "Existing sensor and simulator data, if any, have been previously ingested or configured according to organizational procedures."
  ],
  "postconditions": [
    "The selected traffic and environmental data are stored in the platform with an association to the relevant time information.",
    "Any newly added sensor measurements are associated with their corresponding map locations within the platform.",
    "Any newly added data sources are registered in the platform and available for subsequent data collection and storage operations.",
    "Any created snapshots of specific days or parts of days are stored and marked for later simulation use."
  ],
  "assumptions": [
    "It is assumed that user authentication and authorization are handled by the included 'access simulation platform' use case and are successful before data management actions are performed.",
    "It is assumed that the platform has an internal concept of the current time or can obtain time information from a time source when storing time-coupled data.",
    "It is assumed that the UMD employee provides sensor measurements and configuration details for new data sources in a format supported by the platform.",
    "It is assumed that the act of saving 'all historical data' refers to persisting data that the platform currently holds at or over time, without retroactively importing data from external systems not interfaced through this platform.",
    "It is assumed that taking snapshots of specific days or parts of days means persisting the simulator state for the specified period in a way that can later be referenced for running simulations.",
    "It is assumed that adding new data sources and adding new sensor measurements do not alter or bypass any existing data validation or integrity rules implemented in the platform.",
    "It is assumed that the relationships field specifying an 'include' of 'access simulation platform' implies that successful platform access is a mandatory part of this use case before any manage-data actions are executed."
  ],
  "requirements_met": [
    "The system shall allow a UMD employee to add new sensor measurements to the map when they become available so that the simulator remains as accurate as possible.",
    "The system shall allow a UMD employee to save all available historical traffic and environmental data so that the employee can create meaningful insights about this data at a later moment.",
    "The system shall allow a UMD employee to save the simulator data, including map, traffic, and heatmap, at each relevant moment coupled to that specific time so that the employee can inspect those simulator states at a later moment.",
    "The system shall allow a UMD employee to save environmental measures at each relevant moment coupled to that specific time so that the employee can inspect those measurements at a later moment.",
    "The system shall allow a UMD employee to independently add additional data sources so that the platform can keep up to date with the most complete data.",
    "The system shall allow a UMD employee to take snapshots of specific days or parts of days so that simulations can later be executed against those scenarios.",
    "The system shall associate all stored simulator data and environmental measurements with time information that can be used for later retrieval and analysis.",
    "The system shall ensure that newly added data sources and sensor measurements become available for inclusion in subsequent simulator states and stored datasets."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The policy for how frequently simulator data and environmental measures must be saved (e.g., sampling interval) has not been defined.",
    "The retention period and archival strategy for historical and snapshot data have not been specified.",
    "The validation rules and quality thresholds for accepting new sensor measurements and newly added data sources are not yet defined.",
    "The expected maximum volume of historical and snapshot data and any limits on storage growth are not clarified.",
    "The required time precision and time zone handling for time-coupled data storage are not specified."
  ],
  "main_flow": [
    "1. umd employee initiates the management of traffic data by opening the simulation platform user interface → System invokes the included 'access simulation platform' behavior to authenticate and authorize the umd employee and displays the main data management functions available to the employee.",
    "2. umd employee chooses to add new sensor measurements to the map and provides the measurement values and corresponding locations → System validates the provided sensor measurement data and associates each measurement with the specified map locations.",
    "3. umd employee confirms storing the new sensor measurements → System stores the validated sensor measurements in persistent storage and updates the map representation to reflect the new measurements.",
    "4. umd employee chooses to save all currently available historical data maintained by the platform → System collects the currently available historical traffic, simulator, and environmental data and prepares it for persistent storage as historical records.",
    "5. umd employee confirms the historical data storage operation → System persists the assembled historical data set and records metadata indicating the scope and time range of the stored historical data.",
    "6. umd employee chooses to save the current simulator data, including map, traffic, and heatmap, coupled to the current time → System captures the current simulator state (map, traffic, and heatmap) and associates this state with the current time obtained from the time source.",
    "7. umd employee confirms storing the captured simulator state → System stores the time-coupled simulator state in persistent storage, making it available for later inspection.",
    "8. umd employee chooses to save the current environmental measures coupled to the current time → System captures the current environmental measurement values and associates them with the current time obtained from the time source.",
    "9. umd employee confirms storing the captured environmental measures → System stores the time-coupled environmental measurement set in persistent storage, making it available for later inspection.",
    "10. umd employee chooses to independently add a new data source by providing the required configuration details → System validates the provided configuration for the new data source and registers the data source in the platform.",
    "11. umd employee confirms activation of the new data source → System activates the registered data source so that its data can be collected and included in subsequent storage operations.",
    "12. umd employee chooses to take a snapshot of a specific day or part of a day by specifying the desired time period → System identifies the simulator and environmental data corresponding to the specified time period and assembles a snapshot definition.",
    "13. umd employee confirms creating the snapshot for the specified time period → System stores the snapshot associated with the specified time period in persistent storage and marks it as available for use in later simulations.",
    "14. umd employee ends the data management session → System closes the data management functions and maintains all previously stored data and snapshots for future access."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): The umd employee decides to skip adding new sensor measurements and proceed directly to storing historical or time-coupled data. Condition: The employee navigates away from the add-sensor-measurements function without providing or confirming new measurements. The flow continues at Step 4.",
    "AF-2 (from Step 4): The umd employee decides to store only a selected subset of historical data rather than all currently available historical data. Condition: The employee filters or selects a subset of historical data before confirmation. The system collects and prepares only the selected subset for storage, and the flow continues with Step 5 treating the subset as the historical data to be persisted.",
    "AF-3 (from Step 6): The umd employee chooses to capture simulator data corresponding to a specific past time rather than the current time. Condition: The employee selects a past time from available stored states before confirmation. The system retrieves the simulator state for the selected time and associates it with that specified time for the new storage operation, and the flow continues at Step 7.",
    "AF-4 (from Step 8): The umd employee chooses to capture environmental measures corresponding to a specific past time rather than the current time. Condition: The employee selects a past time from available stored measurements. The system retrieves the environmental measures for the selected time and prepares them for storage as a new time-coupled record, and the flow continues at Step 9.",
    "AF-5 (from Step 12): The umd employee chooses to define multiple snapshots for several non-contiguous time periods in one operation. Condition: The employee specifies more than one distinct time period before confirmation. The system assembles snapshot definitions for each specified period and, upon confirmation in Step 13, stores each snapshot associated with its respective time period before proceeding to Step 14."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): The system fails to complete the included 'access simulation platform' behavior due to authentication or authorization failure. The system denies access to the data management functions, displays an error message indicating that access is not permitted, and the use case terminates without performing any data management actions.",
    "EF-2 (from Step 2): The system detects invalid or incomplete sensor measurement data (such as missing values or invalid locations). The system rejects the invalid sensor measurements, displays validation feedback to the umd employee, and prompts the employee to correct the data or cancel the operation. If the employee corrects the data, the flow resumes at Step 2; if the employee cancels, the flow continues at Step 4.",
    "EF-3 (from Step 4): The system cannot collect the currently available historical data due to a data storage access error. The system informs the umd employee that historical data cannot be retrieved at this time, logs the error, and returns to displaying the main data management functions without performing the historical data storage operation. The use case may continue with other management actions such as Steps 6, 8, 10, or 12.",
    "EF-4 (from Step 7): The system encounters a failure while storing the time-coupled simulator state (for example, insufficient storage capacity or write failure). The system reports that saving the simulator state has failed, logs the failure, and maintains the system in a consistent state without partial storage of the simulator state. The flow returns to displaying the option to attempt the simulator state storage again or proceed to another action such as Step 8, 10, or 12.",
    "EF-5 (from Step 9): The system encounters a failure while storing the time-coupled environmental measures. The system reports the failure to the umd employee, logs the failure, and ensures that no partial environmental measurement record is committed. The flow returns to displaying the option to retry environmental measures storage or to perform other actions such as Step 10 or 12.",
    "EF-6 (from Step 10): The system detects invalid configuration details for a new data source (such as unreachable endpoint or missing required parameters). The system rejects the data source configuration, displays validation feedback to the umd employee, and prompts for correction or cancellation. If corrected, the flow resumes at Step 10; if canceled, the use case continues with other available actions such as Step 12.",
    "EF-7 (from Step 13): The system fails to store one or more snapshots for the specified time period or periods due to a storage or processing error. The system informs the umd employee that snapshot creation has failed, logs the error, and does not mark the failed snapshots as available. The flow returns to displaying the option to recreate the snapshots or to perform other actions before termination at Step 14."
  ],
  "information_for_steps": [
    "1. User credentials; access rights; platform main menu configuration.",
    "2. Sensor identifiers; measurement values; measurement timestamps if provided by the employee; map location references (such as coordinates or street segments).",
    "3. Persisted sensor measurement records; map layer update information; confirmation status.",
    "4. References to historical traffic, simulator, and environmental datasets; time ranges of available data.",
    "5. Historical data records; metadata describing scope, data types, and time range of stored historical data.",
    "6. Current simulator state including map configuration, traffic data, and heatmap values; current time obtained from the time source.",
    "7. Time-coupled simulator state records; storage identifiers and associated timestamps.",
    "8. Current environmental measurement values per measurement point; current time obtained from the time source.",
    "9. Time-coupled environmental measurement records; storage identifiers and associated timestamps.",
    "10. New data source configuration details such as identifiers, connection information, and supported data types; validation status.",
    "11. Data source activation status; association of the data source with relevant data collection processes.",
    "12. Selected date or time interval defining the specific day or part of the day; references to simulator and environmental data within that interval.",
    "13. Snapshot definitions linking selected time periods to stored simulator and environmental data; snapshot identifiers and metadata for later simulation use.",
    "14. Session state closure information; references to all data and snapshots stored during the session."
  ]
}