{
  "use_case_name": "Edit Medical Records",
  "unique_id": "UC-013",
  "area": "Electronic Medical Record Management",
  "context_of_use": "Authorized healthcare stakeholders use the system to update specific fields and notes within medical records to keep clinical information accurate and current while maintaining confidentiality.",
  "scope": "Medical Record Management System",
  "level": "User-goal",
  "primary_actors": [
    "doctor",
    "patient",
    "lab specialist"
  ],
  "supporting_actors": [
    "authentication service"
  ],
  "stakeholders_and_interests": [
    "doctor: Needs to update assigned patient medical records and notes to ensure accurate clinical information and effective ongoing treatment.",
    "patient: Needs to update certain personal or lifestyle-related parts of their own medical record to keep it current and maintain control over their information.",
    "lab specialist: Needs to update assigned patient medical records to reflect up-to-date laboratory-related information and observations.",
    "healthcare organization: Needs consistent and accurate medical records to support safe clinical decisions and regulatory compliance.",
    "system administrator: Needs the system to enforce access control so that only authorized, authenticated users can edit medical records."
  ],
  "description": "This use case describes how authenticated and authorized actors edit specific parts of medical records they are allowed to modify, including updating fields and managing clinical notes, after successfully accessing the relevant medical record.",
  "triggering_event": "An authenticated doctor, patient, or lab specialist decides to modify information in an accessible medical record.",
  "trigger_type": "External",
  "preconditions": [
    "The system is operational and reachable by the actors.",
    "The actor has a valid user account in the system.",
    "The actor is successfully authenticated by the authentication service.",
    "The actor has successfully accessed a medical record that they are authorized to view.",
    "The medical record to be edited exists in the system.",
    "The actor has edit permissions for the sections of the medical record they intend to modify."
  ],
  "postconditions": [
    "All submitted and accepted changes to the medical record are stored persistently in the system.",
    "The updated medical record is available for subsequent viewing by authorized users.",
    "The system maintains a record of the edit operation, including the editor identity and timestamp, to support traceability.",
    "Data access restrictions on the medical record remain enforced according to existing assignment and confidentiality rules."
  ],
  "assumptions": [
    "It is assumed that authentication is handled by a separate authentication service, since the target use case has an \"authenticate\" include relationship.",
    "It is assumed that the ability to access a medical record, including assignment-based visibility restrictions, is handled by a separate \"access medical records\" use case, referenced by the include relationship.",
    "It is assumed that the system implements role-based or assignment-based access control so that only assigned doctors and lab specialists can edit corresponding patient medical records.",
    "It is assumed that patients can only edit specific allowed sections of their own medical records, such as lifestyle or self-reported information, and cannot modify clinician-authored diagnostic or treatment data.",
    "It is assumed that doctors and lab specialists can only edit those parts of the patient records that fall within their professional responsibility and assignment in the system.",
    "It is assumed that the system maintains an audit trail for all modifications to medical records to support accountability, even though the requirement text does not explicitly mention auditing.",
    "It is assumed that the user interface clearly distinguishes editable fields from read-only fields to prevent unintended modification attempts.",
    "It is assumed that concurrent edits to the same record section are controlled by the system through locking or conflict detection mechanisms, although the detailed mechanism is not specified in the requirement text."
  ],
  "requirements_met": [
    "The system shall allow a patient to edit specific parts of their own medical record in order to keep the record updated.",
    "The system shall allow a doctor to edit specific parts of the medical record of patients to whom the doctor is assigned in order to keep the record updated and visible to other involved users.",
    "The system shall allow a lab specialist to edit specific parts of the medical record of patients to whom the lab specialist is assigned in order to keep the record updated and visible to other involved users.",
    "The system shall allow a doctor to add and edit notes in different parts of a patient’s medical record to support better assessment of the patient’s situation and future review of the record.",
    "The system shall require that only authenticated users can initiate an edit of a medical record.",
    "The system shall require that the user has successfully accessed a medical record before being able to edit it.",
    "The system shall enforce that doctors and lab specialists can edit only those medical records for which they have assignment-based edit authorization.",
    "The system shall enforce that patients can edit only their own medical records and only in the sections configured as patient-editable.",
    "The system shall persist all accepted edits to the medical record so that subsequent authorized viewers can see the updated information."
  ],
  "priority": "High",
  "risk": "High",
  "outstanding_issues": [
    "The exact set of medical record fields that each actor role (patient, doctor, lab specialist) is allowed to edit has not been formally specified.",
    "Policies for resolving conflicting concurrent edits to the same medical record section by different authorized users are not defined.",
    "The maximum size and format constraints for notes and edited fields in medical records are not defined.",
    "The retention and detailed structure of the audit trail for medical record edits, including who can view the audit history, are not specified.",
    "Error messaging and user feedback standards for failed or partially successful save operations are not described."
  ],
  "main_flow": [
    "1. Actor (doctor, patient, or lab specialist) initiates sign-in to the system → System invokes the authentication service and presents the authentication interface.",
    "2. Actor submits valid authentication credentials → System verifies the credentials via the authentication service and establishes an authenticated session for the actor.",
    "3. Actor requests access to a specific medical record they intend to edit → System evaluates the actor’s access rights and displays the medical record details according to the \"access medical records\" functionality.",
    "4. Actor selects the option to edit the medical record → System switches the medical record view to edit mode and highlights the fields and sections that the actor is permitted to modify.",
    "5. Actor modifies one or more editable data fields within the medical record (for example, specific medical, lifestyle, or laboratory-related information) → System captures the updated field values in the current editing session without yet committing them to permanent storage.",
    "6. Actor adds, edits, or deletes notes in the allowed note sections of the medical record, in accordance with their role permissions → System captures the updated note content and associates it with the relevant parts of the medical record in the current editing session.",
    "7. Actor reviews the pending changes and chooses to save the modifications → System validates the modified data against business and format rules and, if all validations succeed, prepares the updates for storage.",
    "8. Actor confirms the save operation if the system requests confirmation → System commits the validated changes to persistent storage, updates the medical record, and records the editor identity and timestamp for the modifications.",
    "9. Actor requests to view the updated medical record → System displays the updated medical record, including all successfully saved field and note changes, to the actor in view mode."
  ],
  "alternative_flows": [
    "AF-1 (from Step 5): Actor decides to modify only note content without changing any other medical record fields. Condition: The actor’s intended update is limited to notes. The actor directly proceeds to Step 6 to add or edit notes, then continues with Step 7 to save the combined note-only changes and proceeds to Step 9 after successful save.",
    "AF-2 (from Step 7): Actor decides to continue editing after initial validation but before final save. Condition: After the system validates the data and before the actor confirms saving, the actor chooses to adjust some of the edited fields or notes. The system returns the actor to the edit view with the current unsaved changes, allowing additional modifications, after which the flow resumes at Step 7 for revalidation and continues to Step 8 and Step 9 on successful save."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): Authentication failure. Condition: The actor submits invalid or expired authentication credentials. System response: The system rejects the authentication attempt, displays an appropriate error message, does not establish a session, and logs the failed attempt. The use case ends without allowing access or editing of any medical record.",
    "EF-2 (from Step 3): Access to the selected medical record is not authorized. Condition: The actor requests a medical record for which they lack view or edit rights. System response: The system denies access to the requested medical record, informs the actor that they are not authorized to access this record, and does not display any record details. The use case ends without further steps.",
    "EF-3 (from Step 5): Actor attempts to modify a non-editable field. Condition: The actor tries to change a part of the medical record that is configured as read-only for their role. System response: The system prevents the modification, maintains the original value of the non-editable field, and informs the actor that the field cannot be edited. The actor may continue editing other permitted fields by returning to Step 5 or cancel the edit, ending the use case.",
    "EF-4 (from Step 7): Data validation failure. Condition: One or more edited fields or notes fail system validation rules (for example, invalid format or mandatory field left empty). System response: The system does not save any of the invalid changes, presents validation error messages indicating the problematic fields, and keeps the actor in edit mode. The actor may correct the data and retry validation from Step 7 or cancel the edit, in which case the use case ends without persisting invalid changes.",
    "EF-5 (from Step 8): Failure to commit changes. Condition: A technical problem (such as a storage error or connectivity loss) occurs while committing the validated changes to persistent storage. System response: The system reports that saving has failed, does not apply partial updates, and maintains the previous stable version of the medical record. The actor may attempt to save again from Step 7, if the session is still active, or terminate the session, ending the use case without successful update."
  ],
  "information_for_steps": [
    "1. Authentication request data, user identifier, authentication method selection.",
    "2. Authentication credentials, session token, actor role information.",
    "3. Medical record identifier, actor access rights, assignment data linking actor and patient.",
    "4. Edit mode flag, list of editable fields per role, user interface configuration for edit operations.",
    "5. Editable field values, such as patient-entered information, clinician-entered clinical data, or lab-related parameters.",
    "6. Note content, note type or category, association between notes and specific sections of the medical record, editor identity for notes.",
    "7. Aggregated pending changes, validation rules, error messages for invalid fields, confirmation prompt indicator.",
    "8. Committed change set, persistence status, audit trail entries including editor identity and timestamp.",
    "9. Updated medical record data, including revised fields and notes, display parameters for view mode."
  ]
}