{
  "use_case_name": "Manage Appointments",
  "unique_id": "UC-008",
  "area": "Appointment Management",
  "context_of_use": "The use case enables a receptionist to authenticate to the system, book a patient appointment, and assign an appropriate doctor when the patient cannot or does not choose one.",
  "scope": "Medical Record and Appointment Management System",
  "level": "User-goal",
  "primary_actors": [
    "receptionist"
  ],
  "supporting_actors": [
    "patient",
    "doctor"
  ],
  "stakeholders_and_interests": [
    "Receptionist: Wants to efficiently book appointments and assign doctors for patients.",
    "Patient: Wants to obtain an appointment with a suitable doctor even if they do not know which doctor to choose.",
    "Doctor: Wants to receive appointments that correctly reference them as the assigned doctor.",
    "Hospital Administration: Wants appointment scheduling and doctor assignment to be accurate and traceable for operational efficiency."
  ],
  "description": "This use case describes how a receptionist authenticates to the system, books an appointment for a patient, and assigns a doctor to that appointment when required.",
  "triggering_event": "The receptionist decides to book an appointment for a patient in the system.",
  "trigger_type": "External",
  "preconditions": [
    "The system is operational and accessible.",
    "The receptionist has valid system credentials.",
    "The patient exists in the system or the organization has provided sufficient patient identification to be used during booking.",
    "At least one doctor is available in the system to be assigned to appointments."
  ],
  "postconditions": [
    "A new appointment record is stored in the system for the specified patient.",
    "A doctor is associated with the newly created appointment.",
    "The appointment is available for later retrieval by authorized users."
  ],
  "assumptions": [
    "It is assumed that receptionist authentication is performed via an existing system use case named \"authenticate\" that validates the receptionist’s credentials before any appointment management actions are allowed.",
    "It is assumed that patient and doctor records already exist in the system and can be selected by the receptionist during appointment booking and doctor assignment.",
    "It is assumed that basic patient information (such as patient identifier) is available to the receptionist at the time of booking.",
    "It is assumed that the system enforces that exactly one doctor is assigned to an appointment as the primary doctor during this use case.",
    "It is assumed that appointment time, date, and location are captured as part of the booking process, even though they are not explicitly mentioned in the requirement text.",
    "It is assumed that the receptionist can choose a doctor on behalf of the patient when the patient does not know or does not specify any doctor."
  ],
  "requirements_met": [
    "The system shall allow a receptionist to book an appointment for a patient with a doctor.",
    "The system shall allow a receptionist to assign a doctor for a patient when booking an appointment, so that if the patient does not know any doctors, the receptionist can assign one.",
    "The system shall require a receptionist to be authenticated before booking or modifying appointments."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "Business policy for selecting an \"appropriate\" doctor (e.g., specialty, workload, patient preference) is not defined.",
    "Rules regarding appointment time-slot availability and potential conflicts between appointments are not specified.",
    "It is unclear whether the receptionist may modify or cancel an existing appointment within this use case or if that is handled by a separate use case.",
    "Notification behavior for patients and doctors after an appointment is booked is not specified."
  ],
  "main_flow": [
    "1. Receptionist initiates the appointment management function in the system → System prompts the receptionist to authenticate (included use case \"authenticate\").",
    "2. Receptionist provides authentication credentials → System validates the credentials and grants the receptionist access to appointment management functions.",
    "3. Receptionist selects the option to create a new appointment → System displays a form to capture patient, doctor, and appointment details.",
    "4. Receptionist identifies or selects the patient for whom the appointment is to be booked → System displays the selected patient information in the appointment form.",
    "5. Receptionist selects a doctor to be associated with the appointment, which may be chosen on behalf of the patient → System links the selected doctor to the appointment being created.",
    "6. Receptionist enters the appointment scheduling details, including date, time, and any required location information → System validates the entered appointment details for completeness and format.",
    "7. Receptionist confirms the creation of the appointment → System creates and stores the appointment record linking the patient and the assigned doctor.",
    "8. Receptionist reviews the confirmation presented by the system → System displays a confirmation message including the appointment identifier and summary details."
  ],
  "alternative_flows": [
    "AF-1 (from Step 5): Patient explicitly requests a specific doctor. Condition: The patient provides the name or identifier of a preferred doctor to the receptionist. The receptionist selects the patient-specified doctor in Step 5 instead of choosing a doctor independently. The flow then continues with Step 6 of the main flow."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): Authentication fails. Condition: The provided credentials are invalid or authentication cannot be completed. The system denies access to appointment management functions, displays an error message indicating authentication failure, and logs the failed attempt. The use case terminates without creating an appointment.",
    "EF-2 (from Step 4): Patient cannot be found. Condition: The receptionist cannot identify or locate the patient in the system. The system indicates that the patient record is not found and prompts the receptionist to re-enter or verify patient information. If the patient still cannot be identified, the use case ends without creating an appointment.",
    "EF-3 (from Step 5): No suitable doctor is available to assign. Condition: The system has no doctor records that can be selected for this appointment (e.g., doctor list is empty or access is restricted). The system displays a message indicating that a doctor cannot be assigned at this time and prevents appointment confirmation. The use case terminates without creating an appointment.",
    "EF-4 (from Step 6): Appointment detail validation fails. Condition: Required appointment fields are missing or contain invalid values. The system highlights the invalid or missing fields and prompts the receptionist to correct the information. If the receptionist cancels instead of correcting, the use case ends without creating an appointment."
  ],
  "information_for_steps": [
    "1. Receptionist identifier, authentication prompt.",
    "2. Receptionist credentials (username, password or equivalent authentication data), authentication status.",
    "3. Appointment creation command, appointment form structure.",
    "4. Patient identifier, patient demographic summary data.",
    "5. Doctor identifier, doctor assignment link to appointment.",
    "6. Appointment date, appointment time, appointment location or channel (e.g., in-person, remote), appointment metadata.",
    "7. Appointment record data including patient reference, doctor reference, schedule details, system-generated appointment identifier.",
    "8. Appointment confirmation details including appointment identifier, patient name, doctor name, date, time, and location."
  ]
}