{
  "use_case_name": "Access Match Analytics",
  "unique_id": "UC-008",
  "area": "Match Statistics and Analytics",
  "context_of_use": "Fans use the web application to view statistics and analytics generated by the system from referees’ live match updates, so that they can be informed about match events and team performance.",
  "scope": "IFA Web Application",
  "level": "User-goal",
  "primary_actors": [
    "fan"
  ],
  "supporting_actors": [
    "ifa administrator"
  ],
  "stakeholders_and_interests": [
    "Fan: Wants to access accurate and timely match statistics to be informed about what happened during a match.",
    "Fan: Wants to access analytics of favourite teams in order to better understand and predict upcoming matches.",
    "IFA administrator: Wants statistics generated from referees’ live updates so that fans are informed efficiently.",
    "IFA administrator: Wants the web application to provide free access to all data regarding games, teams, and leagues to improve system transparency.",
    "CIO: Wants integrated and transparent information among stakeholders through a unified system interface.",
    "Team: Wants accurate analytics reflecting team performance for public perception and transparency.",
    "Referee: Wants live updates to be reflected correctly in statistics to maintain data integrity and trust.",
    "IFA representative: Wants transparent, unbiased statistical information that supports fair decision making."
  ],
  "description": "This use case describes how a fan accesses match statistics and team analytics generated from referees’ live updates through the IFA web application, enabling transparent and efficient dissemination of information about matches and team performance.",
  "triggering_event": "A fan initiates a request in the web application to view match statistics or team analytics.",
  "trigger_type": "External",
  "preconditions": [
    "The IFA web application is operational and accessible via the internet.",
    "The fan can access the web application from their current location.",
    "Referees’ live updates for relevant matches have been received and processed by the system.",
    "The system has generated and stored statistics from referees’ live updates for completed or in-progress matches.",
    "The fan has a compatible user interface provided by the system to access statistics and analytics."
  ],
  "postconditions": [
    "The fan has successfully viewed the requested match statistics or team analytics through the web application.",
    "The system has presented statistics and analytics derived from referees’ live updates in a readable format to the fan.",
    "The system has maintained the integrity and availability of statistical data for subsequent access by other fans."
  ],
  "assumptions": [
    "It is assumed that statistics and analytics are derived exclusively from referees’ live updates already available in the system and no additional data sources are required.",
    "It is assumed that fans are allowed to access match statistics and team analytics without additional payment because the IFA administrator requires free access to data regarding games, teams, and leagues.",
    "It is assumed that the system continuously processes referees’ live updates into up-to-date statistics while a match is in progress.",
    "It is assumed that the system user interface can distinguish between match statistics (per match) and team analytics (aggregated or historical information) for presentation purposes.",
    "It is assumed that the system is designed to support up to 50,000 concurrent users and therefore can provide analytics access to a large number of fans simultaneously.",
    "It is assumed that different stakeholder interfaces exist but the core statistical and analytical data exposed to fans is a read-only subset appropriate for their role.",
    "It is assumed that language and localization features of the web application are available so that fans may view statistics and analytics in their preferred language.",
    "It is assumed that network connectivity and the fan’s device capabilities are sufficient to receive fast responses for statistics and analytics requests, in line with the requirement for fast system responses."
  ],
  "requirements_met": [
    "The system shall generate statistics from referees’ live updates so that fans are informed efficiently.",
    "The system shall allow a fan to access match statistics so that the fan is informed about what happened during a match.",
    "The system shall allow a fan to access analytics of the fan’s favourite team so that the fan can predict upcoming matches.",
    "The system shall provide free access, for authorized visitors, to data regarding games, teams, and leagues, including match statistics and team analytics, to improve transparency.",
    "The system shall process referees’ live updates into statistical information that can be presented to fans via the web application.",
    "The system shall provide fast responses to fan requests for match statistics and team analytics so that fans do not waste time waiting.",
    "The system shall support hosting high numbers of concurrent users, including fans accessing match analytics, so that accessibility problems are avoided.",
    "The system shall provide a user interface for fans that presents match statistics and team analytics in a way suited to their needs."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The required freshness of statistics and analytics data (e.g., real-time vs. near real-time vs. post-match) has not been explicitly defined.",
    "The level of detail for match statistics and team analytics to be exposed to fans (e.g., player-level, event-level, season aggregates) is not specified.",
    "Access control policies regarding which parts of analytics are available to unauthenticated visitors versus registered fans are not described.",
    "No explicit performance thresholds are defined for acceptable response times when retrieving statistics and analytics under peak concurrent usage.",
    "The precise rules for data retention and historical analytics availability (e.g., number of seasons, archiving policy) remain unspecified."
  ],
  "main_flow": [
    "1. Fan selects the option to view match analytics in the web application → System displays available competitions, leagues, and matches for which statistics and analytics are available.",
    "2. Fan chooses whether to view match statistics or team analytics → System presents appropriate selection options for matches and teams based on the chosen analytics type.",
    "3. Fan selects a specific match to view match statistics → System retrieves statistics generated from referees’ live updates for the selected match.",
    "4. Fan requests display of the selected match statistics → System renders detailed match statistics to the fan, based on processed live update data.",
    "5. Fan navigates to team analytics and selects a specific team, optionally marking it as a favourite team → System retrieves analytics derived from historical match statistics and live updates for the selected team.",
    "6. Fan requests display of the selected team analytics → System renders team analytics, including relevant trends and performance indicators, to the fan.",
    "7. Fan optionally refines the viewed information by changing filters such as competition, season, or time period → System updates the displayed match statistics or team analytics according to the selected filters and returns the results.",
    "8. Fan finishes reviewing the statistics and analytics and returns to the main fan interface → System maintains availability of analytics for future access and logs the completed access to analytics data."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): If the fan directly chooses to view team analytics instead of match statistics, the system bypasses match selection and immediately presents a list of teams for which analytics are available, after which the use case continues at Step 5.",
    "AF-2 (from Step 3): If multiple data versions are available for the selected match (for example, in-progress vs. completed statistics), the system asks the fan to choose a data version, the fan selects the desired version, and the use case then proceeds with Step 4 using the chosen version.",
    "AF-3 (from Step 5): If the fan has previously identified favourite teams, the system highlights or prioritizes those teams in the team selection interface, the fan selects one of the favourite teams, and the use case continues with Step 6."
  ],
  "exception_flows": [
    "EF-1 (from Step 3): If statistics are not yet generated for the selected match, the system informs the fan that statistics are currently unavailable for that match and offers the option to select another match or return to the previous screen; the use case then ends for the unavailable match.",
    "EF-2 (from Step 5): If analytics data is unavailable for the selected team, the system displays a message indicating that analytics for this team cannot be provided at this time and offers the fan the option to select another team or return to the previous screen; the use case then ends for the unavailable team.",
    "EF-3 (from Step 7): If the applied filters result in no statistics or analytics records, the system displays a notification that no data matches the selected criteria and prompts the fan to adjust or clear filters; the use case continues at Step 7 when the fan selects new filter values.",
    "EF-4 (from any step involving data retrieval): If a system error or temporary unavailability occurs while retrieving statistics or analytics, the system displays an error message indicating that the request cannot be processed at the moment and logs the error, and the use case is terminated without presenting updated analytics."
  ],
  "information_for_steps": [
    "1. Competitions list, leagues list, matches list, availability flags for statistics and analytics.",
    "2. Analytics type selection (match statistics vs. team analytics), context of competitions and leagues.",
    "3. Selected match identifier, associated referees’ live update data reference, match metadata.",
    "4. Processed match statistics data set (events, scores, timelines, aggregated metrics).",
    "5. Selected team identifier, favourite team indicator, historical match references, aggregated team performance data.",
    "6. Team analytics data set (trends, performance indicators, historical aggregates).",
    "7. Filter parameters such as competition, league, season, date range, and other applicable criteria; filtered statistics or analytics result set.",
    "8. Access log entry for analytics viewing, fan session identifier, timestamp of completion."
  ]
}