{
  "use_case_name": "Manage Prescriptions",
  "unique_id": "UC-001",
  "area": "Medication and Prescription Management",
  "context_of_use": "The use case supports patients, doctors, and pharmacists in renewing, reviewing, and transmitting medication prescriptions while allowing doctors to consider pharmacy stock levels and external pharmacy information, and enabling pharmacists to review the prescription details and patient identification required for dispensing.",
  "scope": "Healthcare Information System",
  "level": "User-goal",
  "primary_actors": [
    "patient",
    "doctor",
    "pharmacist"
  ],
  "supporting_actors": [
    "pharmacist"
  ],
  "stakeholders_and_interests": [
    "Patient: Wants to renew medication prescriptions efficiently and ensure continuity of medication therapy.",
    "Doctor: Wants to review and manage patient prescriptions, check pharmacy stock, and send prescriptions to appropriate pharmacies to ensure safe and effective treatment.",
    "Pharmacist: Wants to review patient identification and prescription details accurately in order to dispense medications correctly.",
    "Healthcare Organization: Wants prescriptions to be managed accurately and securely to support patient safety and regulatory compliance.",
    "Regulatory Bodies: Require traceable and secure management of prescriptions and dispensing-related information."
  ],
  "description": "This use case describes how patients renew prescriptions, how doctors review and manage prescriptions including medication intake information and pharmacy stock and contact information, and how prescriptions are transmitted to pharmacies for pharmacists to review and dispense based on patient identification and prescription details.",
  "triggering_event": "A patient initiates a prescription renewal request or a doctor decides to create or send a prescription for a patient.",
  "trigger_type": "External",
  "preconditions": [
    "The patient has an existing customer account in the Healthcare Information System.",
    "The doctor has valid access to the Healthcare Information System.",
    "The pharmacist has valid access to the Healthcare Information System.",
    "The patient has at least one active or renewable medication prescription recorded in the system.",
    "The patient, doctor, and pharmacist are authenticated according to the organization’s security policies."
  ],
  "postconditions": [
    "The patient’s prescription renewal request has been processed and the prescription status is updated in the system.",
    "The doctor’s prescription decisions, including any new or renewed prescriptions and intake-related information considered, are stored in the system.",
    "The prescription has been transmitted to the selected pharmacy and is available for pharmacist review.",
    "The pharmacist can view the patient’s identification number, medication dosage, and prescribed medication for the transmitted prescription."
  ],
  "assumptions": [
    "The Healthcare Information System maintains a list of external pharmacies including their names, addresses, and contact numbers in accordance with the doctor’s requirement for an overview of external pharmacies.",
    "The Healthcare Information System maintains information on which medications each pharmacy has in stock, enabling the doctor to review what medications pharmacies have in stock.",
    "The Healthcare Information System stores patients’ intake prescription information in a form that allows doctors to review it for advising patients on medication intake.",
    "The Healthcare Information System validates that only authorized doctors can create, modify, or send prescriptions to pharmacies.",
    "The Healthcare Information System ensures that pharmacists can access only the prescription data and patient identification data necessary for reviewing and dispensing medications.",
    "The Healthcare Information System is responsible for securely transmitting prescription information to pharmacies without altering the content specified by the doctor.",
    "The Healthcare Information System provides patients with the ability to request renewal only for medications that are eligible for renewal based on existing prescription records and configured rules, without changing those rules.",
    "The Healthcare Information System already includes an authentication mechanism, and this use case relies on that mechanism without modifying or extending it."
  ],
  "requirements_met": [
    "The system shall allow a patient to initiate a renewal of their existing medication prescriptions.",
    "The system shall present to the doctor the medication prescriptions that can be renewed for a selected patient.",
    "The system shall allow a doctor to confirm and approve prescription renewals initiated by a patient.",
    "The system shall allow a doctor to send prescriptions electronically to selected pharmacies.",
    "The system shall provide a doctor with a view of medications that pharmacies have in stock relevant to the patient’s prescription.",
    "The system shall allow a doctor to review intake prescriptions of medications for a patient in order to support advising the patient on medication intake.",
    "The system shall provide a doctor with an overview of external pharmacies, including each pharmacy’s name, address, and contact numbers.",
    "The system shall transmit the doctor-approved prescription details to the selected pharmacy.",
    "The system shall allow a pharmacist to review a patient’s identification number, medication dosage, and prescribed medication for prescriptions received from the system.",
    "The system shall store any created or renewed prescriptions and their transmission status for later reference."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The policy for determining which prescriptions are eligible for renewal by the patient is not defined and must be clarified.",
    "The rules for selecting a default pharmacy when multiple pharmacies are available are not specified.",
    "The required level of detail for pharmacy stock information (e.g., real-time quantities versus availability status) is not defined.",
    "The retention period and audit requirements for prescription and transmission records are not specified.",
    "The exact data set to be shared with pharmacies beyond patient ID number, medication dosage, and prescribed medication is not detailed and needs confirmation."
  ],
  "main_flow": [
    "1. Patient initiates a prescription renewal request for one or more existing medications → System retrieves and displays the patient’s renewable medication prescriptions and associated prescription details.",
    "2. Patient selects the medication prescriptions to be renewed and submits the renewal request → System records the renewal request and makes it available to the responsible doctor for review.",
    "3. Doctor accesses the patient’s prescription information including intake prescriptions to review current medication intake → System displays the patient’s existing prescriptions and intake-related information required for review.",
    "4. Doctor reviews the patient’s intake prescriptions and decides on renewal or modification of the requested medications → System allows the doctor to confirm renewal decisions and updates the prescription records accordingly.",
    "5. Doctor reviews pharmacy stock information for medications included in the prescriptions → System displays available pharmacies and indicates which of them have the prescribed medications in stock.",
    "6. Doctor reviews the overview of external pharmacies including names, addresses, and contact numbers and selects the target pharmacy or pharmacies for the prescription → System records the selected pharmacy or pharmacies for prescription transmission.",
    "7. Doctor confirms and sends the approved prescriptions to the selected pharmacy or pharmacies → System transmits the prescription details to the selected pharmacy or pharmacies and records the transmission status.",
    "8. Pharmacist accesses the transmitted prescription at the selected pharmacy → System displays the patient’s identification number, medication dosage, and prescribed medication for the prescription.",
    "9. Pharmacist confirms that the prescription details are available for dispensing → System marks the prescription as available for dispensing at the pharmacy and retains the associated records."
  ],
  "alternative_flows": [
    "AF-1 (from Step 1): Patient reviews renewable prescriptions but decides not to renew any prescription and cancels the request → System closes the renewal interaction without creating a renewal request and maintains existing prescription records unchanged; the flow ends.",
    "AF-2 (from Step 5): Doctor decides not to review pharmacy stock information and proceeds directly to selecting a pharmacy based on existing preference or other information → System skips displaying detailed stock information for this interaction and continues at Step 6.",
    "AF-3 (from Step 6): Doctor decides to send the prescription to more than one pharmacy (for example to provide the patient with options) → System records all selected pharmacies and, upon confirmation, transmits the prescription to each selected pharmacy as in Step 7."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): The system does not find any medication prescriptions eligible for renewal for the patient → System informs the patient that no prescriptions can be renewed and does not create a renewal request; the flow ends.",
    "EF-2 (from Step 5): The system cannot retrieve pharmacy stock information for the selected medications due to missing or outdated stock data → System informs the doctor that stock information is unavailable and allows the doctor to continue to Step 6 using pharmacy overview information only.",
    "EF-3 (from Step 7): Transmission of the prescription to the selected pharmacy fails due to a communication error → System records the failed transmission status, informs the doctor of the failure, and allows the doctor to retry sending the prescription or select a different pharmacy before ending the flow.",
    "EF-4 (from Step 8): The pharmacist cannot access the prescription because the pharmacist is not authorized for the patient’s prescriptions → System denies access to the prescription details, logs the authorization failure, and instructs the pharmacist to contact the appropriate administrator or doctor; the flow ends for that pharmacist."
  ],
  "information_for_steps": [
    "1. Patient identifier, list of renewable prescriptions, medication names, prescription identifiers, validity dates.",
    "2. Selected prescription identifiers, patient identifier, timestamp of renewal request, doctor identifier to whom the request is routed.",
    "3. Patient identifier, list of existing prescriptions, intake prescription information, dosage and schedule details.",
    "4. Updated prescription details, renewal decisions (approved or rejected), doctor identifier, decision timestamps.",
    "5. Medication identifiers, pharmacy identifiers, pharmacy stock availability indicators.",
    "6. List of external pharmacies, pharmacy names, addresses, contact numbers, selected pharmacy identifiers.",
    "7. Prescription details (medication names, dosages, quantities, instructions), selected pharmacy identifiers, transmission timestamps, transmission status.",
    "8. Patient identification number, prescribed medication names, dosages, quantities, prescription identifiers.",
    "9. Pharmacist identifier, prescription dispensing availability status, audit and logging information for the prescription."
  ]
}