{
  "use_case_name": "Manage Notifications",
  "unique_id": "UC-013",
  "area": "Notifications Management",
  "context_of_use": "Fans and referees manage their notification preferences within the web application in order to receive updates about players, teams, leagues, tickets, and game postponements.",
  "scope": "IFA Web Application",
  "level": "User-goal",
  "primary_actors": [
    "fan",
    "referee"
  ],
  "supporting_actors": [
    "IFA administrator"
  ],
  "stakeholders_and_interests": [
    "fan: Wants to register for and receive timely notifications about players, teams, leagues, and purchased match tickets, including game postponements, to follow favourite entities and adjust plans.",
    "referee: Wants to receive timely notifications when a game is postponed to efficiently reschedule plans and follow assigned matches.",
    "IFA administrator: Wants the notification mechanisms to support system transparency, fan engagement, and efficient dissemination of schedule changes without overloading the system.",
    "IFA representative: Wants that notifications about game postponements and schedule-related changes are communicated consistently to reduce misunderstandings and perceived bias.",
    "team: Wants that fans and referees are promptly informed about match postponements to reduce confusion and operational disruption.",
    "CIO: Wants notification handling to scale with many concurrent users and to fit into the unified, transparent multi‑stakeholder system."
  ],
  "description": "This use case describes how fans and referees configure notification preferences in the web application and how the system delivers notifications about players, teams, leagues, purchased tickets, and game postponements.",
  "triggering_event": "A fan or referee decides to configure or review notification preferences in the web application.",
  "trigger_type": "External",
  "preconditions": [
    "The IFA Web Application is operational and accessible to the fan and referee.",
    "The fan has an active account in the web application.",
    "The referee has an active account in the web application.",
    "The notification subsystem is configured to send notifications to registered users."
  ],
  "postconditions": [
    "The fan’s notification preferences for players, teams, leagues, and ticket updates are stored in the system.",
    "The referee’s notification preferences for game postponement updates are stored in the system.",
    "The system is configured to send notifications according to the stored preferences when relevant events occur."
  ],
  "assumptions": [
    "It is assumed that fans and referees are authenticated before accessing notification management functions, because notification preferences are associated with user accounts implied by account-related requirements.",
    "It is assumed that the system already knows the set of players, teams, leagues, and tickets associated with the fan and the set of assigned games associated with the referee, as implied by the broader domain of leagues, teams, and match management.",
    "It is assumed that the system has an underlying mechanism to generate notification events when a relevant domain event occurs (such as a game postponement or update on a purchased ticket), because the user stories require being updated when such events happen.",
    "It is assumed that the detailed delivery channel for notifications (such as email, push notification, or in‑app alerts) is already defined elsewhere in the system and is not determined by this use case.",
    "It is assumed that fans can select specific players, teams, or leagues as favourites or subjects of interest before or during the configuration of notifications, since the requirements mention following favourite entities.",
    "It is assumed that only postponement of games triggers notifications in the context of tickets and referees for this use case, as no other ticket or schedule changes are explicitly mentioned in the provided requirements.",
    "It is assumed that notification preferences can be updated in multiple sessions and that the latest saved configuration overrides previous configurations.",
    "It is assumed that the system records the time of the last update of notification preferences for audit and troubleshooting, even though this is not explicitly mentioned, because such traceability is commonly required in transparent multi‑stakeholder systems."
  ],
  "requirements_met": [
    "The system shall allow a fan to register for notifications related to players, teams, or leagues to enable the fan to follow favourite entities regularly.",
    "The system shall allow a fan to configure notifications about purchased tickets for matches so that the fan is notified if a game is postponed.",
    "The system shall allow a referee to receive notifications when a game the referee is assigned to is postponed so that the referee can reschedule plans.",
    "The system shall store notification preferences per authenticated user so that notifications are transmitted only according to explicitly defined user interests.",
    "The system shall generate and send notifications in response to relevant events, such as a game postponement affecting a fan’s purchased ticket or a referee’s assigned match.",
    "The system shall enable fans to select topics of interest, including specific players, teams, and leagues, and use these interests when determining which notifications to send."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The specific notification delivery channels (for example, email, SMS, mobile push, or in‑app alerts) are not defined and must be decided.",
    "The maximum acceptable delay between a game postponement event and delivery of notifications to fans and referees is not specified and must be established as a performance requirement.",
    "The retention duration and privacy policy for stored notification preferences and notification history are not specified and must be clarified.",
    "It is unclear whether users can temporarily mute notifications without deleting their preferences, which may impact usability expectations.",
    "The granularity of notification topics (for example, league‑wide vs. team‑specific vs. player‑specific) beyond what is explicitly mentioned needs further refinement.",
    "Rules for conflict resolution when schedule changes occur repeatedly (such as multiple postponements of the same match) and corresponding notification frequency limits are not defined."
  ],
  "main_flow": [
    "1. Fan or referee accesses notification settings in the web application → System displays the current notification preferences associated with the authenticated user.",
    "2. Fan selects desired topics for notifications such as specific players, teams, leagues, and ticket‑related updates → System presents the available selectable entities and ticket update options associated with the fan.",
    "3. Fan chooses notification options for favourite players, teams, and leagues → System records the selected players, teams, and leagues as the fan’s notification subjects.",
    "4. Fan enables notifications for updates related to purchased match tickets, including game postponements → System associates the fan’s purchased tickets with the fan’s notification preferences for ticket updates.",
    "5. Referee opens the notification options related to assigned games → System retrieves and displays the list of games assigned to the referee for notification configuration.",
    "6. Referee enables notifications for game postponements for one or more assigned games → System stores the referee’s notification preferences for postponement alerts for the selected assigned games.",
    "7. Fan or referee reviews all selected notification preferences and confirms the configuration → System validates the selections and persists the updated notification preferences in durable storage.",
    "8. Relevant domain event such as a game postponement or update on a purchased ticket occurs in the system → System evaluates the stored notification preferences and identifies all affected fans and referees to be notified.",
    "9. System prepares notification messages according to the event and the identified affected users → System transmits the prepared notifications to the corresponding fans and referees based on their stored preferences.",
    "10. Fan or referee accesses the web application and views the received notification information → System displays the notification details indicating the related player, team, league, ticket, or game postponement."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): If the fan has not yet selected any favourite players, teams, or leagues when accessing notification settings, the fan first selects favourite entities from the presented list and then continues with Step 3 to configure notifications for those entities.",
    "AF-2 (from Step 4): If the fan has no purchased tickets at the time of configuring ticket‑related notifications, the system informs the fan that no current tickets are available for notification; the fan may still complete Steps 2 and 3 for other notifications and the system will automatically apply the ticket notification preference to future purchased tickets.",
    "AF-3 (from Step 5): If a referee has no currently assigned games, the system displays an empty assigned‑game list and a message indicating that postponement notifications will be applied automatically when new games are assigned; the flow then continues directly to Step 7 for confirmation of any other available preferences.",
    "AF-4 (from Step 8): If a relevant event affects only fans or only referees, the system filters the affected users accordingly and continues with Steps 9 and 10 only for the applicable user group while still completing the notification processing successfully."
  ],
  "exception_flows": [
    "EF-1 (from Step 7): If the system fails to persist the updated notification preferences due to a storage error, the system rejects the changes, logs the error, informs the user that saving preferences was unsuccessful, and retains the previously stored preferences without proceeding to Step 8.",
    "EF-2 (from Step 8): If the system cannot evaluate notification preferences because preference data is temporarily unavailable, the system logs the failure, skips notification dispatch for the affected event, and may attempt re‑evaluation later according to system error‑handling policies.",
    "EF-3 (from Step 9): If transmission of notifications to some users fails, the system records which notifications were not delivered, logs the error, and informs system operators according to configured monitoring rules while still completing delivery to successfully reachable users; undelivered notifications are not marked as successfully sent.",
    "EF-4 (from Step 1): If the fan or referee session is not authenticated or has expired when accessing notification settings, the system redirects the user to the authentication process and does not allow access to notification settings until authentication is successfully completed."
  ],
  "information_for_steps": [
    "1. User identifier, session token, existing notification preference data.",
    "2. List of available players, teams, and leagues, fan’s existing favourites, ticket identifiers associated with the fan.",
    "3. Selected player identifiers, selected team identifiers, selected league identifiers.",
    "4. Purchased ticket identifiers, flag indicating ticket postponement notification preference.",
    "5. Referee identifier, list of assigned game identifiers.",
    "6. Selected game identifiers for postponement alerts, postponement notification flag.",
    "7. Consolidated notification preference set, timestamp of last update, validation status.",
    "8. Event type (such as game postponement or ticket update), affected entity identifiers, mapping from entities to subscribed user identifiers.",
    "9. Notification message content, recipient user identifiers, delivery status metadata.",
    "10. Notification list for the user, notification timestamp, related player, team, league, ticket, or game identifiers."
  ]
}