{
  "use_case_name": "Manage Match Events",
  "unique_id": "UC-012",
  "area": "Match Event Management and Live Reporting",
  "context_of_use": "The use case describes how match officials record live match events during a match, how the system receives these reports for the IFA, and how the system presents the reported events in real time to authorized users such as fans.",
  "scope": "IFA Integrated League Management System",
  "level": "User-goal",
  "primary_actors": [
    "match official"
  ],
  "supporting_actors": [
    "fan",
    "ifa"
  ],
  "stakeholders_and_interests": [
    "match official: Wants to report match events live during the match so that events are registered once and without duplicate manual work.",
    "fan: Wants to view live game event reports to keep track of what is happening in a match as closely as possible.",
    "ifa: Wants to receive game event reports directly from match officials to prevent unauthorized data sources from being relevant for official match information and statistics.",
    "ifa: Wants match events to be managed in a controlled and traceable way so that official records are accurate and auditable."
  ],
  "description": "This use case defines how a match official records match events live during a match, how the system accepts these event reports as the official source for the IFA, and how the system presents these events as live game event reports to users such as fans.",
  "triggering_event": "The match official initiates live reporting for a specific match at or near the start of the match in order to record match events.",
  "trigger_type": "External",
  "preconditions": [
    "The match official is authenticated in the system.",
    "The match official is authorized by the IFA to report events for the selected match.",
    "The match to be reported exists in the system and is in a state that allows live event reporting.",
    "The system is operational and connected so that event submissions and live updates can be processed."
  ],
  "postconditions": [
    "All match events recorded by the match official during the session are stored in the system as official match event data for that match.",
    "The IFA has received the recorded match events directly from the match official through the system.",
    "Live game event reports reflecting the recorded match events have been presented to authorized users such as fans during the match.",
    "The recorded match events are available in the system for subsequent use, including derivation of player and match statistics."
  ],
  "assumptions": [
    "It is assumed that the system has an existing authentication and authorization mechanism that verifies the identity of the match official and assigns permissions but this use case only relies on that mechanism and does not define it.",
    "It is assumed that the IFA defines which match officials are assigned to which matches outside of this use case, and that this assignment is available to the system at runtime.",
    "It is assumed that the system already has a defined data structure for match events, including event type, timestamp, and relevant participants, and that this structure is used when recording events.",
    "It is assumed that the system is already accessible to fans through client applications that can display live game event reports, and this use case only specifies that such data is provided for display.",
    "It is assumed that there is an existing match lifecycle management process that places a match into a state where live reporting may be started, and that this use case begins after that state is reached.",
    "It is assumed that the system has a time synchronization mechanism sufficient to order events consistently when they are received from the match official.",
    "It is assumed that only one official live source of match events per match is allowed by the IFA, and that this source is the reporting match official using this use case.",
    "It is assumed that the derivation of player and match statistics from recorded match events is handled by a separate process or use case, and that this use case ensures that the underlying match events are correctly recorded and stored."
  ],
  "requirements_met": [
    "The system shall allow a match official to report on match events live during the match so that the match official does not have to register events twice.",
    "The system shall accept game event reports directly from match officials as the official input channel for match events used by the IFA.",
    "The system shall provide live game event reports derived from the recorded match events so that fans can view what is happening in the match as closely as possible to real time.",
    "The system shall store each recorded match event in a persistent repository as part of the official match record.",
    "The system shall make the recorded match events available to IFA users for oversight and verification of official match data.",
    "The system shall make the recorded match events available to other system functions that derive player and match statistics from reported match events."
  ],
  "priority": "High",
  "risk": "High",
  "outstanding_issues": [
    "The rules for correcting or amending previously recorded match events during or after the match are not specified and must be defined by the IFA.",
    "The maximum acceptable latency between an event being reported by the match official and its appearance in the live game event report for fans is not specified and must be agreed as a performance requirement.",
    "The policy for handling simultaneous event reports from multiple match officials for the same match, if allowed by the IFA, is not defined and must be clarified.",
    "The required level of detail and standardized taxonomy for match event types (for example, goals, fouls, substitutions) has not been specified and must be established by the IFA.",
    "The retention period and archival policy for stored match event data are not specified and must be defined to comply with IFA regulations.",
    "The mechanism for dealing with connectivity loss between the match official’s device and the system during live reporting, including offline buffering limits and reconciliation rules, is not specified and must be defined."
  ],
  "main_flow": [
    "1. Match official starts live reporting for a selected match → System verifies the match official's authorization for the match and opens a live match event reporting session.",
    "2. Match official views the live reporting interface for the selected match → System displays the current match context including teams, match start time, and an empty or existing list of recorded events.",
    "3. Match official records a new match event with required event details → System validates the provided event details and time-stamps the event within the reporting session.",
    "4. Match official submits the recorded event to the system → System stores the submitted event as part of the official match record and confirms successful recording to the match official.",
    "5. System processes the newly stored event for live presentation → System updates the live game event data stream for the match to include the newly recorded event.",
    "6. Fan requests to view live game event reports for the match → System retrieves the current list of recorded events for the match and presents the live game event report to the fan.",
    "7. System makes the recorded events available to IFA users → System provides IFA with access to the official match event record associated with the match.",
    "8. Match official continues to record and submit additional match events for the duration of the match → System repeats validation, storage, and live presentation updates for each new event recorded during the session.",
    "9. Match official ends the live reporting session at the conclusion of match event recording → System closes the live match event reporting session and retains all recorded events as the final official event record for the match."
  ],
  "alternative_flows": [
    "AF-1 (from Step 3): Match official edits event details before submission. Condition: The match official identifies an error or omission in the event details before submitting the event. The match official updates the event details in the live reporting interface prior to submission → System updates the event details in the in-progress event record and, once the match official submits the corrected event, proceeds with Step 4.",
    "AF-2 (from Step 6): Fan refreshes live game event report during the match. Condition: The fan requests an updated view of live game event reports while the match is ongoing → System retrieves the latest recorded events for the match, updates the live game event report display for the fan, and the flow continues with further refreshes as needed without altering other steps.",
    "AF-3 (from Step 8): Short pause in event reporting with no events to record. Condition: No match events occur for a period of time while the session remains active → The match official does not record any new events during this interval → The system maintains the live session and continues to present the last known live game event report until a new event is recorded, at which point the flow resumes at Step 3."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): Match official is not authorized for the selected match. Condition: The system determines that the match official is not assigned or not permitted to report events for the selected match → System denies opening the live match event reporting session, informs the match official that they are not authorized for this match, logs the unauthorized access attempt, and the use case terminates without creating a reporting session.",
    "EF-2 (from Step 3): Provided event details are invalid or incomplete. Condition: The match official attempts to record a match event with missing mandatory fields or invalid values → System rejects the event entry, displays validation messages indicating which details are invalid, does not store the event, and returns control to the match official to correct the data before attempting Step 3 again.",
    "EF-3 (from Step 4): Event submission fails due to temporary system or connectivity error. Condition: The system cannot store the submitted event because of a transient storage or network issue → System informs the match official that the submission failed, preserves the event details locally within the session where possible, allows the match official to retry submission, and if repeated attempts fail, logs the failure and ends the use case for that event without storing it.",
    "EF-4 (from Step 6): Fan is not authorized or fails to access live game event reports. Condition: The fan is not allowed to view live game event reports for the selected match or there is a failure retrieving data → System denies access or shows an error message indicating that live game event reports cannot be displayed at this time, does not present any event data, and the fan’s interaction ends for this use case instance.",
    "EF-5 (from Step 9): Failure when closing the live reporting session. Condition: The system encounters an error while closing the live match event reporting session → System logs the error, informs the match official that session closure was not completed successfully, keeps the existing recorded events stored, and flags the session for administrative review without discarding recorded data."
  ],
  "information_for_steps": [
    "1. Match identifier, match official identifier, authorization status, reporting session identifier.",
    "2. Match metadata (teams, scheduled time, venue), list of existing match events, session status.",
    "3. Event type, event timestamp, involved team, involved player if applicable, match time, optional descriptive notes.",
    "4. Event record identifier, event validation results, persistent storage status, confirmation message to match official.",
    "5. Live event stream payload, match identifier, ordering information for events, update timestamp.",
    "6. Fan identifier, match identifier, list of recorded events, formatted live game event report data for presentation.",
    "7. IFA user identifier, match identifier, access permissions, complete official event log for the match.",
    "8. Sequence of event records, session identifier, ongoing validation and storage status for each new event.",
    "9. Reporting session identifier, session end timestamp, final event log status, confirmation of session closure."
  ]
}