{
  "use_case_name": "Manage Appointments",
  "unique_id": "UC-004",
  "area": "Appointment Management",
  "context_of_use": "The healthcare information system supports patients, doctors, and receptionists in scheduling, organizing, and viewing patient appointments, including doctor agendas, patient identification by unique number, and available room allocation.",
  "scope": "Healthcare Information System",
  "level": "User-goal",
  "primary_actors": [
    "patient",
    "doctor",
    "receptionist"
  ],
  "supporting_actors": [
    "patient",
    "doctor",
    "receptionist"
  ],
  "stakeholders_and_interests": [
    "Patient: Wants to remotely schedule appointments using their customer account and be correctly matched to an appropriate doctor and room.",
    "Doctor: Wants to have an accurate agenda showing who and where the next patient appointment is.",
    "Receptionist: Wants to identify patients through a unique number, access doctors’ schedules, match patients to doctors, and view available rooms for assignment.",
    "Healthcare Provider Organization: Wants efficient utilization of doctors’ time and room resources through accurate appointment management.",
    "IT Operations: Wants consistent, reliable appointment data to avoid conflicts and support system maintenance."
  ],
  "description": "This use case describes how patients, doctors, and receptionists interact with the healthcare information system to schedule and organize patient appointments, access and view doctors’ agendas, identify patients via a unique number, match patients to doctors, and view available rooms for assigning patients.",
  "triggering_event": "A patient or receptionist needs to schedule or organize a patient appointment, or a doctor wants to view the agenda of upcoming appointments.",
  "trigger_type": "External",
  "preconditions": [
    "The healthcare information system is operational and reachable by the actors.",
    "The patient, doctor, and receptionist have valid user accounts registered in the system.",
    "The patient is identifiable in the system by a unique patient number.",
    "Doctors’ basic schedule configuration, including available time slots, has been defined in the system.",
    "Room information, including which rooms can be assigned to patients, has been registered in the system."
  ],
  "postconditions": [
    "A new appointment is stored in the system or an existing appointment is confirmed as scheduled according to the actor’s requested parameters.",
    "The doctor’s agenda accurately reflects the scheduled appointment, including patient and location information.",
    "The appointment is associated with the correct patient unique number and assigned doctor.",
    "A room is associated with the appointment in accordance with available rooms at the scheduled time.",
    "All actors with permission can subsequently view the updated appointment information through their respective system views."
  ],
  "assumptions": [
    "It is assumed that user authentication and authorization, including log in and access rights management, are handled by separate use cases and are already satisfied before the appointment management actions occur.",
    "It is assumed that the patient’s unique number has been created and assigned to the patient profile before the receptionist or patient attempts to schedule an appointment.",
    "It is assumed that time management details such as appointment duration, working hours, and conflict handling rules are configured outside this use case and enforced by the system without additional user actions.",
    "It is assumed that the concept of an appointment includes at least the patient unique number, doctor, date, time, and room reference as core data elements.",
    "It is assumed that remote scheduling by the patient through a customer account uses the same appointment data structures and validation rules as appointments created by the receptionist.",
    "It is assumed that all participating actors have sufficient access rights to perform the actions described for their role within this use case.",
    "It is assumed that the system maintains an internal list of rooms that can be marked as available or unavailable for assignment to appointments.",
    "It is assumed that doctors’ agendas shown by the system are derived from the stored appointment data and reflect all appointments associated with the doctor."
  ],
  "requirements_met": [
    "The system shall allow a patient to schedule appointments remotely using the patient’s customer account.",
    "The system shall allow a doctor to view an agenda showing upcoming patient appointments, including information about who the next patient is and where the appointment will take place.",
    "The system shall allow a receptionist to identify patients using a unique patient number during appointment-related operations.",
    "The system shall allow a receptionist to access doctors’ schedules to view existing appointments and available time slots for scheduling.",
    "The system shall allow a receptionist to match patients to doctors when scheduling appointments.",
    "The system shall allow a receptionist to view an overview of available rooms that can be assigned to patient appointments.",
    "The system shall associate each stored appointment with a patient unique number, a doctor, a date and time, and a room reference.",
    "The system shall update the doctor’s agenda immediately after a new appointment is scheduled or an existing appointment is modified.",
    "The system shall ensure that only authenticated and authorized users can perform appointment management actions corresponding to their role."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The policy for resolving double-booking or scheduling conflicts between appointments is not described and needs clarification.",
    "The rules for which doctors a patient may be matched to (e.g., specialty, location, prior relationship) are not defined and require specification.",
    "The criteria for room availability and any room type constraints for specific appointments are not described and need to be established.",
    "The required minimum appointment data fields and validation rules (such as mandatory reason for visit or appointment duration) are not fully defined.",
    "The behavior when a patient or doctor cancels or reschedules an appointment is outside the current requirements and requires further specification.",
    "Notification mechanisms for appointments (such as reminders to patients or updates to doctors and receptionists) are not addressed and require a policy decision."
  ],
  "main_flow": [
    "1. Patient or receptionist initiates appointment management → System displays appointment management options appropriate to the actor’s role.",
    "2. Receptionist identifies a patient using the unique patient number → System retrieves and displays the patient’s basic identification details and any relevant appointment history.",
    "3. Patient or receptionist requests to schedule a new appointment → System prompts for selection of doctor and desired date and time.",
    "4. Patient or receptionist selects a doctor and proposes a date and time → System displays the selected doctor’s schedule, indicating available and occupied time slots around the proposed time.",
    "5. Patient or receptionist selects an available time slot for the appointment → System temporarily reserves the selected time slot for the selected doctor and patient.",
    "6. Receptionist requests an overview of available rooms for the selected time slot → System displays a list of rooms that are available at the selected date and time.",
    "7. Receptionist selects an available room to assign to the appointment → System associates the selected room with the appointment.",
    "8. Patient or receptionist confirms the appointment details, including patient unique number, doctor, date, time, and room → System validates the appointment details and stores the appointment as scheduled.",
    "9. Doctor requests to view the agenda → System displays the doctor’s agenda, including the newly scheduled appointment with patient identifier and room information."
  ],
  "alternative_flows": [
    "AF-1 (from Step 1): Doctor initiates appointment management to review agenda: The doctor requests to view the agenda instead of scheduling a new appointment. The system immediately displays the doctor’s agenda of upcoming appointments and their locations, and the flow ends successfully without creating or modifying any appointments.",
    "AF-2 (from Step 2): Patient self-scheduling without receptionist identification: When the patient is authenticated via the customer account and initiates appointment management, the patient’s unique number and basic details are already known to the system. The system skips explicit patient identification by unique number and continues directly with prompting the patient to schedule a new appointment as in Step 3.",
    "AF-3 (from Step 4): Receptionist schedules appointment based primarily on doctor availability: The receptionist first views the doctor’s schedule for a range of dates without proposing a specific time. The system displays the doctor’s available time slots, and the receptionist selects an available slot. The flow then continues at Step 5.",
    "AF-4 (from Step 6): Room pre-assigned by policy or configuration: If organizational policy defines that certain types of appointments always use a specific room and that room is available at the selected time, the system pre-selects that room and presents it to the receptionist for confirmation. Upon receptionist confirmation, the flow continues at Step 8."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): Patient unique number not found: The receptionist enters a patient unique number that does not match any patient record. The system informs the receptionist that the patient could not be found and prompts for re-entry of the unique number or cancellation of the operation. If the receptionist cancels, the use case ends without scheduling an appointment.",
    "EF-2 (from Step 4): No available time slots for the selected doctor on the requested date: After the patient or receptionist selects a doctor and proposes a date, the system determines that there are no available time slots for that date. The system informs the actor and allows selection of another date or another doctor. If a new doctor or date is chosen, the system repeats the availability display for the new selection; if the actor cancels, the use case ends without an appointment.",
    "EF-3 (from Step 6): No rooms available at the selected time: After the receptionist requests available rooms for the selected time slot, the system determines that no rooms are available. The system informs the receptionist and allows the receptionist to choose a different time slot with potential room availability or cancel the scheduling. If an alternative time slot is chosen, the flow returns to Step 5; if cancelled, the use case ends without an appointment.",
    "EF-4 (from Step 8): Appointment validation fails: During confirmation, the system detects invalid or incomplete appointment details, such as missing doctor, date, time, or room information. The system highlights the invalid or missing data and requests correction. If the actor corrects the details, the system re-validates and, upon success, completes Step 8; if the actor aborts, the use case ends without storing an appointment."
  ],
  "information_for_steps": [
    "1. Actor role identifier (patient, doctor, receptionist), appointment management menu options.",
    "2. Patient unique number, patient name, basic patient identification details, relevant appointment history references.",
    "3. Request type (new appointment), patient identifier, appointment purpose label (if captured), initial date and time preferences.",
    "4. Selected doctor identifier, proposed date, doctor schedule data for the date including existing appointments and available time slots.",
    "5. Selected time slot (date and time), patient identifier, doctor identifier, temporary reservation indicator.",
    "6. Selected date and time, list of rooms, room identifiers, room availability status at the selected time.",
    "7. Selected room identifier, appointment identifier (temporary), association between appointment and room.",
    "8. Complete appointment data set, including patient unique number, patient identifier, doctor identifier, date, time, room identifier, basic validation status.",
    "9. Doctor identifier, agenda entries for the doctor, including for each appointment: patient identifier or unique number, date, time, room identifier, and basic appointment status."
  ]
}