{
  "use_case_name": "Record Game Events",
  "unique_id": "UC-009",
  "area": "Match Operations and Monitoring",
  "context_of_use": "During an active game, an authenticated referee records game events in real time so that the system can capture accurate, reliable, and up-to-date event data for IFA oversight.",
  "scope": "Football League Management System",
  "level": "User-goal",
  "primary_actors": [
    "referee"
  ],
  "supporting_actors": [
    "ifa"
  ],
  "stakeholders_and_interests": [
    "Referee: Wants to record game events efficiently in real time without wasting time.",
    "IFA: Wants all game event data to be recorded digitally in real time so that information is accurate, reliable, and true for oversight and regulation enforcement.",
    "Teams: Want game events to be recorded accurately and objectively to ensure fair results and statistics.",
    "Fans: Want reliable and timely updates about events during games so that they know exactly what is happening now."
  ],
  "description": "This use case describes how an authenticated referee records game events in real time during a match so that the system captures accurate, reliable, and timely digital game event data for subsequent IFA oversight and monitoring.",
  "triggering_event": "The referee initiates recording of game events for a specific game after authenticating to the system.",
  "trigger_type": "External",
  "preconditions": [
    "The referee has valid access credentials to the system.",
    "The referee has successfully authenticated to the system.",
    "The game to be recorded has been created and is scheduled in the system.",
    "The referee is assigned to the game for which events will be recorded.",
    "The system is operational and reachable from the referee’s device at the start of event recording."
  ],
  "postconditions": [
    "All game events recorded by the referee during the session are stored digitally in the system.",
    "Recorded game events are associated with the correct game and referee in the system.",
    "IFA has access to the recorded game event data for oversight and verification.",
    "The final state of the game (including all recorded events) is persistently available in the system for monitoring and later use."
  ],
  "assumptions": [
    "The Football League Management System provides an existing authentication capability, which is referenced by the include relationship to the 'authenticate' use case.",
    "The system already contains game and assignment data indicating which referee is assigned to which game before this use case begins.",
    "The referee uses a system-supported device (such as a mobile or tablet interface) that can communicate with the system in real time.",
    "Game events are predefined entities in the system (for example, goals, fouls, substitutions, time-related events) and are selectable by the referee without the need to define new event types during this use case.",
    "Network connectivity is generally available during the game, but the system must handle temporary connectivity issues without losing already entered event data.",
    "Time synchronization for event timestamps is handled by the system using its internal clock so that event times are consistent and reliable.",
    "This use case focuses only on capturing and storing game event data and does not cover post-match analysis, reporting, or editing workflows beyond confirming that events are saved.",
    "The IFA accesses recorded game event data through separate monitoring or reporting use cases, which are outside the scope of this specific use case.",
    "Only one referee actively records events for a given game instance in this use case, even if multiple referees are present in reality.",
    "Real-time in this context means that events are recorded by the referee as they occur or shortly thereafter, without intentional batch entry after the game."
  ],
  "requirements_met": [
    "The system shall allow an authenticated referee to record game event data digitally in real time.",
    "The system shall capture and store recorded game event data in a persistent manner associated with the corresponding game and referee.",
    "The system shall present the referee with efficient input options for recording game events to minimize time spent on data entry.",
    "The system shall timestamp each recorded game event using the system clock to support accurate and reliable event sequencing.",
    "The system shall make recorded game event data available to the IFA for oversight, monitoring, and verification purposes.",
    "The system shall require successful authentication of the referee before allowing access to any game event recording functions.",
    "The system shall allow the referee to confirm that all intended game events have been recorded before ending the recording session.",
    "The system shall handle temporary communication or connectivity interruptions by preserving already entered game event data and informing the referee of any failure to store new events."
  ],
  "priority": "High",
  "risk": "High",
  "outstanding_issues": [
    "The exact list and structure of game event types (for example, goals, cards, fouls, substitutions, time markers) are not defined and must be specified.",
    "It is unclear whether referees are allowed to modify or delete previously recorded events during or after the game within this use case.",
    "The maximum acceptable delay between the real-world occurrence of an event and its recording in the system (definition of real time) is not specified.",
    "The required behavior of the system in case of prolonged connectivity loss during a game, including potential offline recording and later synchronization, is not fully defined.",
    "The specific performance targets (for example, maximum response time per event submission) that guarantee that the referee does not waste time are not defined.",
    "Authorization rules for who, apart from the assigned referee, may access or view in-progress event recording for a live game are not specified.",
    "The policy for handling discrepancies between recorded game events and other official records (for example, paper reports) is not defined.",
    "The degree of granularity for timestamps (for example, seconds vs. milliseconds, linkage to game clock vs. wall clock) requires clarification."
  ],
  "main_flow": [
    "1. Referee initiates the game event recording process for an assigned game → System invokes the authentication sub-flow to verify the referee’s identity.",
    "2. Referee provides authentication credentials as required → System validates the credentials and establishes an authenticated session for the referee.",
    "3. Referee selects the specific game for which events will be recorded → System retrieves and displays the game details and confirms that the referee is assigned to the selected game.",
    "4. Referee starts the live event recording session for the selected game → System opens the real-time event recording interface and initializes the game event timeline.",
    "5. Referee records a game event by selecting the appropriate event type and providing any required details → System validates the provided event details and logs the event with a timestamp linked to the game and referee.",
    "6. Referee continues to record subsequent game events during the game as they occur → System repeatedly stores each new game event, updating the game event timeline in real time.",
    "7. Referee reviews the visible list or summary of recorded events during the game as needed → System presents the current set of recorded events for the game in chronological order.",
    "8. Referee indicates that the game has ended and that event recording is complete → System finalizes the event recording session and marks the game’s event data set as complete.",
    "9. Referee confirms that all intended events have been captured → System confirms successful completion, ensures all recorded events are persistently stored, and makes the final event data set available for IFA oversight."
  ],
  "alternative_flows": [
    "AF-1 (from Step 3): Referee changes selected game before recording begins. Condition: After viewing game details, the referee realizes the wrong game was selected. The referee cancels the current selection and chooses a different game assigned to them → System discards the previous selection, displays the new game details, and returns to Step 4 with the newly selected game.",
    "AF-2 (from Step 5): Referee adjusts event details immediately after entry. Condition: Immediately after submitting an event, the referee notices an input mistake (for example, incorrect player number). The referee selects the last recorded event and updates its editable details → System validates the updated details, replaces the stored values for that event, and returns to Step 6 with the corrected event list.",
    "AF-3 (from Step 8): Game is temporarily suspended rather than ended. Condition: The game is paused (for example, due to weather or other interruption) but is expected to resume. The referee indicates a temporary suspension instead of game end → System records the suspension as an event, keeps the recording session open in a suspended state, and allows the referee to resume event recording later by proceeding again from Step 6 when the game restarts."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): Authentication fails. Condition: The referee provides invalid credentials or the system cannot verify the credentials. System rejects the authentication attempt, displays an authentication failure message, and prevents access to game event recording functions. The flow ends without recording any game events.",
    "EF-2 (from Step 3): Referee not assigned to selected game. Condition: The referee attempts to select a game to which they are not assigned according to system data. System denies access to event recording for that game, displays an authorization error, and prompts the referee to select a different game. The flow returns to Step 3.",
    "EF-3 (from Step 5): Event recording submission fails due to a system or connectivity error. Condition: When the referee submits an event, the system cannot store the event. System informs the referee that the event could not be saved, retains the entered event data in the local interface if possible, and allows the referee to retry submission or cancel the event entry. If the referee cancels, the failed event is not stored and the flow continues with Step 6 for subsequent events; if repeated failures occur and the referee cannot proceed, the referee may terminate the session, and the use case ends with only previously saved events available.",
    "EF-4 (from Step 4): Recording interface fails to load. Condition: The system encounters an internal error while opening the real-time event recording interface. System displays an error message indicating that event recording cannot be started and logs the failure for administrative review. The use case ends without recording any game events.",
    "EF-5 (from Step 8): Finalization of the recording session fails. Condition: When the referee indicates that the game has ended, the system encounters an error while finalizing the event data set. System notifies the referee that finalization failed, preserves the already stored events, and prompts the referee to retry finalization. If the problem persists and the referee terminates the session, the use case ends with events stored but the game not marked as fully finalized."
  ],
  "information_for_steps": [
    "1. Referee identifier, game identifier candidate, authentication requirement indicator.",
    "2. Referee credentials (such as username and password or equivalent), authentication status, authenticated session token or reference.",
    "3. List of games assigned to the referee, selected game identifier, game metadata (date, time, teams, league), assignment validation status.",
    "4. Game identifier in recording state, event recording session identifier, initial game clock or time reference.",
    "5. Event type, event timestamp, related participant identifiers (such as player or team identifiers if applicable), event-specific attributes (for example, card color or reason), referee identifier, game identifier.",
    "6. Sequence of recorded events, cumulative game event log, ongoing timestamp data, session state (in-progress).",
    "7. Structured list or timeline of recorded events, sorting order (chronological), basic event summary fields displayed to the referee.",
    "8. Game end indicator from referee, session state transition data (from in-progress to finalizing), final game time or duration indicator.",
    "9. Complete event data set for the game, finalization status flag, persistence confirmation, access flags granting IFA the ability to review the recorded game events."
  ]
}