{
  "use_case_name": "View Reports",
  "unique_id": "UC-004",
  "area": "Reporting",
  "context_of_use": "This use case allows users to view and download general and sales reports for analysis and record-keeping.",
  "scope": "Reporting System",
  "level": "User-goal",
  "primary_actors": [
    "customer",
    "power user",
    "admin"
  ],
  "supporting_actors": [],
  "stakeholders_and_interests": [
    "customer: access to reports for personal use and analysis",
    "power user: ability to analyze data offline through downloaded reports",
    "admin: monitor business performance through access to sales reports"
  ],
  "description": "This use case enables users to view and download reports for analysis and record-keeping.",
  "triggering_event": "User requests to view or download reports.",
  "trigger_type": "External",
  "preconditions": [
    "User is authenticated and authorized to access reports."
  ],
  "postconditions": [
    "User successfully views or downloads the requested reports.",
    "Reports are accurately displayed and available for download."
  ],
  "assumptions": [
    "Users have the necessary permissions to access the reports."
  ],
  "requirements_met": [
    "The system shall allow users to view reports.",
    "The system shall allow users to download reports."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "Clarification on the types of reports available for viewing and downloading."
  ],
  "main_flow": [
    "1. customer → System displays available reports.",
    "2. customer → System allows customer to select a report to view.",
    "3. customer → System displays the selected report.",
    "4. power user → System allows power user to download the report.",
    "5. admin → System allows admin to view sales reports."
  ],
  "alternative_flows": [
    "AF-1 (from Step 1): If no reports are available, then System displays a message indicating no reports are available."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): If the user is not authenticated, then System displays an error message and prompts for login."
  ],
  "information_for_steps": [
    "1. Report list",
    "2. Selected report",
    "3. Report details",
    "4. Download request",
    "5. Sales report"
  ]
}