{
  "use_case_name": "IFA Sends Match Notifications",
  "unique_id": "UC-004",
  "area": "Notifications and Communications",
  "context_of_use": "This use case allows an authenticated IFA user to create and send system-managed notifications about game cancellations and rescheduling so that all stakeholders are informed simultaneously.",
  "scope": "IFA League Management System",
  "level": "User-goal",
  "primary_actors": [
    "ifa"
  ],
  "supporting_actors": [
    "notification delivery service",
    "match scheduling component",
    "game event recording component"
  ],
  "stakeholders_and_interests": [
    "ifa: Requires all stakeholders to be informed simultaneously about game cancellations, rescheduling, and related schedule changes to support fair planning and transparency.",
    "referee: Requires timely notifications about game cancellations and rescheduling to adjust personal schedules and avoid double bookings as a consequence of IFA-issued notifications.",
    "fan: Requires timely notifications about rescheduling and related schedule changes for games they follow in order to stay accurately informed.",
    "system operator: Requires reliable, scalable notification behavior when the IFA sends notifications, to support high concurrent user volumes without system failure."
  ],
  "description": "This use case describes how an authenticated IFA user composes, confirms, and sends game-related notifications about cancellations and rescheduling through the system so that relevant stakeholders are informed at the same time.",
  "triggering_event": "An authenticated IFA user decides to inform stakeholders about a game cancellation or rescheduling through the system.",
  "trigger_type": "External",
  "preconditions": [
    "The IFA League Management System is operational and reachable by the IFA user.",
    "The IFA user has successfully authenticated with the system according to the included \"authenticate\" use case.",
    "Relevant game and schedule data required for the notification (such as the affected match and its timing) already exist in the system.",
    "Stakeholders intended to receive notifications have valid in-system notification endpoints registered, such as in-app notification channels."
  ],
  "postconditions": [
    "The created notification about the specified game cancellation or rescheduling is stored in the system and linked to the relevant game or schedule entry.",
    "All intended recipients determined by the system have notification records associated with their accounts and queued or dispatched for delivery.",
    "The system maintains a traceable history of the IFA-issued notification, including content, targeted recipients, and dispatch status for auditing.",
    "If any recipients could not be reached, the system has recorded the failures and associated them with the notification while still preserving the sent notification for all reachable recipients."
  ],
  "assumptions": [
    "It is assumed that the \"authenticate\" use case, referenced by the include relationship, is completed successfully before the IFA can initiate this use case.",
    "It is assumed that the system provides an in-app notification mechanism capable of presenting notifications to stakeholders without requiring external communication tools.",
    "It is assumed that the roles and relationships required to determine recipients (such as which referees are assigned to a match and which fans follow affected teams or players) are already defined and maintained by other use cases.",
    "It is assumed that the IFA uses this use case primarily for notifications about game cancellations and rescheduling, and that other types of communication may be handled by separate use cases or configurations.",
    "It is assumed that localization of notification content to the recipient's preferred language and regional format is handled by lower-level mechanisms, outside the scope of this use case.",
    "It is assumed that the notification delivery service and related infrastructure form part of the overall system environment and are available when the IFA sends notifications."
  ],
  "requirements_met": [
    "The system shall allow the IFA to initiate notifications through the system to all relevant stakeholders about game cancellations so that everyone is informed simultaneously.",
    "The system shall allow the IFA to initiate notifications through the system to all relevant stakeholders about game rescheduling so that everyone is informed simultaneously.",
    "The system shall determine the intended recipients of IFA-issued cancellation and rescheduling notifications based on existing game, schedule, and stakeholder relationships.",
    "The system shall record IFA-issued cancellation and rescheduling notifications with their content, associated games, targeted recipients, and dispatch status for later review.",
    "The system shall only allow authenticated IFA users to create and send game cancellation and rescheduling notifications in order to preserve integrity and accountability of sent notifications."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The precise rules that determine which stakeholders (e.g., specific referees, teams, fans) must receive a given cancellation or rescheduling notification are not fully specified and require detailed business definition.",
    "The notification channels to be used for IFA-issued notifications (for example, in-app only versus additional channels) are not defined and need clarification.",
    "Policies for how far in advance cancellation or rescheduling notifications must be sent, and whether reminders are required, have not been defined.",
    "Retention period and compliance requirements for the history of IFA-issued notifications, including audit access and privacy constraints, remain to be specified."
  ],
  "main_flow": [
    "1. IFA user initiates access to notification functions in the system → System presents an authentication interface and verifies the IFA user's identity according to the included \"authenticate\" use case.",
    "2. IFA user, now authenticated, selects the option to create a game-related notification for cancellation or rescheduling → System displays a notification creation form with fields for selecting the game or schedule entry and specifying the type of change.",
    "3. IFA user selects the affected game or schedule entry and chooses whether the notification is for a cancellation or a rescheduling → System retrieves the selected game or schedule data and confirms that it is available for notification.",
    "4. IFA user enters the notification content describing the cancellation or rescheduling details and reviews the information → System validates the entered content for completeness and determines the preliminary set of intended recipients based on existing game and stakeholder relationships.",
    "5. IFA user confirms the notification for sending after reviewing the summary of content and intended recipients → System finalizes the recipient list, records the notification and its metadata, and prepares it for dispatch.",
    "6. IFA user issues the send command for the prepared notification → System dispatches the notification to all determined recipients through the configured notification mechanism and updates each recipient's notification record with dispatch status.",
    "7. IFA user views a brief status summary of the sent notification → System presents a summary showing that the notification has been created, the number of targeted recipients, and the overall dispatch outcome.",
    "8. IFA user ends interaction with the notification functions → System preserves the IFA-issued notification, recipient associations, and dispatch history for future reference and auditing."
  ],
  "alternative_flows": [
    "AF-1 (from Step 3): IFA user selects a different game or schedule entry after reviewing the initially selected one. Condition: The IFA user realizes that the initially chosen game or schedule entry is not the one to be cancelled or rescheduled. The system returns to the game or schedule selection view within Step 3, allowing the IFA user to select a different entry. Once a new valid entry is selected and confirmed, the flow continues at Step 4.",
    "AF-2 (from Step 4): IFA user edits notification content after validation feedback. Condition: The system indicates that mandatory information is missing or suggests corrections while validating the notification content. The IFA user updates the notification content accordingly and resubmits it for validation. When validation succeeds, the flow continues at Step 5.",
    "AF-3 (from Step 5): IFA user saves the notification as a draft instead of immediately preparing it for dispatch. Condition: The IFA user chooses to postpone sending the notification. The system stores the notification with draft status and records the partially prepared recipient information. The use case then ends for this session, with the understanding that a separate execution of this use case or a related one will later resume from the draft state rather than sending immediately."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): Authentication fails. Condition: The IFA user provides invalid or incomplete authentication credentials. The system rejects the authentication attempt, does not grant access to notification functions, and displays an access denied message. The use case terminates without creating or sending any notification, so the IFA user's goal of sending a match notification is not achieved.",
    "EF-2 (from Step 3): Required game or schedule data is unavailable or inconsistent. Condition: The IFA user selects a game or schedule entry that the system cannot locate or that contains inconsistent data. The system informs the IFA user that the selected item cannot be used for notification and logs the issue. The IFA user may choose to select another game or schedule entry, returning to Step 3, or abandon the operation, in which case the use case terminates without a sent notification.",
    "EF-3 (from Step 6): Notification dispatch to recipients fails globally. Condition: The system is unable to dispatch the notification to any recipients due to a critical failure in the notification mechanism. The system records the failure, flags the notification as not dispatched, and informs the IFA user that the notification could not be sent. The use case continues at Step 7 to show a failure summary, and the IFA user's goal of successfully notifying stakeholders is not achieved in this execution.",
    "EF-4 (from Step 6): Notification dispatch partially fails. Condition: The system dispatches the notification to some but not all intended recipients. The system records which recipients were not reached and marks their delivery status as failed, then informs the IFA user that the notification was only partially delivered. The flow then continues at Step 7, where the status summary reflects partial success and identifies that not all stakeholders were notified."
  ],
  "information_for_steps": [
    "1. IFA user identifier, authentication credentials, session token.",
    "2. Notification creation option selection, list of available games and schedule entries, notification type selection (cancellation or rescheduling).",
    "3. Selected game identifier, selected schedule identifier, existing game and schedule details required for notification validity checks.",
    "4. Notification content text, structured fields for describing cancellation or rescheduling details, derived preliminary recipient groups based on game and stakeholder relationships.",
    "5. Finalized notification summary, final recipient list derived from stakeholder relationships, notification metadata such as creation timestamp and IFA user identifier.",
    "6. Recipient identifiers, dispatch timestamps, delivery status indicators for each recipient, references to notification delivery mechanism.",
    "7. Notification status summary data, counts of targeted recipients, counts of successful and failed deliveries, overall dispatch state.",
    "8. Persistent notification record, recipient association records, dispatch history logs, audit information linking the notification to the initiating IFA user."
  ]
}