{
  "use_case_name": "Manage Appointments",
  "unique_id": "UC-002",
  "area": "Appointment Scheduling and Management",
  "context_of_use": "This use case describes how patients, doctors, and receptionists use the hospital management system to create, modify, cancel, and review appointments while viewing related schedules, available time slots, and associated patient and room information.",
  "scope": "UHOPE Hospital Management System",
  "level": "User-goal",
  "primary_actors": [
    "patient",
    "doctor",
    "receptionist"
  ],
  "supporting_actors": [
    "uhope"
  ],
  "stakeholders_and_interests": [
    "patient: Wants to schedule, review, and cancel appointments and see available time slots and reasons to ensure convenient and accurate care.",
    "doctor: Wants to enter and view appointment information, see their schedule and patient visit reasons to prepare for consultations.",
    "receptionist: Wants to schedule, modify, cancel, and review appointments and view schedules for rooms, doctors, and nurses to manage operational planning.",
    "uhope: Wants an appointment scheduling process that supports automatic approval and cancellation constraints to reduce manual workload and ensure efficient resource use."
  ],
  "description": "Manage Appointments allows patients, doctors, and receptionists to create, modify, cancel, and review appointments in the hospital management system, using available time slots, schedules, and appointment details while enforcing organizational rules such as automatic approval and cancellation time limits.",
  "triggering_event": "An actor initiates an action to create, modify, cancel, or review an appointment using the hospital management system.",
  "trigger_type": "External",
  "preconditions": [
    "The hospital management system is online and accessible.",
    "The initiating actor is authenticated in the system according to their role-specific login requirements.",
    "The initiating actor has sufficient access rights to perform appointment-related actions for the relevant patient and doctor.",
    "The Electronic Medical Record Database and scheduling data required for appointment management are available."
  ],
  "postconditions": [
    "The appointment schedule in the system reflects all successfully created, modified, or cancelled appointments.",
    "Relevant schedules for doctors, rooms, and nurses are updated to reflect any changes to appointments.",
    "For successfully cancelled appointments, the associated appointment is marked as cancelled and is no longer available for future use.",
    "For successfully created or modified appointments, appointment details including time, duration, assigned doctor, and reason are stored and can be viewed via the appointment details view."
  ],
  "assumptions": [
    "It is assumed that user authentication and authorization, including two-factor authentication where applicable, are handled by separate login-related use cases and are already successfully completed before appointment management begins.",
    "It is assumed that viewing appointment details is a distinct included use case, and this use case will invoke it as a mandatory step whenever appointment information is inspected or confirmed.",
    "It is assumed that the automatic approval of patients’ appointments by the scheduling system occurs immediately upon successful creation of the appointment without requiring receptionist intervention, unless the receptionist explicitly disapproves the appointment.",
    "It is assumed that the constraint allowing patients to cancel their appointments up until 12 hours before the appointment start time is enforced by the scheduling system based on stored appointment times.",
    "It is assumed that the system maintains doctor, room, and nurse schedules and exposes them as read-only views to the receptionist for planning purposes.",
    "It is assumed that when a receptionist cancels an appointment, the scheduling system is capable of sending an email notification to the patient using contact information already stored in the system.",
    "It is assumed that when a doctor enters appointment information, the doctor is entering details for appointments that already exist in the scheduling system or are being created within this use case.",
    "It is assumed that when a receptionist views a patient’s medical file for an appointment, appropriate access control rules are enforced by the system but the access control logic itself is outside the scope of this use case.",
    "It is assumed that the National Database for Medical Records and billing systems mentioned elsewhere are external systems and are not directly manipulated in this use case beyond reading or writing appointment-related information already present in the hospital management system.",
    "It is assumed that nurse schedules and room schedules exist in the system even though nurses are not listed among the primary participating actors of this use case."
  ],
  "requirements_met": [
    "The system shall allow a doctor to enter appointment information into the system so that the doctor can review what was done when the patient next visits.",
    "The system shall allow a receptionist to view a patient’s medical file to confirm that the person present is the correct patient for the appointment.",
    "The system shall allow a receptionist to view a doctor’s schedule, including on a tablet device, to check the doctor’s availability.",
    "The system shall allow a receptionist to manually change the start time of an appointment to reflect a later than expected start.",
    "The system shall allow a receptionist to manually change the end time of an appointment to reflect a longer than expected duration.",
    "The system shall allow a patient to view their doctor’s available time slots so that the patient can schedule an appointment.",
    "The system shall allow a receptionist to manually disapprove an appointment in order to cancel it when the doctor is unavailable.",
    "The system shall allow a patient to select a reason for scheduling an appointment so that the doctor can prepare in advance.",
    "The system shall cause the scheduling component to automatically send an email notification to the patient when a receptionist cancels an appointment.",
    "The system shall provide a room schedule view to the receptionist so that the receptionist can assign appointments to specific rooms.",
    "The system shall provide a nurse schedule view to the receptionist so that the receptionist can assign a nurse to an appointment.",
    "The system shall provide a doctor schedule view to the receptionist so that the receptionist can reschedule appointments if needed.",
    "The system shall allow a receptionist to manually choose a time slot to schedule an appointment for a patient who contacts the hospital.",
    "The system shall allow a patient to cancel their appointment using the scheduling system.",
    "The system shall enforce that patients can only cancel their appointments up until 12 hours before the appointment start time through the scheduling system.",
    "The system shall allow a doctor to view their own schedule so that they can see upcoming patients and prepare for appointments.",
    "The system shall allow a doctor to view the recorded reason for a patient’s appointment so that the doctor can prepare.",
    "The scheduling system shall automatically approve a patient’s appointment upon successful creation without requiring manual receptionist approval.",
    "The system shall support viewing appointment details as part of managing appointments when creating, modifying, or reviewing an appointment."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The policy for resolving conflicts when multiple actors attempt to modify the same appointment concurrently has not been specified.",
    "The rules for handling overbooking or double-booking of doctors, rooms, or nurses have not been clearly defined.",
    "The exact format, content, and language of the automatic cancellation email sent to patients have not been determined.",
    "The handling of timezone differences for patients or staff accessing the system remotely has not been specified.",
    "The behavior of the system when email delivery to the patient fails during cancellation notification has not been defined."
  ],
  "main_flow": [
    "1. Actor (patient or receptionist) requests to create a new appointment or modify an existing appointment in the scheduling interface → System displays the appointment creation or modification screen including relevant fields and available controls.",
    "2. Actor (patient or receptionist) selects the doctor for the appointment → System retrieves and displays the selected doctor’s schedule, including available time slots for the relevant date range.",
    "3. Actor (patient or receptionist) selects an available time slot for the appointment → System validates that the selected time slot is free for the chosen doctor, room, and nurse resources according to current schedules.",
    "4. Actor (patient or receptionist) enters or confirms patient identification and selects or confirms the reason for the appointment → System records the appointment reason and associates the appointment with the identified patient.",
    "5. Actor (receptionist) optionally assigns or confirms the room and nurse for the appointment using the room and nurse schedules → System validates room and nurse availability for the selected time slot and links the selected resources to the appointment.",
    "6. Actor (doctor or receptionist) enters or updates detailed appointment information such as notes or planned treatments → System stores the appointment information and associates it with the appointment record for later review.",
    "7. System executes the included use case \"view appointment details\" to present a consolidated summary of the appointment including date, time, doctor, patient, room, nurse, and reason.",
    "8. Actor (patient, doctor, or receptionist) confirms the appointment creation or modification based on the displayed appointment details → System saves the new or updated appointment, automatically approves the appointment according to configured rules, and updates all affected schedules.",
    "9. Actor (patient, doctor, or receptionist) later requests to review an existing appointment in the scheduling interface → System retrieves the selected appointment and executes the included use case \"view appointment details\" to display the appointment information.",
    "10. Actor (patient or receptionist) requests to cancel an existing appointment that is still eligible for cancellation according to the 12-hour rule → System marks the appointment as cancelled, updates affected schedules, and if the cancelling actor is a receptionist, automatically sends a cancellation email to the patient."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): Actor (doctor) requests to review their own schedule without creating or modifying a specific appointment → System displays the doctor’s schedule view and executes the included use case \"view appointment details\" when the doctor selects a specific appointment entry, after which the doctor may close the view and the use case ends successfully.",
    "AF-2 (from Step 3): Actor (receptionist) wishes to reschedule an existing appointment instead of creating a new one → System displays current appointment data, the actor selects a new available time slot from the doctor, room, and nurse schedules, and the flow continues at Step 5 with updated time slot information.",
    "AF-3 (from Step 4): Actor (patient) changes the appointment reason before confirming the appointment → System updates the recorded reason for the appointment and redisplays the updated appointment details; the flow continues at Step 7.",
    "AF-4 (from Step 5): Actor (receptionist) decides to only assign a room but not a nurse for the appointment → System associates the room with the appointment, leaves the nurse unassigned, and the flow continues at Step 6.",
    "AF-5 (from Step 8): Actor (patient) reviews the displayed appointment details and decides not to confirm the appointment → System discards the unconfirmed appointment data and returns the actor to the appointment overview; the use case ends successfully without creating or modifying the appointment.",
    "AF-6 (from Step 10): Actor (patient) cancels an appointment within the allowed 12-hour window and the system does not send an email because the organisation’s policy is to only email for receptionist-initiated cancellations → System completes the cancellation, updates schedules, and the use case ends successfully."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): The system cannot retrieve the doctor’s schedule due to a data access or availability problem → System displays an error message indicating that the doctor’s schedule is temporarily unavailable, does not allow selection of time slots, logs the error, and the use case terminates for this attempt.",
    "EF-2 (from Step 3): The selected time slot becomes unavailable before the actor confirms the appointment due to another booking or change → System notifies the actor that the selected time slot is no longer available, clears the selected slot, refreshes the schedule view, and returns the flow to Step 3 for selection of a new time slot.",
    "EF-3 (from Step 4): The system cannot validate or associate the patient identification due to missing or inconsistent patient data → System shows an error indicating that the patient cannot be identified, requests that the actor correct the patient identification information, and, if the issue persists, stops the appointment creation or modification process.",
    "EF-4 (from Step 5): The chosen room or nurse is no longer available for the selected time slot at the time of assignment → System notifies the receptionist that the resource is unavailable, removes the conflicting selection, refreshes the room and nurse schedules, and returns the flow to Step 5 to select alternative resources.",
    "EF-5 (from Step 8): The system encounters an internal error while saving or approving the appointment → System displays an error indicating that the appointment could not be saved, rolls back any partial changes to schedules or appointment data, logs the incident, and the use case attempt ends without a created or modified appointment.",
    "EF-6 (from Step 10): A patient attempts to cancel an appointment less than 12 hours before the appointment start time → System rejects the cancellation request, informs the patient that the cancellation period has passed, keeps the appointment status unchanged, and the use case ends for this cancellation attempt."
  ],
  "information_for_steps": [
    "1. Actor role, appointment action type (create or modify), appointment identifier (for modify), user session data.",
    "2. Doctor identifier, doctor schedule data, date range, existing appointments for the doctor.",
    "3. Selected time slot, doctor availability, room availability, nurse availability, conflict-checking data.",
    "4. Patient identifier, appointment reason, patient-doctor relationship, validation status of patient data.",
    "5. Room identifier, nurse identifier, room schedule, nurse schedule, resource availability flags.",
    "6. Appointment notes, planned treatments, duration adjustments, linkage to patient and doctor records.",
    "7. Consolidated appointment details including appointment identifier, date, start time, end time, doctor, patient, room, nurse, status, and reason.",
    "8. Confirmation flag from actor, final appointment record, approval status, updated schedules for doctor, room, and nurse.",
    "9. Appointment selection criteria, retrieved appointment record, appointment details for viewing.",
    "10. Appointment identifier, appointment start time, current system time, cancellation eligibility status, patient contact information, cancellation status, and email dispatch data for receptionist-initiated cancellations."
  ]
}