{
  "use_case_name": "Receive Congestion Insights",
  "unique_id": "UC-006",
  "area": "Urban Mobility Planning and Traffic Simulation",
  "context_of_use": "An urban mobility planner uses the system to monitor the impact of planned or simulated traffic measures and receive congestion-related insights, including notifications of congestion and suggested solution options, in order to support decision-making about urban mobility proposals.",
  "scope": "Urban Mobility Planning Support System",
  "level": "User-goal",
  "primary_actors": [
    "urban mobility planner"
  ],
  "supporting_actors": [
    "Configured Traffic Simulation Engine"
  ],
  "stakeholders_and_interests": [
    "Urban mobility planner: Wants to be notified when a measure leads to congestion and to receive suggested solutions so that congestion is not overlooked and potential resolutions can be explored.",
    "City administration: Wants congestion impacts of proposed measures to be understood and mitigated to improve mobility and citizen satisfaction.",
    "Citizens and road users: Want traffic measures that avoid excessive congestion and its negative consequences such as delays and pollution.",
    "Environmental agencies: Want congestion-related impacts to be identified early so that environmental burden from traffic is minimized.",
    "Emergency services: Want major congestion situations to be identified and appropriately mitigated to maintain route accessibility."
  ],
  "description": "This use case describes how an urban mobility planner receives congestion notifications when a configured or simulated traffic measure leads to congestion and obtains system-suggested solution options for that congestion to support analysis and decision-making.",
  "triggering_event": "The urban mobility planner starts monitoring the impact of a configured traffic measure or simulation scenario and requests congestion insights from the system.",
  "trigger_type": "External",
  "preconditions": [
    "The urban mobility planner is authenticated and authorized to use the Urban Mobility Planning Support System.",
    "At least one traffic measure or simulation scenario is already defined and available for analysis in the system.",
    "The Configured Traffic Simulation Engine is available for evaluating congestion impacts based on defined measures or scenarios.",
    "Baseline traffic data and model parameters required for congestion evaluation are already configured in the system."
  ],
  "postconditions": [
    "The system has presented the urban mobility planner with at least one congestion notification for the evaluated measure or scenario when congestion is detected, or an explicit indication that no congestion was detected.",
    "The system has presented the urban mobility planner with suggested solution options for each detected congestion situation.",
    "The planner’s review of the presented congestion notifications and suggested solutions is recorded in the current analysis context so that it can be referenced in subsequent planning activities."
  ],
  "assumptions": [
    "It is assumed that the detailed creation and configuration of measures or simulation scenarios occurs in separate use cases and that such measures or scenarios are available prior to this use case.",
    "It is assumed that the Configured Traffic Simulation Engine can derive congestion indicators from existing traffic models without requiring the planner to configure additional low-level model parameters in this use case.",
    "It is assumed that suggested solutions for congestion are generated by predefined decision-support logic within the system based on available traffic data and scenarios.",
    "It is assumed that the system is capable of presenting congestion insights and suggested solutions in a format that can be understood and interpreted by an urban mobility planner without requiring additional training within this use case.",
    "It is assumed that time resolution and spatial granularity for congestion evaluation have been configured at system level and are not modified within this use case."
  ],
  "requirements_met": [
    "The system shall notify the urban mobility planner when a configured or simulated traffic measure leads to congestion.",
    "The system shall provide congestion notifications in a way that allows the urban mobility planner to avoid overlooking congestion situations.",
    "The system shall generate and present suggested solutions for detected traffic congestion to the urban mobility planner.",
    "The system shall allow the urban mobility planner to request congestion insights for selected measures or simulation scenarios.",
    "The system shall present congestion insights and suggested solutions in a reproducible manner associated with the corresponding measure or simulation scenario."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The acceptable thresholds and criteria used by the system to classify traffic conditions as congestion are not defined and require specification.",
    "The decision logic, data sources, and constraints used to generate suggested congestion solutions are not defined and require clarification.",
    "The required response time between the planner requesting congestion insights and the system presenting notifications and suggested solutions is not specified.",
    "The required level of detail for congestion notifications (e.g., segment-level, area-level, time-slice granularity) has not been determined.",
    "The mechanism for the planner to confirm, dismiss, or annotate congestion notifications and suggested solutions is not specified."
  ],
  "main_flow": [
    "1. Urban mobility planner selects an existing traffic measure or simulation scenario to evaluate → System loads the selected measure or scenario and its associated configuration for analysis.",
    "2. Urban mobility planner requests congestion insights for the selected measure or simulation scenario → System initiates an evaluation of traffic conditions for the selected measure or scenario using the Configured Traffic Simulation Engine or available analysis results.",
    "3. Urban mobility planner waits for evaluation results → System computes congestion indicators for relevant network segments and time periods associated with the selected measure or scenario.",
    "4. Urban mobility planner observes that evaluation results are available → System determines whether the selected measure or scenario leads to one or more congestion situations based on configured congestion criteria.",
    "5. Urban mobility planner views the congestion notification summary → System presents a summary of all detected congestion situations related to the selected measure or scenario to the urban mobility planner.",
    "6. Urban mobility planner selects a specific congestion situation from the summary for further insight → System displays detailed information about the selected congestion situation, including location and timing information derived from the evaluation.",
    "7. Urban mobility planner requests suggested solutions for the selected congestion situation → System generates and presents suggested solution options for the selected congestion situation based on predefined decision-support logic.",
    "8. Urban mobility planner reviews the suggested solutions → System records that the congestion insights and suggested solutions have been presented in the context of the selected measure or simulation scenario and maintains them for subsequent reference."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): If the evaluation results for the selected measure or simulation scenario have already been computed and stored by the system, the system shall reuse the existing evaluation results instead of initiating a new computation and shall proceed directly to the behavior described in Step 4.",
    "AF-2 (from Step 5): If multiple categories or severity levels of congestion are available, the system shall allow the urban mobility planner to filter or sort the congestion notification summary by category or severity before proceeding to Step 6.",
    "AF-3 (from Step 7): If the system has generated multiple distinct suggested solution options for the selected congestion situation, the system shall present them in a ranked or clearly differentiated list, and after the urban mobility planner reviews them, the flow continues with Step 8."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): If the system cannot initiate the evaluation due to unavailability of the Configured Traffic Simulation Engine, the system shall inform the urban mobility planner that congestion insights cannot currently be generated and shall terminate the use case without computing or presenting congestion notifications or suggested solutions.",
    "EF-2 (from Step 4): If the system fails to determine congestion due to missing or inconsistent input data for the selected measure or simulation scenario, the system shall display an error message describing that congestion evaluation is not possible for this configuration and shall stop further processing in this use case.",
    "EF-3 (from Step 4): If the system successfully completes the evaluation and determines that no congestion situations occur for the selected measure or simulation scenario, the system shall explicitly inform the urban mobility planner that no congestion has been detected and shall terminate the use case without generating suggested solutions.",
    "EF-4 (from Step 7): If the system fails to generate suggested solution options for a detected congestion situation due to internal errors or missing decision-support parameters, the system shall display a message indicating that no suggested solutions are available and shall allow the urban mobility planner to close the congestion detail view, after which the use case ends without suggested solutions."
  ],
  "information_for_steps": [
    "1. Selected measure or simulation scenario identifier; associated configuration metadata.",
    "2. Congestion insight request parameters; reference to selected measure or simulation scenario.",
    "3. Network topology data; traffic demand data; simulation or analytical model parameters; computational status information.",
    "4. Computed congestion indicators; configured congestion thresholds and criteria; evaluation status.",
    "5. Congestion notification summary data, including list of congestion situations, locations, time intervals, and severity classifications.",
    "6. Detailed congestion situation data, including network elements affected, time-series of traffic performance indicators, and contextual measure or scenario attributes.",
    "7. Input parameters for decision-support logic, including congestion characteristics and contextual constraints; generated suggested solution options and associated metadata.",
    "8. Presentation records of congestion notifications and suggested solutions, including timestamp, selected measure or simulation scenario reference, and planner review context."
  ]
}