{
  "use_case_name": "Review Sensor Data",
  "unique_id": "UC-006",
  "area": "Urban Mobility Analysis",
  "context_of_use": "The use case enables an urban mobility planner to review emission and traffic levels from individual sensors to support situational assessment of mobility measures and proposals.",
  "scope": "Urban Mobility Planning Decision Support System",
  "level": "User-goal",
  "primary_actors": [
    "urban mobility planner"
  ],
  "supporting_actors": [
    "Pollution Sensor",
    "Traffic Sensor"
  ],
  "stakeholders_and_interests": [
    "Urban mobility planner: Wants to review emission and traffic levels from individual sensors to consider environmental and traffic effects when assessing measures.",
    "City administration: Wants planning decisions to be based on objective sensor data for congestion, traffic, and environmental impact.",
    "Environmental agencies: Want emission data from pollution sensors to be correctly represented to evaluate environmental effects of measures.",
    "Traffic management department: Wants traffic level data to be accurately accessible to support mobility planning and congestion management.",
    "Citizens and neighborhoods: Want fair and environmentally conscious decisions that consider local traffic and emission levels."
  ],
  "description": "This use case describes how an urban mobility planner reviews emission and traffic levels from individual sensors to support the evaluation of mobility measures and solutions.",
  "triggering_event": "The urban mobility planner decides to review emission or traffic levels at a specific sensor for situational assessment of a measure or proposal.",
  "trigger_type": "External",
  "preconditions": [
    "The urban mobility planner has authenticated access to the Urban Mobility Planning Decision Support System.",
    "The system has stored or can access emission data from at least one pollution sensor.",
    "The system has stored or can access traffic level data from at least one traffic sensor.",
    "The relevant sensor identifiers and their locations are already configured in the system."
  ],
  "postconditions": [
    "The system has displayed emission and/or traffic level data for the selected sensor to the urban mobility planner.",
    "The urban mobility planner has access to sensor data suitable for considering environmental and traffic effects in the assessment of measures or proposals.",
    "Any sensor selection and viewed data parameters for the current review session are retained in the session state for potential further analysis."
  ],
  "assumptions": [
    "It is assumed that all pollution and traffic sensors are external devices that provide their data to the system through existing data acquisition mechanisms, and this use case only reads data already available to the system.",
    "It is assumed that historical sensor data may be available, but this use case focuses on reviewing data for a planner-selected time span without adding new analytical capabilities beyond data display.",
    "It is assumed that the urban mobility planner can uniquely identify the sensor of interest through attributes such as sensor name, identifier, or location, which are already maintained by the system.",
    "It is assumed that any missing or delayed sensor data is handled by existing data ingestion processes and that this use case only needs to handle the absence of data by informing the planner.",
    "It is assumed that the planner selects whether to review traffic levels or emission levels, or both, and the system presents only the corresponding data types without performing additional simulations or predictions.",
    "It is assumed that sensor units of measurement and basic metadata are already defined in the system and can be displayed without requiring configuration changes within this use case.",
    "It is assumed that access control policies already permit the urban mobility planner to view all relevant sensor data, and this use case does not modify permissions."
  ],
  "requirements_met": [
    "The system shall allow the urban mobility planner to select a pollution sensor and review its emission levels so that environmental effects are considered.",
    "The system shall allow the urban mobility planner to select a traffic sensor and review its traffic levels so that traffic levels are considered.",
    "The system shall display sensor identification and location information together with the emission or traffic data to support situational assessment.",
    "The system shall allow the urban mobility planner to specify a time range for which emission levels of a selected pollution sensor are displayed.",
    "The system shall allow the urban mobility planner to specify a time range for which traffic levels of a selected traffic sensor are displayed.",
    "The system shall present sensor data in a format that supports visual inspection of emission and traffic levels (for example, tabular and/or graphical presentation) without altering the underlying data.",
    "The system shall indicate clearly to the urban mobility planner when no data is available for the selected sensor and time range."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The required minimum and maximum time range for reviewing sensor data has not been defined.",
    "The exact formats (graphical, tabular, or both) and level of aggregation for displaying sensor data have not been specified.",
    "The refresh frequency or recency requirements for sensor data used in the review have not been determined.",
    "The behavior when multiple sensors of the same type exist at the same location has not been clarified (for example, selection rules or grouping)."
  ],
  "main_flow": [
    "1. Urban mobility planner initiates sensor data review by navigating to the sensor data review function → System displays the sensor data review interface with options to select sensor type and sensor.",
    "2. Urban mobility planner selects the type of sensor data to review (emission or traffic) → System filters available sensors to those matching the selected data type.",
    "3. Urban mobility planner selects a specific sensor from the filtered sensor list → System displays the selected sensor’s identification and location details.",
    "4. Urban mobility planner specifies a time range for which to review data for the selected sensor → System validates the time range and prepares to retrieve data for the specified interval.",
    "5. Urban mobility planner confirms the request to view sensor data for the selected sensor and time range → System retrieves the corresponding emission or traffic data for the selected sensor and time range.",
    "6. Urban mobility planner waits while the system processes the request → System presents the retrieved sensor data for the selected sensor and time range in a readable format, including any relevant units of measurement.",
    "7. Urban mobility planner reviews the displayed sensor data for situational assessment of measures and proposals → System keeps the sensor data view available and allows the planner to continue analysis or close the review.",
    "8. Urban mobility planner ends the review of sensor data → System records the end of the review session and returns to the higher-level planning or analysis interface."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): Urban mobility planner chooses to review both emission and traffic data types concurrently. Condition: The planner needs to compare emission and traffic levels for related sensors. The planner selects emission as the sensor data type and reviews pollution sensors, then changes the sensor data type selection to traffic within the same review session. The system switches the available sensor list to traffic sensors and allows the planner to select a traffic sensor and repeat Steps 3 through 7 for traffic data before proceeding to Step 8.",
    "AF-2 (from Step 4): Urban mobility planner accepts the system’s default time range. Condition: The planner does not need a custom time interval. The system proposes a default recent time range (for example, the last 24 hours) when displaying the time range selection. The planner confirms the default time range without modification, and the system continues with Step 5 using the default interval.",
    "AF-3 (from Step 3): Urban mobility planner refines sensor selection criteria. Condition: The initial sensor list is large. The planner applies additional filters such as neighborhood or street name to narrow the sensor list. The system updates the sensor list to reflect the refined criteria, the planner selects a sensor from the refined list, and the flow resumes at Step 4."
  ],
  "exception_flows": [
    "EF-1 (from Step 3): Selected sensor is unavailable. The system detects that the selected sensor is marked as inactive or disconnected. The system informs the urban mobility planner that the sensor is currently unavailable and prompts the planner to select a different sensor. The flow returns to Step 3.",
    "EF-2 (from Step 4): Invalid time range specified. The system detects that the requested time range is invalid (for example, start time is after end time or the range exceeds allowed limits). The system displays an error message describing the issue and prompts the urban mobility planner to correct the time range. The flow returns to Step 4.",
    "EF-3 (from Step 5): No data available for the selected sensor and time range. The system retrieves no records for the given sensor and time interval. The system notifies the urban mobility planner that no data is available for the selected criteria and offers options to adjust the time range or change the sensor. If the planner adjusts the criteria, the flow returns to Step 4 or Step 3 accordingly; otherwise, the planner may end the review, and the flow proceeds to Step 8.",
    "EF-4 (from Step 5): Data retrieval fails due to a system or connectivity error. The system cannot access stored sensor data during retrieval. The system displays an error notification indicating that sensor data could not be retrieved and suggests that the planner try again later. The system aborts the current request and returns the planner to the sensor data review interface at Step 2."
  ],
  "information_for_steps": [
    "1. Access credentials of the urban mobility planner; sensor data review function identifier.",
    "2. Sensor data type (emission or traffic); list of available sensors by type.",
    "3. Selected sensor identifier; sensor name; sensor location and type metadata.",
    "4. Selected start date and time; selected end date and time; default time range parameters.",
    "5. Sensor identifier; validated time range; data retrieval parameters for emission or traffic data.",
    "6. Retrieved sensor data points; timestamps; measurement units; data presentation configuration.",
    "7. Displayed sensor data set; planner’s current analysis context (e.g., related measure or proposal reference maintained externally to this use case).",
    "8. Session identifiers; navigation target for the higher-level planning or analysis interface."
  ]
}