{
  "use_case_name": "Access Electronic Medical Record",
  "unique_id": "UC-013",
  "area": "Patient Management",
  "context_of_use": "This use case allows patients to access permitted portions of their electronic medical records from different devices.",
  "scope": "Hospital Management System",
  "level": "User-goal",
  "primary_actors": [
    "patient"
  ],
  "supporting_actors": [],
  "stakeholders_and_interests": [
    "patient: access their medical information"
  ],
  "description": "Allow patients to access permitted portions of their electronic medical records from different devices.",
  "triggering_event": "Patient requests to access their electronic medical record.",
  "trigger_type": "External",
  "preconditions": [
    "Patient is authenticated in the system.",
    "Patient has permissions to access their electronic medical record."
  ],
  "postconditions": [
    "Patient successfully views the permitted portions of their electronic medical record."
  ],
  "assumptions": [
    "The system has a mechanism to manage access control for patient records.",
    "Patients have the necessary devices to access their records."
  ],
  "requirements_met": [
    "The system shall allow patients to access their electronic medical records.",
    "The system shall ensure that only permitted portions of the records are accessible."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "Clarification on which portions of the medical record are accessible to patients."
  ],
  "main_flow": [
    "1. Patient requests to access their electronic medical record → System verifies patient authentication and permissions.",
    "2. System retrieves permitted portions of the electronic medical record → System displays the electronic medical record to the patient."
  ],
  "alternative_flows": [
    "AF-1 (from Step 1): If the patient does not have the necessary permissions, then the system informs the patient that access is denied."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): If the patient authentication fails, then the system displays an error message and prompts for re-authentication."
  ],
  "information_for_steps": [
    "1. Patient credentials",
    "2. Patient permissions",
    "3. Electronic medical record data"
  ]
}