{
  "use_case_name": "Receive Fairness Alerts",
  "unique_id": "UC-007",
  "area": "Urban Mobility Planning and Impact Assessment",
  "context_of_use": "The use case occurs when an urban mobility planner evaluates or reports on mobility measures and needs to be alerted if any configured measure leads to disproportionate negative impacts on specific neighborhoods in order to address fairness concerns.",
  "scope": "Urban Mobility Planning Decision Support System",
  "level": "User-goal",
  "primary_actors": [
    "urban mobility planner"
  ],
  "supporting_actors": [
    "Internal Impact Analysis Engine"
  ],
  "stakeholders_and_interests": [
    "Urban mobility planner: Wants to be notified when a mobility measure disadvantages a neighborhood to ensure fairness is increased.",
    "City administration: Wants mobility measures to avoid unfairly disadvantaging specific neighborhoods in order to maintain equitable service provision.",
    "Residents of affected neighborhoods: Want to avoid disproportionate negative impacts from mobility measures and expect planners to correct unfair outcomes.",
    "Environmental and social policy bodies: Want transparency and accountability that implemented measures do not disadvantage particular neighborhoods."
  ],
  "description": "This use case describes how the system notifies the urban mobility planner when an evaluated or reported mobility measure is detected to disadvantage specific neighborhoods, enabling the planner to consider fairness in decision-making.",
  "triggering_event": "The system completes an impact analysis of a mobility measure as part of a measure evaluation or reporting process and detects that the measure disadvantages one or more neighborhoods according to configured fairness criteria.",
  "trigger_type": "External",
  "preconditions": [
    "The urban mobility planner is authenticated and authorized to access the Urban Mobility Planning Decision Support System.",
    "At least one mobility measure is defined in the system for evaluation or reporting.",
    "Neighborhoods and their associations with road segments, sensors, or other relevant spatial units are configured in the system.",
    "Fairness evaluation rules or criteria for determining when a measure disadvantages a neighborhood are configured and active in the system.",
    "The system is capable of executing impact analyses of mobility measures using available traffic, congestion, and related data."
  ],
  "postconditions": [
    "The urban mobility planner has received a notification indicating that at least one neighborhood is disadvantaged by the evaluated mobility measure according to the configured fairness criteria.",
    "The system has recorded the generated fairness alert together with the referenced measure and impacted neighborhoods for later review.",
    "The fairness status of the evaluated measure is available within the system for use in subsequent reporting on the fairness of the measure."
  ],
  "assumptions": [
    "It is assumed that the Urban Mobility Planning Decision Support System already performs impact analyses of measures as part of separate use cases such as reporting on measure impacts, even though these use cases are not fully specified here.",
    "It is assumed that fairness in this context refers strictly to the relative disadvantage of specific neighborhoods compared to others, without introducing additional social or economic dimensions not mentioned in the requirements.",
    "It is assumed that the system has access to sufficient data from existing modeling capabilities (e.g., congestion, emissions, noise, traffic levels) to determine when a measure disadvantages a neighborhood, but this use case only consumes the resulting fairness determination and does not define new analysis algorithms.",
    "It is assumed that notifications are delivered within the system’s user interface (e.g., as on-screen alerts or messages) and that no external messaging channels such as email or SMS are required or introduced by this use case.",
    "It is assumed that the relationship of type \"extend\" to a broader \"report measure impacts\" use case means that fairness alerts are generated as an optional extension when that broader use case runs an analysis that yields a disadvantaged neighborhood.",
    "It is assumed that measures include any modeled interventions such as adjusted speed limits, reversible lanes, road closures, adaptive traffic lights, congestion-modifying scenarios, or similar actions already supported by the system.",
    "It is assumed that the system maintains a unique identifier for each measure and each neighborhood to allow the notification to reference them unambiguously.",
    "It is assumed that time-dependent elements such as traffic situations at past dates or simulated crises may be part of the impact analysis context, but this use case only concerns whether the resulting measure outcome disadvantages a neighborhood.",
    "It is assumed that the fairness alert does not itself modify any measure but only informs the planner, who remains responsible for any subsequent changes to the measure in other use cases.",
    "It is assumed that the urban mobility planner can access further details about the impacted neighborhoods and underlying analysis by navigating from the fairness alert to existing analysis views provided by other use cases."
  ],
  "requirements_met": [
    "The system shall notify the urban mobility planner if an evaluated mobility measure disadvantages one or more neighborhoods, so that fairness can be increased.",
    "The system shall evaluate the impact of a mobility measure on neighborhoods against configured fairness criteria as part of the measure impact analysis process and determine whether any neighborhood is disadvantaged.",
    "The system shall generate a fairness alert that identifies the affected mobility measure and the disadvantaged neighborhoods when the fairness criteria indicate a disadvantage.",
    "The system shall present the generated fairness alert to the urban mobility planner in the user interface at the time the impact analysis results are available.",
    "The system shall store each generated fairness alert together with a reference to the corresponding mobility measure and impacted neighborhoods for later review in related reporting use cases."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The exact quantitative or qualitative fairness criteria for determining when a neighborhood is disadvantaged by a measure are not defined and require policy specification.",
    "The required level of detail in fairness alerts (for example, whether to include only neighborhood identifiers or also underlying metrics such as congestion or emissions) has not been specified.",
    "The timing and frequency of fairness evaluations (for example, only on explicit analysis runs versus continuously during scenario adjustments) are not described and need clarification.",
    "User interface behavior for handling multiple simultaneous fairness alerts and their prioritization has not been defined.",
    "Data retention and archival policies for stored fairness alerts and their linkage to historical reports on measure impacts remain to be determined."
  ],
  "main_flow": [
    "1. Urban mobility planner initiates or continues evaluation or reporting of a specific mobility measure within the system → System loads the selected mobility measure and prepares to perform impact analysis including fairness evaluation.",
    "2. Urban mobility planner confirms or executes the analysis of the selected mobility measure (for example, as part of generating a report on measure impacts) → System executes the impact analysis for the selected mobility measure using configured data and rules, including evaluation of fairness impacts on neighborhoods.",
    "3. Urban mobility planner awaits analysis results on the user interface → System determines, based on the fairness evaluation, that one or more neighborhoods are disadvantaged by the analyzed mobility measure according to the configured fairness criteria.",
    "4. Urban mobility planner views the analysis outcome on the user interface → System generates a fairness alert object containing the identifier of the analyzed mobility measure, the identifiers of the disadvantaged neighborhoods, and a textual summary of the fairness issue.",
    "5. Urban mobility planner is presented with the fairness alert in the user interface alongside the general impact results → System displays the fairness alert prominently to the urban mobility planner, indicating that the analyzed mobility measure disadvantages one or more specific neighborhoods.",
    "6. Urban mobility planner acknowledges or records the fairness alert for consideration in planning decisions → System stores the fairness alert together with references to the mobility measure and impacted neighborhoods for future review and for use in related reporting on the fairness of the measure."
  ],
  "alternative_flows": [
    "AF-1 (from Step 3): Fairness evaluation does not detect disadvantaged neighborhoods as an extension of reporting measure impacts. Condition: The system completes the impact analysis of the selected mobility measure and the fairness evaluation determines that no neighborhood is disadvantaged according to the configured criteria. Flow: Instead of generating a fairness alert in Steps 4–6, the system records that the measure has no detected disadvantaged neighborhoods for the current analysis run and completes the display of general impact results to the urban mobility planner. The flow then ends successfully without any fairness alert being presented.",
    "AF-2 (from Step 5): Planner reviews additional impact details before acknowledging the fairness alert. Condition: Upon seeing the fairness alert, the urban mobility planner chooses to inspect detailed impact information for the disadvantaged neighborhoods prior to acknowledging the alert. Flow: The urban mobility planner navigates from the fairness alert to existing detailed impact views for the referenced neighborhoods and measure; the system displays the detailed impact information using existing reporting capabilities. After reviewing the details, the urban mobility planner returns to the main analysis screen and proceeds with Step 6 to acknowledge or record the fairness alert."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): Fairness evaluation cannot be completed due to missing or inconsistent neighborhood configuration. Condition: During impact analysis, the system detects that neighborhoods or their associations with relevant spatial units required for fairness evaluation are missing or inconsistent. Flow: The system aborts the fairness evaluation for the current analysis run, logs the configuration error, and displays an error message to the urban mobility planner indicating that fairness evaluation could not be completed due to configuration issues. The system still displays any general impact results that do not depend on fairness evaluation, but no fairness alert is generated. The use case terminates without achieving the goal of notifying about disadvantaged neighborhoods.",
    "EF-2 (from Step 2): Fairness analysis fails due to internal processing error. Condition: An internal processing error or data problem occurs while executing the fairness evaluation. Flow: The system stops the fairness evaluation process, logs the error for technical investigation, and displays a generic analysis failure message indicating that fairness-related results are unavailable for the current run. No fairness alert is generated, and the urban mobility planner may attempt the analysis again after the underlying issue is resolved. The use case terminates unsuccessfully with respect to fairness notification.",
    "EF-3 (from Step 5): Notification display fails on the user interface. Condition: The system successfully generates a fairness alert but encounters an error while rendering or presenting the alert in the user interface. Flow: The system logs the user interface error, stores the fairness alert as usual in persistent storage, and attempts to display a fallback message indicating that a fairness alert exists but could not be fully rendered. If fallback display is also not possible, the system ensures that the alert is available for later retrieval once the interface issue is resolved. The use case partially completes, with the alert created and stored but not fully presented to the planner at the time of analysis."
  ],
  "information_for_steps": [
    "1. Mobility measure identifier, measure configuration parameters.",
    "2. Mobility measure identifier, traffic and congestion data, fairness evaluation rules, neighborhood configuration data.",
    "3. Analysis run identifier, fairness evaluation intermediate results flag.",
    "4. Mobility measure identifier, disadvantaged neighborhood identifiers, fairness evaluation outcome, fairness alert summary text.",
    "5. Fairness alert object, user interface notification metadata, display timestamp.",
    "6. Fairness alert identifier, mobility measure identifier, disadvantaged neighborhood identifiers, planner acknowledgment status, persistence timestamp."
  ]
}