{
  "use_case_name": "Analyze Self-Service Center Data",
  "unique_id": "UC-008",
  "area": "Data Analysis and Reporting",
  "context_of_use": "UHOPE employees use the hospital management system to access a self-service center that mirrors the Electronic Medical Record Database, in order to browse, search, and select data variables needed for data analysis.",
  "scope": "Hospital Management System – Self-Service Data Center Module",
  "level": "User-goal",
  "primary_actors": [
    "uhope employee"
  ],
  "supporting_actors": [
    "uhope"
  ],
  "stakeholders_and_interests": [
    "UHOPE: Wants a self-service center that holds the same data as the Electronic Medical Record Database to enable employees to perform data analysis without creating additional data silos.",
    "UHOPE employee: Wants to view, search, and select data in the self-service center in order to decide which data to use for analysis and to perform data analysis efficiently.",
    "Hospital management: Wants consistent and accurate data to support informed decision making based on analysis results.",
    "IT operations: Wants a predictable and maintainable synchronization mechanism between the Electronic Medical Record Database and the self-service center to ensure data availability for analysis."
  ],
  "description": "This use case describes how a UHOPE employee accesses the self-service center to work with data that is synchronized with the Electronic Medical Record Database, including viewing all available data, searching data by keyword, and selecting specific variables for subsequent data analysis.",
  "triggering_event": "A UHOPE employee decides to perform or prepare a data analysis using data from the self-service center.",
  "trigger_type": "External",
  "preconditions": [
    "The Hospital Management System is operational and reachable by the UHOPE employee.",
    "The UHOPE employee is authenticated and authorized to access the self-service center.",
    "The self-service center is configured to hold the same data as the Electronic Medical Record Database.",
    "A recent synchronization between the Electronic Medical Record Database and the self-service center has been successfully completed according to the organization’s operational procedures."
  ],
  "postconditions": [
    "The UHOPE employee has viewed the available data in the self-service center relevant for analysis.",
    "The UHOPE employee has optionally performed keyword-based searches to locate specific data in the self-service center.",
    "The UHOPE employee has selected one or more variables in the self-service center for use in further data analysis.",
    "The system has persisted the employee’s current selection of variables for the duration of the session or for subsequent analysis steps, according to configured behavior."
  ],
  "assumptions": [
    "The Hospital Management System already provides authentication and authorization for UHOPE employees and these mechanisms are executed before this use case starts.",
    "The synchronization between the Electronic Medical Record Database and the self-service center is handled by background processes not initiated directly by the UHOPE employee within this use case.",
    "The phrase \"holds the same data\" means that the self-service center contains a copy or synchronized view of the relevant data fields from the Electronic Medical Record Database required for analysis, without adding new types of data.",
    "Data analysis itself (such as running statistical models or generating reports) is outside the scope of this use case; this use case ends with the selection of variables for analysis.",
    "The user interface of the self-service center provides mechanisms to display data, accept keyword input, display search results, and allow selection of variables without introducing behavior beyond viewing, searching, and selecting.",
    "Data access in the self-service center respects the same underlying access control constraints that apply in the Electronic Medical Record Database, so that employees only see data they are allowed to access.",
    "Keyword search is performed over data attributes that have been configured by UHOPE or system administrators, and this configuration is in place before this use case is executed.",
    "Variable selection refers to choosing data attributes, fields, or columns that the UHOPE employee intends to use as inputs for later analysis, and does not alter the underlying stored medical records.",
    "The self-service center is part of or tightly integrated with the broader Hospital Management System described in the requirements, and uses the same availability and data protection constraints.",
    "Any performance aspects of synchronization and searching (such as response times) are governed by non-functional requirements defined elsewhere and are not extended in this use case."
  ],
  "requirements_met": [
    "The system shall provide a self-service center that holds the same data as the Electronic Medical Record Database to enable employees to perform data analysis.",
    "The system shall allow a UHOPE employee to view all data available to them in the self-service center so that they can decide on which data to perform data analysis.",
    "The system shall allow a UHOPE employee to search for specific data in the self-service center by keyword so that they can perform data analysis.",
    "The system shall allow a UHOPE employee to select which variables they want to use in the self-service center so that they can perform data analysis.",
    "The system shall ensure that data made available in the self-service center is based on the data stored in the Electronic Medical Record Database, subject to the same access control restrictions applicable to the UHOPE employee."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The required maximum latency and frequency for synchronizing data from the Electronic Medical Record Database to the self-service center have not been specified.",
    "The retention policy and storage duration for data in the self-service center, especially derived or cached copies, need to be clarified to ensure compliance with applicable regulations such as GDPR.",
    "The exact scope of \"all of the data\" that a UHOPE employee may view in the self-service center needs policy definition, including any role-based restrictions or pseudonymization requirements.",
    "The behavior of keyword search with respect to partial matches, case sensitivity, supported languages, and searchable fields has not been defined.",
    "It is unclear whether variable selections must be persisted across user sessions or are only required to exist for the duration of a single session.",
    "The user interface requirements for displaying large volumes of data (pagination, filtering, sorting) have not been detailed.",
    "Error handling behavior when synchronization between the Electronic Medical Record Database and the self-service center is delayed or fails is not yet specified."
  ],
  "main_flow": [
    "1. UHOPE employee initiates access to the self-service center through the Hospital Management System interface → System authenticates the employee, verifies authorization to use the self-service center, and displays the self-service center start view.",
    "2. UHOPE employee requests to view all available data in the self-service center → System retrieves the data accessible to the employee from the self-service center and presents an overview of the available data sets or records.",
    "3. UHOPE employee reviews the displayed overview of data in the self-service center → System allows navigation and scrolling through the displayed data overview without altering underlying data.",
    "4. UHOPE employee enters one or more keywords to search for specific data within the self-service center → System executes a keyword-based search over the accessible self-service center data and displays the corresponding search results.",
    "5. UHOPE employee reviews the displayed search results to identify relevant data → System highlights or otherwise presents the search results in a way that allows the employee to distinguish and select data elements or variables.",
    "6. UHOPE employee selects one or more variables from the displayed data or search results for use in further analysis → System records the selected variables as the employee’s current analysis selection within the self-service center context.",
    "7. UHOPE employee confirms completion of variable selection for analysis → System finalizes the current selection of variables and indicates that the data is ready to be used in subsequent analysis activities supported by other system functions."
  ],
  "alternative_flows": [
    "AF-1 (from Step 2): UHOPE employee chooses to refine the initial data overview before searching. Condition: The employee wants to narrow down the visible data without using keywords. The employee applies available filters such as data category or time period in the self-service center interface, and the system updates the overview to only show data that matches the selected filters. The flow then continues with Step 3 for reviewing the refined data overview.",
    "AF-2 (from Step 4): UHOPE employee chooses to perform multiple consecutive searches. Condition: The first search does not reveal all desired data. After viewing the initial search results, the employee modifies or replaces the keyword input and requests another search. The system executes the new search and replaces the results with those matching the updated keywords. This alternative flow may repeat as needed, after which the flow continues with Step 5 when the employee is satisfied with the results.",
    "AF-3 (from Step 6): UHOPE employee adjusts previously selected variables before confirmation. Condition: The employee decides to change the variable selection. The employee deselects one or more previously selected variables and may select additional variables from the same displayed data or search results. The system updates the recorded set of selected variables accordingly. After adjustments, the flow returns to Step 7 for confirmation of the final selection."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): Authentication or authorization fails. Condition: The UHOPE employee cannot be authenticated or lacks permission to access the self-service center. The system denies access to the self-service center, displays an error message indicating that access is not allowed, and does not proceed with any further steps in this use case.",
    "EF-2 (from Step 2): Data retrieval from the self-service center fails. Condition: The system cannot retrieve the data overview due to internal error or unavailable data store. The system logs the failure, displays an error message to the employee indicating that data cannot be loaded at this time, and terminates the use case without proceeding to viewing, searching, or variable selection.",
    "EF-3 (from Step 4): Keyword search execution fails. Condition: The system fails to perform the keyword search because of internal processing or connectivity issues. The system logs the error, informs the employee that the search cannot be completed, maintains any previously displayed data overview (if available), and returns control to the employee without moving to Step 5.",
    "EF-4 (from Step 6): Variable selection cannot be saved. Condition: The system is unable to record the employee’s selected variables due to a persistence or session error. The system displays an error message indicating that the selection could not be saved, discards the attempted selection, and allows the employee to attempt the selection again or exit the use case."
  ],
  "information_for_steps": [
    "1. Employee identifier, authentication credentials, employee role, self-service center access rights.",
    "2. Synchronized self-service data set metadata, employee access control rules, data overview parameters.",
    "3. Data overview records, display configuration settings such as sort order and pagination settings.",
    "4. Keyword input string, search scope definition, search configuration parameters.",
    "5. Search result records, relevance indicators, links between records and available variables.",
    "6. List of selectable variables, selected variable identifiers, current selection set associated with the employee’s session.",
    "7. Finalized variable selection set, confirmation status, handoff indicator for subsequent analysis functions."
  ]
}