{
  "use_case_name": "Configure Traffic Measures",
  "unique_id": "UC-002",
  "area": "Urban Mobility Planning and Traffic Simulation",
  "context_of_use": "The use case is executed when an urban mobility planner configures or adjusts traffic control measures in a traffic modeling system to analyze and validate the effects of these measures on urban mobility.",
  "scope": "Urban Mobility Planning System",
  "level": "User-goal",
  "primary_actors": [
    "urban mobility planner"
  ],
  "supporting_actors": [
    "Traffic Data Repository"
  ],
  "stakeholders_and_interests": [
    "Urban mobility planner: Requires accurate and flexible configuration of traffic measures to review the effects of proposals on congestion and mobility.",
    "City administration: Requires that configured measures can be reliably analyzed to support decision making about urban mobility policies.",
    "Citizens and road users: Are affected by changes in traffic measures and have an interest in fair, safe, and efficient mobility solutions.",
    "Environmental agencies: Are concerned that configured traffic measures can later be assessed for environmental impact such as emissions and noise.",
    "Emergency services: Depend on realistic configurations of traffic measures for later crisis and emergency scenario simulations."
  ],
  "description": "This use case describes how an urban mobility planner configures and adjusts traffic control measures, including speed limits, reversible lanes, roundabouts, adaptive traffic lights, and road closures, within the Urban Mobility Planning System to enable subsequent analysis of the effects of these measures.",
  "triggering_event": "The urban mobility planner decides to configure or adjust a traffic control measure in the Urban Mobility Planning System.",
  "trigger_type": "External",
  "preconditions": [
    "The Urban Mobility Planning System is operational and accessible to the urban mobility planner.",
    "The urban mobility planner is authenticated and authorized to configure traffic measures in the system.",
    "A planning project or solution context in which traffic measures can be configured exists and is selected.",
    "Baseline traffic network data, including existing roads and intersections, is available in the system."
  ],
  "postconditions": [
    "The selected traffic measure configuration is stored in the Urban Mobility Planning System as part of the current solution or scenario.",
    "The updated traffic network configuration is available for subsequent simulation and analysis of the effects of the configured measure.",
    "A record of the configured or adjusted traffic measure, including its parameters, is persistently associated with the relevant planning project or solution."
  ],
  "assumptions": [
    "It is assumed that the Urban Mobility Planning System already contains a digital representation of the road network, including links, intersections, and existing control devices.",
    "It is assumed that only one primary actor, the urban mobility planner, interacts directly with the Urban Mobility Planning System for configuring traffic measures.",
    "It is assumed that the terms \"adjust speed limits\", \"configure reversible lanes\", \"model roundabouts\", \"model adaptive traffic lights\", and \"close roads\" refer to parameter changes of already modeled network elements and do not require the creation of completely new road segments beyond what is represented in the baseline network.",
    "It is assumed that saving a configuration of traffic measures does not itself execute any simulation but prepares data that can be used by separate simulation or analysis use cases.",
    "It is assumed that the Traffic Data Repository is an internal or integrated data source that provides network and configuration data and does not require separate user interaction in this use case.",
    "It is assumed that the requirement to review effects of the measure is fulfilled by other use cases, and in this use case the goal is limited to setting up and storing the traffic measures for later analysis."
  ],
  "requirements_met": [
    "The Urban Mobility Planning System shall allow the urban mobility planner to adjust speed limits for selected road segments so that the effects of this measure can later be reviewed.",
    "The Urban Mobility Planning System shall allow the urban mobility planner to configure the direction and operation of reversible lanes so that the effects of this measure can later be reviewed.",
    "The Urban Mobility Planning System shall allow the urban mobility planner to model and configure roundabouts in the traffic network so that the effects of this measure can later be reviewed.",
    "The Urban Mobility Planning System shall allow the urban mobility planner to model and configure adaptive traffic lights, including their operational parameters, so that the effects of this measure can later be reviewed.",
    "The Urban Mobility Planning System shall allow the urban mobility planner to close down selected roads within the traffic network so that the effects of this measure can later be reviewed.",
    "The Urban Mobility Planning System shall persist the configured traffic measures as part of a planning solution or scenario for subsequent simulation and analysis."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The specific parameter sets required for each traffic measure type (e.g., speed limit units, time-of-day patterns for reversible lanes, control logic parameters for adaptive traffic lights) need to be defined.",
    "The governance rules determining which road segments and measures an urban mobility planner is authorized to configure are not specified.",
    "Versioning and change-tracking requirements for successive configurations of traffic measures within the same planning project are not described.",
    "Constraints on simultaneous configuration of multiple measures on the same road segment (e.g., interaction between closures, speed limits, and lane reversals) are not defined.",
    "User interface requirements for selecting and visualizing network elements and applied measures remain unspecified."
  ],
  "main_flow": [
    "1. Urban mobility planner selects an active planning project or solution context → System loads and displays the corresponding traffic network and associated configuration workspace.",
    "2. Urban mobility planner chooses to configure traffic measures within the selected project → System presents available traffic measure types such as speed limits, reversible lanes, roundabouts, adaptive traffic lights, and road closures.",
    "3. Urban mobility planner selects a traffic measure type to configure (speed limit, reversible lane, roundabout, adaptive traffic light, or road closure) → System highlights the selected measure type and prompts the planner to select relevant network elements.",
    "4. Urban mobility planner selects one or more affected network elements (e.g., road segments, intersections, or lanes) for the chosen measure type → System visually marks the selected network elements and prepares them for parameter input.",
    "5. Urban mobility planner specifies configuration parameters for the chosen traffic measure on the selected network elements (for example, new speed limit value, lane direction schedule, roundabout geometry parameters, adaptive traffic light control parameters, or road closure state and duration) → System validates the entered parameters for format and allowable ranges and previews the configured measure on the network view.",
    "6. Urban mobility planner confirms the configured traffic measure for the selected network elements → System applies the configuration to the working version of the traffic network in the current planning project.",
    "7. Urban mobility planner optionally repeats configuration for additional traffic measure types or additional locations within the same planning project → System updates the working traffic network configuration with each confirmed measure while maintaining a coherent scenario.",
    "8. Urban mobility planner saves the updated set of configured traffic measures for the current planning project → System persists the traffic measure configurations, associates them with the project or solution, and indicates that the updated configuration is available for subsequent simulation and analysis."
  ],
  "alternative_flows": [
    "AF-1 (from Step 3): Planner switches selected measure type before configuring parameters. Condition: After selecting an initial traffic measure type, the urban mobility planner decides to configure a different type instead. The planner selects another traffic measure type from the list → System changes the active measure type selection and prompts again for relevant network element selection, after which the flow continues with Step 4.",
    "AF-2 (from Step 4): Planner modifies network element selection. Condition: After initially selecting network elements, the urban mobility planner decides to add or remove elements from the selection. The planner adjusts the selection of road segments, intersections, or lanes → System updates the highlighted network elements and keeps the configuration context active, after which the flow continues with Step 5.",
    "AF-3 (from Step 5): Planner adjusts parameters before confirmation. Condition: After viewing the preview of the configured measure, the urban mobility planner decides to change parameter values. The planner edits the configuration parameters (such as speed limit values or timing options) → System revalidates the new parameters and updates the preview of the configured measure, after which the flow returns to Step 6.",
    "AF-4 (from Step 7): Planner decides not to configure additional measures. Condition: After configuring at least one traffic measure, the urban mobility planner decides that no further measures are needed in this session. The planner indicates completion of configuration → System keeps the last applied configuration as the current working state and proceeds directly to Step 8.",
    "AF-5 (from Step 8): Planner saves configuration under a new scenario name. Condition: The urban mobility planner wants to store the new configuration as a variant while preserving an earlier configuration. The planner specifies a new scenario or solution name during save → System creates a separate stored configuration instance associated with the new name and confirms its availability for later selection."
  ],
  "exception_flows": [
    "EF-1 (from Step 1): Project or solution context cannot be loaded. Condition: The system fails to load the selected planning project due to missing data or technical error. System displays an error message indicating that the project could not be loaded and provides the reason if available, does not alter any existing configurations, and terminates the use case.",
    "EF-2 (from Step 5): Entered configuration parameters are invalid. Condition: The urban mobility planner provides parameter values that violate validation rules (for example, out-of-range speed limits or inconsistent timing values). System rejects the invalid parameters, displays validation error messages indicating the issues, and prompts the planner to correct the parameters; the use case continues with Step 5 once valid parameters are provided or ends if the planner cancels configuration.",
    "EF-3 (from Step 6): Measure conflicts with existing network constraints. Condition: Applying the configured measure would violate predefined network consistency constraints (for example, closing all access to a critical node where at least one connection must remain open, according to defined rules). System displays a conflict notification, does not apply the conflicting configuration, and offers the planner the option to revise the measure, returning to Step 4 for reselection or Step 5 for parameter adjustment; if the planner cancels, the use case ends with no changes applied for that measure.",
    "EF-4 (from Step 8): Failure to persist configured measures. Condition: A storage or communication error occurs while saving the updated traffic measure configuration. System notifies the planner that saving failed, retains the in-memory working configuration where possible, and prompts the planner to retry the save operation or cancel; if the planner cancels, the use case ends with the assurance that previously persisted configurations remain unchanged."
  ],
  "information_for_steps": [
    "1. Planning project identifier, solution context identifier, baseline traffic network data.",
    "2. List of supported traffic measure types, user role permissions for measure configuration.",
    "3. Selected traffic measure type identifier, measure description metadata.",
    "4. Network element identifiers (road segment IDs, intersection IDs, lane IDs) and spatial references.",
    "5. Measure-specific configuration parameters (e.g., speed limit value and units, lane direction and schedule, roundabout parameters, adaptive signal timing and control settings, road closure status and timeframe) and validation rules.",
    "6. Confirmed configuration set for the selected measure and mapping to affected network elements.",
    "7. Aggregate set of configured traffic measures and their associations to the working traffic network state in the current project.",
    "8. Persistent configuration record, scenario or solution identifier, timestamp of save operation, and reference to the planning project."
  ]
}