{
  "use_case_name": "Link External Devices",
  "unique_id": "UC-005",
  "area": "Medical Record Device Integration",
  "context_of_use": "Users link supported external or fitness devices to the medical record system so that data generated by these devices can be uploaded automatically and used within the patient’s medical record.",
  "scope": "Medical Record Management System",
  "level": "User-goal",
  "primary_actors": [
    "nurse",
    "doctor",
    "patient"
  ],
  "supporting_actors": [
    "External Device"
  ],
  "stakeholders_and_interests": [
    "Patient: Wants control over which external or fitness devices are linked and who can see the generated data, while maintaining privacy and confidentiality.",
    "Doctor: Wants external devices to be reliably linked so that automatically uploaded measurements and results are available for assessment and treatment decisions.",
    "Nurse: Wants to link external devices so that patient-related measurements are captured automatically without manual data entry.",
    "Lab Specialist: Wants consistent, consolidated medical records that may incorporate relevant device data for interpretation together with lab results.",
    "Receptionist: Wants the system to remain stable and available while device linkage occurs so that other administrative operations are not disrupted.",
    "Hospital Administration: Wants secure, auditable linking of external devices to comply with confidentiality and security policies.",
    "System Owner: Wants authenticated access and explicit patient authorization to reduce liability and unauthorized data access."
  ],
  "description": "This use case describes how a nurse, doctor, or patient links an external or fitness device to the medical record system, after user authentication and patient authorization, so that the device can upload its generated data automatically into the corresponding patient medical record.",
  "triggering_event": "A nurse, doctor, or patient decides to connect an external or fitness device to the system so that its generated data can be uploaded automatically.",
  "trigger_type": "External",
  "preconditions": [
    "The system is operational and reachable from the user’s current device.",
    "The user has a valid unique login (username and password) or DigiD account registered in the system.",
    "The user has successfully authenticated to the system.",
    "The patient whose medical record will receive the device data has an existing medical record in the system.",
    "The patient has granted authorization for linking the specific external or fitness device to the medical record and for sharing its generated data with the involved users.",
    "The external or fitness device is powered on and technically capable of being connected to the system."
  ],
  "postconditions": [
    "The selected external or fitness device is successfully linked to the system for the relevant patient medical record.",
    "The system has stored the linkage configuration, including the association between the external or fitness device and the patient medical record.",
    "The system is configured to receive and automatically upload data generated by the linked external or fitness device to the patient medical record, subject to the patient’s data visibility settings.",
    "An audit-relevant record of the device-linking operation, including acting user and timestamp, is stored by the system."
  ],
  "assumptions": [
    "It is assumed that the \"authenticate\" included use case covers all user login mechanisms mentioned in the requirements, including DigiD and unique username and password, and that authentication is successfully completed before the device-linking steps begin.",
    "It is assumed that the \"control device authorization\" included use case covers the patient’s ability to give or reject authorization to link an external device and to control who can see the generated data.",
    "It is assumed that only authenticated users who are allowed to act on the relevant patient medical record may initiate the linking of an external or fitness device for that record.",
    "It is assumed that the external or fitness device is already registered or technically supported by the system so that a logical representation of the device can be selected within the system.",
    "It is assumed that the automatic upload of data from the external or fitness device will use an existing, configured communication channel between the device and the system and that establishing this communication channel does not require new system capabilities beyond what is implied by linking the device.",
    "It is assumed that failures in actual data transmission after successful linking (for example, temporary connectivity loss) are handled by lower-level technical mechanisms and are outside the logical scope of this use case.",
    "It is assumed that all actors performing this use case have the necessary domain permissions and legal rights according to organizational policies, but the detailed policies are defined outside this specification."
  ],
  "requirements_met": [
    "The system shall allow a nurse to link an external device to the software so that the data generated can be uploaded automatically to the software.",
    "The system shall allow a doctor to link an external device to the software so that the data generated can be uploaded automatically to the software.",
    "The system shall allow a patient to link a fitness device to the software so that the patient can make use of the data that is generated by the fitness device.",
    "The system shall require that users authenticate successfully before they can link an external or fitness device to the software.",
    "The system shall require that the patient gives explicit authorization before an external or fitness device is linked to the patient’s medical record.",
    "The system shall allow the patient to reject authorization for linking an external or fitness device to the patient’s medical record.",
    "The system shall, after successful linking and authorization, automatically upload data generated by the linked external or fitness device to the corresponding patient medical record.",
    "The system shall associate each linked external or fitness device with exactly one patient medical record so that device data is stored in the correct record.",
    "The system shall record an audit trail entry each time an external or fitness device is linked to a patient medical record, including the acting user and timestamp."
  ],
  "priority": "High",
  "risk": "Medium",
  "outstanding_issues": [
    "The criteria and governance for which roles (nurse, doctor, patient) may initiate device linking for a specific patient record require clarification by organizational policy.",
    "The maximum number of external or fitness devices that may be linked to a single patient medical record has not been specified.",
    "The detailed list of supported external and fitness device types and communication standards has not been defined.",
    "The frequency and granularity of automatic data uploads from linked devices to the system remain to be specified.",
    "The retention period and storage limits for data originating from linked external or fitness devices are not defined.",
    "The exact scope of data visibility controls for device-generated data (for example, per-measurement vs. per-device) requires further specification."
  ],
  "main_flow": [
    "1. Actor (nurse, doctor, or patient) initiates a session by requesting access to the system login interface → System displays the authentication interface to the actor.",
    "2. Actor submits valid authentication credentials using the chosen supported method (for example, unique username and password or DigiD) → System verifies the credentials and establishes an authenticated session for the actor.",
    "3. Actor navigates to the patient medical record for which an external or fitness device is to be linked → System retrieves and displays the selected patient medical record according to the actor’s access rights.",
    "4. Actor requests to manage external or fitness devices for the displayed patient medical record → System displays the device-authorization options for the patient medical record, including the option to grant or review authorization for linking a specific external or fitness device.",
    "5. Actor (acting as or on behalf of the patient) confirms that the patient grants authorization to link the selected external or fitness device to the patient medical record and to use its generated data according to the patient’s privacy settings → System records the patient’s authorization decision and updates the authorization status for the selected external or fitness device for that patient medical record.",
    "6. Actor selects the option to link a new external or fitness device for the authorized patient medical record → System displays the list or input form of supported external and fitness devices that can be linked to the patient medical record.",
    "7. Actor selects the specific external or fitness device to be linked and provides any required device identification or connection information → System validates the provided device information and confirms that the device is eligible to be linked for the selected patient medical record.",
    "8. Actor confirms the device-linking operation for the selected external or fitness device → System establishes the logical linkage between the patient medical record and the external or fitness device and stores the linkage configuration.",
    "9. Actor reviews the summary of the linked external or fitness device and completes the process → System displays a confirmation that the external or fitness device is successfully linked and indicates that future data generated by the device will be automatically uploaded and associated with the patient medical record, subject to the patient’s visibility settings."
  ],
  "alternative_flows": [
    "AF-1 (from Step 3): If the actor is the patient and chooses to link a device to their own medical record, the actor directly opens their personal medical record from the home screen instead of searching for a patient record. The system displays the patient’s own medical record and the use case continues at Step 4.",
    "AF-2 (from Step 5): If the patient has previously granted authorization for the same external or fitness device for the selected medical record and the authorization remains valid, the actor reviews the existing authorization settings without changing them. The system confirms that authorization is already in place and the use case continues at Step 6.",
    "AF-3 (from Step 6): If the external or fitness device has already been linked earlier to the same patient medical record, the actor selects the existing entry to view or confirm the linkage status. The system displays the existing linkage details and confirms that the device remains linked; the use case then proceeds directly to Step 9 with a confirmation review."
  ],
  "exception_flows": [
    "EF-1 (from Step 2): If the submitted authentication credentials are invalid or the authentication process fails, the system rejects access, displays an error message, and allows the actor to retry authentication; the use case does not proceed to Step 3 until authentication succeeds.",
    "EF-2 (from Step 3): If the actor does not have sufficient access rights to view or act on the selected patient medical record, the system denies access to the record, displays an authorization error message, and terminates the use case without linking any device.",
    "EF-3 (from Step 5): If the patient rejects authorization to link the selected external or fitness device or withdraws previously granted authorization during this process, the system records the rejection, prevents linking of the device to the patient medical record, displays a notification to the actor, and terminates the use case without creating a device linkage.",
    "EF-4 (from Step 7): If the provided device identification or connection information is invalid, incomplete, or corresponds to an unsupported device, the system rejects the device selection, displays an appropriate error message, and prompts the actor to correct the information or select another supported device; the use case does not progress to Step 8 until the information is valid.",
    "EF-5 (from Step 8): If the system fails to establish the logical linkage with the external or fitness device due to a technical error, the system rolls back any partial linkage configuration, logs the failure, informs the actor of the problem, and terminates the use case without a linked device."
  ],
  "information_for_steps": [
    "1. Login request data, authentication method selection.",
    "2. Authentication credentials (username, password, DigiD token or equivalent), session identifier.",
    "3. Patient identifier, user role, access-rights context.",
    "4. Patient medical record identifier, device-authorization settings, current user permissions.",
    "5. Patient authorization decision, device identifier, authorization timestamp, authorization scope for data sharing.",
    "6. List of supported external and fitness devices, patient medical record identifier, device selection parameters.",
    "7. Selected device identifier, device type, device connection or pairing information, validation results.",
    "8. Device–patient linkage configuration, linkage status flag, linkage timestamp, acting user identifier.",
    "9. Linked device summary, confirmation message, automatic data-upload configuration, audit-log entry reference."
  ]
}